//
//  CaltualWordStore.swift
//  Hassouseisei_ver_2_0
//
//  Created by 岡大輔 on 2015/08/28.
//  Copyright (c) 2015年 岡大輔. All rights reserved.
//

import UIKit

class CaltualWordStore: WordStore {

    override func returnCaption() -> String{
        return "文化用語"
    }
    
    override func ReturningWordArray() -> Array<String>{
        var ReturnWordArray:[String] = []
        
        var wordStore = ["アアラ島","アアラシマ","藍","アイ","あい","藍色瑠璃双六子","相内川","相生の曲","相長川","秋穂八幡宮","秋鹿川","アイカガワ","相掛沢川","相川","相川川","アイカワガワ","相川斎場","相川沢川","愛川町営斎場愛川聖苑",
            "相ヶ谷川","阿井川","逢川","藍川","安威川","合川","相木川","相木家住宅","合釘","合口","相窪川","相河川","愛光商会吉浜寮","相後川","愛子谷川","愛西市斎場","相坂川","藍鮫皮","相去川","相沢","相沢川","愛沢川","会沢川",
            "藍島","愛珠幼稚園園舎","相代川","藍地花菱唐草文散紋小袖","安居島","アイジマ","アイスランド共和国","相津川","会津川","合月の法華寺","会津高野","会津西部斎苑","会津大仏","会津中田観世音","逢妻男川","逢妻川",
            "逢妻女川","会津若松市斎場","合瀬川","愛染院","愛染寺","相瀬","アイゼンイン","逢初川","愛染川","愛染家住宅主屋","愛染家住宅西蔵","愛染家住宅離れ","愛染家住宅東蔵","愛染堂","アイゼンドウ","愛染不動感見記",
            "愛蔵寺","藍染川","相染川","靉靆橋","相谷川","相玉の庚申","間川","相田川","会田川","愛嶽神社","間鍔","阿井谷川","愛知川用水","相知ヶ入川","愛知学院大学楠元学舎第１号館","愛知県護国神社","愛知県民の森","愛知県庁本庁舎",
            "愛知県豊田大塚古墳出土須恵器","愛知高原国定公園","愛知三島","愛知大学旧本館","愛知のオマント","愛知用水","合津川","相月川","相坪川","会津新宮城跡","会津正阿弥","会津只見の生産用具と仕事着コレクション",
            "会津大川用水","会津大塚山古墳出土品","相槌を打つ","会津塗","会津の製蝋用具及び蝋釜屋","会津の初市の習俗","会津藩主松平家墓所","会津本郷焼","会津松平氏庭園","相殿","相泊沼","相内川","相内沢川","藍韋威肩赤大袖",
            "藍韋威肩赤白胴丸","藍韋威肩赤胴丸","藍韋威肩赤膝鎧","藍韋威肩腰白胴丸","藍韋威肩白十二間筋兜","藍韋威肩白胴丸","藍韋威裾紫胴丸","藍韋威腰萌黄大袖","藍韋威胴丸","藍韋威二十八間筋兜","藍韋威腹巻","藍韋威胸紅白紅腹巻",
            "藍韋威胸紅白紅腹巻","藍韋威胸紅白腹巻","藍韋威胸白紅白腹巻","藍韋威鎧","藍韋肩赤威甲冑","藍韋肩白腹巻","愛南町御荘霊苑","アイヌ古式舞踊","アイヌの建築技術及び儀礼","アイヌの生活用具コレクション",
            "アイヌの伝統と近代開拓による沙流川流域の文化的景観","アイヌのまるきぶね","アイヌのユーカラ","相沼内川","相浦川","相の川","愛の川","相野川","相の沢","合ノ沢","相ノ沢川","相野沢","藍之島","相島","相之島",
            "相ノ島","相島積石塚群","相野谷川","相の谷川","相野沼","会之堀川","合登川","合ノ又沢川","合の山沢川","相挟間川","相原川","粟飯原家住宅","藍場川","相場川","合場川","饗庭不動尊","相碆","相引川","愛別川",
            "愛別町火葬場","愛本新用水","相星川","藍洞沢","アイマイ","相舞","相間川","合又川","アイマラ文字","藍見川","相見川","愛見川","相良観音","相良川","姶良川","相良寺","相良のアイラトビカズラ","アイルランド",
            "相割川","相賀八幡神社","アウシュビッツ強制収容所","アウトサイダー・アート","芦浦観音寺","阿吽寺","阿吽洞","アヴァンギャルド","アヴィニヨン","敢国神社","間島","阿閇神社","アエネアス物語図毛綴壁掛","青井阿蘇神社",
            "葵梶葉文染分辻が花染小袖","葵形鐔","青井川","青井さん","青石","青渭神社",]
        
        return ReturnWordArray
        
    }
   
}
