//
//  EngineeringWordStore.swift
//  Hassouseisei_ver_2_0
//
//  Created by 岡大輔 on 2015/07/01.
//  Copyright (c) 2015年 岡大輔. All rights reserved.
//

import Foundation

class EngineeringWordStore: WordStore{
    override func returnCaption() -> String{
        return "工学用語"
    }
    
    override func ReturningWordArray() -> Array<String>{
        var ReturnWordArray:[String] = []
        
        //http://www.weblio.jp/category/engineering/aa/2
        //http://www.weblio.jp/category/engineering/aa/11
        var wordStore = ["アイアンハンド","アイアンワーク","IRST","IED","IHI","IMI","Il-2","Il-76","IAI","ＩＡＥＡ","IA58","合口","愛国号","アイコナール","アイコニック","ＩＣＲＵ","愛称","ＩＣＲＰ","ICV","IJN","IJA",
               "アイスノート","アイスバーン","アイス・オンコイル製氷","アイソクロマティシティ","アイソトープ","アイソパック・マップ","アイソレーター","アイゾット衝撃強さ","相対取引価格","アイデアスケッチ","アイデンティティ",
               "アイドラーアーム","アイドラーギヤ","ホリゾンタルキャブレター","アイドリング振動","アイドリングストップ","アイドリング騒音","アイドリング調整","アイドル安定性","アイドルコントロールバルブ",
               "アイドルポート","アイドルリミッター","I-22","相番","アイボリーコースト・ラリー","アイボルト","アイボーリング","アイボール","アイポイント","合いマーク","アイリプス","アイルトン・セナ","アイルランド解放戦線",
               "アインツェルレンズ","IR法","環境ISO","アイ・ハブ・コントロール","アウター・コンチネンタル・シェルフ","アウターシム式バルブリフター","アウターシート","アウタースライディングサンルーフ","アウターソケット",
               "アウターハンドルカバー","アウターパネル","アウターレース","アウター・コンチネンタル・シェルフ","アウデイ","アウトウニオン","アウトストラーダ","アウトドアライト","アウトバーン","アウトプットギヤ","アウトプットシャフト",
               "アウトボードサスペンション","アウトボードジョイント","アウトライン化","アウトリガー","アウトリーチ活動","アウトレット","アウトレットボックス","アウトレンジ","アウトレンズ形対物レンズ","アウトレンズ検出器",
               "アウト・イン・アウト","アウト・イン・イン","アヴァンシア","アエロクイップ","アエロスパシアル","亜鉛","アエングロ","亜鉛鉄板","亜鉛メッキ","亜鉛めっき","亜鉛めっき鉄線","亜鉛めっき鋼板","レール","青潮","青写真",
               "青熱ぜい性","電解熱処理","青棒","煽り止め","亜音速","銅","赤紙","赤城","赤潮","赤線条項","赤旗法","赤火式","赤水","阿賀沖油・ガス田","アガジャリ油田","阿賀野","上がり框","上り急勾配あり","開き角",
               "アキシャル型ボールテックLSD","アキシャルポンプカップリング4WD","秋田杉","秋津島","秋月","アキュミュレーション","アキュムレータ","アキュムレーター","アキュームレーターユニット","アキーレ・バルツィ",
               "アクアダッグ","アクアドライブシステム","アクアパルス","灰汁洗い","アクシス","アクシデント","アクスル","アクスルシャフト","Lツイン","アクスルステア","アクスルハウジング","アクスルハウジングのＦＣＤ化",
               "アクスルハブ","アクスルビーム","アクスルビーム式サスペンション","アクスルフリー装置","アクセサリー","アクセサリーコンセント","アクセス","アクセスポート","アクセプタンス方式","アクセルセンサー","アクセル全開",
               "アクセルターン","アクセルレスポンス","アクセルワーク","アクセント","アクセント照明","アクセントストライプ","アクチニウム系列","アクチュエータ","アクチュエーター","アクティブ4WS","アクティブエンジンマウント",
               "アクティブキャビンフィルター","アクティブサスペンション","アクティブサスペンション用油圧アクチュエーター","アクティブシート","アクティブ磁気シールド","アクティブ磁場キャンセル装置","アクティブ磁場キャンセラ",
               "アクティブ除振装置","アクティブスタビライザー","アクティブステア","アクティブステルス","アクティブセーフティ","アクティブダンパー","アクティブデフ","アクティブトルクコントロール4WD","アクティブトルクスプリット",
               "アクティブハイトコントロール","アクティブフェイズドアレイレーダー","アクティブフォーシステム","アクティブヘッドレスト","アクティブボディコントロール","アクティブレーダー誘導","アクティブロックアップ機構",
               "アクティブロールオーバープロテクションシステム","アクナキャリー協定","悪の枢軸","悪の帝国","アクリル","アクリルガラス","アクリル強化和紙","アクリル乳白","アクリル乳白和紙貼り","アクリロニトリルブタジエンゴム",
               "悪路走行耐久試験","アクロポリスラリー","アクロマティック面","アグスタウェストランド","アグマ粘度番号","アグレッサー","アグレッシビティ","あけぼの","アコースティック エミッション","アコーディオン戦争",
               "アコード","浅井戸","アサインメント","朝顔","浅皿形燃焼室","浅絞り","浅底リム","アサヒ号 AA型オートバイ","アサブ油田","アサリ","鮮映性","アシスト機構","アシッドフラック","オイルキャッチタンク","足場",
               "足踏み式パーキングブレーキ","足元灯","アシュランド法","アジアカー","アジア原子力協力フォーラム","アジアゲートウェイ構想","アジアパシフィックラリー選手権","アジェンダ２１","アジェンダ21","アジテーター",
               "アジャイル・ファルコン","アジャスタブル","アジャスタブルサスペンション","アジャスタブルシートベルトアンカー","アジャストスクリュー","アジャストボルト","飛鳥","アスカ","アスコット","アスコット・イノーバ",
               "アスター","アストンマーチン","アスピデ","アスファルト","アスファルト固化","アスファルト固化処理施設火災爆発事故","アスファルトコンクリート","アスファルト・サンド","アスファルトシート","アスファルト量",
               "アスファルトルーフィング","アスフェリックスミラー","アスベスト","アスベストフリー","アスベスト・ファイバーボード","アスペクト比","アスペクトレシオ","アスマリ層","アスマン式温湿度計","ASEAN 石油評議会",
               "遊び","遊び車","遊び歯車","アタカ油田","アタック","プラグ","アタッチメント","頭","当り","当たりゲージ","当たり図","アダブティブプログラム＆ニュートラルコントロール付き4AT","アダプター","アダプティブシート",
               "アダプティブ法","アダプティプシフトコントロール","アチザリット","アッカーマンジオメトリー","アッカーマンステア角","アッカーマン・ジャントー理論","圧空成形","アッシャー","圧縮圧力","圧縮機","圧縮機保護サーモ",
               "圧縮強度","圧縮行程","圧縮効率","圧縮成形","圧縮着火機関","圧縮抵抗","圧縮点火","圧縮天然ガス","圧縮天然ガス自動車","圧縮天然ガス船","圧縮特性","圧縮熱","圧縮破壊","オフ車","アッシュトレイ","アッシング",
               "圧接","アッセンブリータイム","圧送式潤滑装置","アッパーアーム","アッパークラス","アッパーストラクチャー","アッパーバックパネル","カプラー","アッパーボデイ","アッパーミドルサイズ","アッパーライト","アッパーレール",
               "アッパーロッキングアーム","アップグレーディング","アップシフト","アップスイープ","アップストリーム","アップトランス","アップドラフトキャブレーター","アップライト","アップリフト","圧延","圧力容器用鋼材",
               "圧延潤滑","圧延車輪","焼なまし双晶","圧締","圧電効果","圧電素子","圧入","圧入指数","圧入パターン","圧密","圧密度","圧造","圧力","圧力解析","圧力開閉器","圧力角","圧力計","圧力校正器","圧力勾配",
               "圧力制御","圧力扇","圧力センサ","圧力損失","圧力調整器","圧力調整装置","圧力調整弁","圧力抵抗","圧力トランデューサー","圧力逃がし弁","圧力発信器","圧力比","圧力噴霧式燃焼装置","圧力容器","冷間圧造用鋼線",
               "当て馬","当金","当盤","後押し","アトキンソンサイクル","後処理装置","後だれ","後突","アトラス","アトレー7","アトレー・ワゴン","後輪横力","後輪独立懸架装置","アドバンサー","アドバンススタジオ","アドバンスドデザイン",
               "アドバンタイヤ","アドバン・クロノグラフ","アドバースヨー","アドヒージョン","アドミラル・オブ・ザ・ソビエトフリート・NG・グズネツォフ","りん青銅","アドミラル・フロータ・ソヴィエツカヴァ・ソユーザ・クズネツォフ",
               "アドルフ・ガーラント","アドルフ・ヒトラー","穴","穴あけ","穴開け加工","アナグリフステレオ","ガルバニック腐食","アナスティグマート","アナプラート","アナログクオーツ時計","アナログ信号","アナログ走査",
               "キャブレター","アナログメーター","アニオン電着塗装","アニマルガード","アニマルバー","アニメーション","アニュラス","アニュラーガスフロー","アニュラー・ブローアウト・プリベンター","アニュラー防噴装置",
               "アニリン点","アニール炉","アニールロ","アネモ形吹き出し口","足乗せ減速","アノマリー","アノード","アバルト","アバロン","アパッチ・ロングボウ","アパーチュアランプ","アビオニクス","アフターグローシステム",
               "アフターサービス","アフターバーナー","アフターバーン","クランク","アフターマーケット","アフターマーケットパーツデザイン","アフリカンコンチネントラリーチャンピオンシップ","アブカイク油田","アブギラブ油田",
               "油回収船","油回転ポンプ","油拡散ポンプ","油吸着シート","油焚燃焼装置","油分光分析法","油分離器","油焼入れ","水焼入れ","油焼け","アブレイダブルシール","アブレシブ摩耗","アブレスト","アブレージョン","アブレータ",
               "アブログ","アブロ・バルカン","アプセット溶接","アプト式鉄道","アプライドフェンダー","アプライドモデル","アプローズ","アプローチ","アプローチ灯","アプローチアングル","アプローチアール","アプローチライト",
               "アベニール","アベレージスピード","アペックスシール","アポトーシス","あまぎり","雨仕舞","あまじまい","雨水コントロールドアミラー","アマモ","アマルキャブレーター","足まわり","網入りガラス","アミノ樹脂",
               "AMRAAM","アムラームスキー","雨センサー","天地","アメリカアフリカ軍","アメリカ宇宙軍","アメリカ沿岸警備隊","アメリカ欧州軍","アメリカ海軍","アメリカ海兵隊","アメリカ艦隊総軍","アメリカ合衆国軍用規格",
               "アメリカ空軍","アメリカ国防総省","アメリカサイバー軍","アメリカ自動車技術会","アメリカ戦略軍","アメリカ太平洋艦隊","アメリカ太平洋軍","アメリカ中央軍","アメリカ統合参謀本部","アメリカ統合戦力軍",
               "アメリカ特殊作戦海軍","アメリカ特殊作戦軍","アメリカ特殊作戦陸軍","アメリカ南方軍","アメリカ方式","アメリカ北方軍","アメリカ輸送軍","アメリカ陸軍","アメリカ陸軍特殊部隊群","アメリカ連邦航空局",
               "アーシング","アメリカンスタイル","アメリカン・グランド・プライズ・レース","アメリカ・フォード","アモタイゼーション","足下灯","アモルファスカーボン","歩み板","あゆみ板","洗い試験","新井敏弘","洗い分析",
               "アライメント","アライメントコイル","アライメントテスター","アライメント変化","あら先","荒し鎚","アラシヅチ","荒ずり","荒ずり皿","新戦闘指揮システム","新燃費規制","新汎用サイズ","アラバスタ","粗引き",
               "線","アラブ石油会議","アラブ石油輸出国機構","アラブ層","アラミド紙","アラミド繊維","アラメ","粗ラッピング","粗利","電解浸炭","アラン・ジョーンズ","アラート待機","アラートハンガー","アラーム","アラームメータ",
               "アラームランプ","ありあけ","アリスター・マクレー","アリスト","亜硫酸ガス","アリ・バタネン","アルアクサ殉教団","二硫他モリブデン","アルカリ骨材反応","アルカンターラ","アルキル基","アルキルシクロブタノン類",
               "アルキレーション","アルキレートガソリン","アルケミ","アルコ形","アルコールエンジン","アルコール温度計","アルコール混合ガソリン","アルコール超音波洗浄機","アルコール凍結割断法","アルコール燃料",
               "アルゴンアーク溶接","アルゴン溶接","アルシオーネ","主照明","主排気","アルゼンチンラリー","アルティス","アルテッツァ","アルテッツァ・ジータ","アルデヒド除去機能付きエアフィルター","アルデンヌ周回レース",
               "アルト","アルピナ","アルピーヌ","アルファ線","アルファ線スペクトロメータ","アルファフィルタ","アルファフリンジ","アルファ崩壊","アルファロメオ","アルファードG/ V","アルフィンドラム","アルプス造山運動",
               "アルベルト・アスカーリ","アルマイト","サーモスタット","アルマイト加工","アルマイト仕上げ","アルマダ","アルミ","アルミ鋳物","アルミシリンダーブロック","アルミシリンダーヘッド","アルミ蒸着リフレクター",
               "アルミセード","アルミ鍛造ピストン","アルミダイカスト","アルミダイクロ反射板","アルミ鋳造ピストン","アルミナ","電解焼入れ","アルミナイジング","アルミナ基板","アルミナセメント","シートレール","アルミニウム",
               "アルミニウム青銅","アルミニウム合金メタル","アドミラルティ黄銅","アルミニウムチタネート","アルミハニカム","アルミブレーキローター","アルミボディ","アルミめっき鋼板","アルミモノコック","アルミ溶解炉","アルミライナー",
               "アルミロールボンドクーラー","アルミン酸三石灰","アルミン酸三カルシウム","二焼き鍛造","アルンガス田","アル・アンサー","アル・アンサー・ジュニア","アレイレーダー","アレス","アレスティングギア","アレスティングフック",
               "アレスティングワイヤー","アレックス","アレックス・ザナルデイ","アレッサンドロ・ナニーニ","アレージ","アロアブル","アロイホイール","アロウズ","アロマティクス","アロー","アローダイヤグラム","アローヘッド",
               "泡原液搬送車","泡消火設備","合わせ板","合わせガラス","合わせピン","泡立ち試験","アワーグラスモード","アンカー","アンカーアーム","アンカーコート","アンカー仕上","アンカー船位保持","アンカーピン",
               "アンカープラグ","アンカーボルト","暗渠","アンギュラーアクセラレーション","アンギュラー軸受け","アンギュラー自動調心ころ軸受け","アンギーユ・マリン油田","アンクルサム","アングライヒ装置","アングル",
               "アングルドデッキ","アングル弁","暗殺","アンサンブル","アンサーバック機能","安山岩","暗視野像","安心情報","アンスケ","安全インターロック","安全衛生委員会","安全衛生管理","安全荷重","安全管理者",
               "安全ガラス","安全規制","安全規制担当省庁","安全規則","安全区域","安全区画","安全靴","安全審査","安全情報","安全情報公開試験","安全スイッチ","安全設計指針","安全装置","安全帯","安全対策","安全地帯",
               "安全超低電圧回路","安全の確保","安全ブレーカー","安全文化","安全弁","安全保障会議","安全率","安全離陸速度","暗騒音","アンダー","アンダーウイング","アンダーカット","アンダーカット型コンプレッションリング",
               "アンダーカバー","アンダーガード","アンダーグラウンドブローアウト","アンダーコート","アンダースクエアエンジン","車載工具","アンダーステア","アンダースラング式","アンダートレッド","アンダーバランス掘削",
               "アンダーフォーカス","アンダーフロアエンジン","アンダーボディ","アンダーライド","アンダーリーマー","アンチアッカーマン","アンチアフターバーンバルブ","アンチエイリアシング","アンチグレアコート剤","アンチスキッド装置",
               "アンチスクォト","アンチスクォトジオメトリー","アンチダイブ","アンチトルク","アンチトルクペダル","アンチノック性","アンチノック剤","アンチラグシステム","アンチリフトジオメトリー","アンチロックブレーキ",
               "アンチロックブレーキシステム","アンチロールバー","アンティークオーク色","変態点","塗装ステンレス鋼","安定化焼なまし","安定型処分場","安定器","安定処理","安定性","安定帯","安定度","安定ヨウ素剤",
               "アンテナ","アンテナ係数","アンディバイデッド・インタレスト","アントニオ・アスカーリ","アントノフ","アントノフAT","An-225","An-124","行灯","アンド回路","アンドリュー・コーワン","アンドレア・デ・チェザリス",
               "アンドロイド","案内システム","案内羽根","アンバー色","アンビエント照明","アンビル","安否情報","アンフィニMS-6","アンフィニMS-8","アンフィニMS-9","アンフィニMX-6","アンブッシュ","アンプ内蔵ルーフアンテナ",
               "アンへドラル・ノーズウイング","アンペア","アンメーター","はく離試験","アンレス・クローズ","アンレス・リース","アンローダー","アンローダー機構","アンロード加速","AFPB","アークスタッド溶接","アークスポット溶接",
               "アーク切断","アーク電圧","アーク放電","アーク溶射","アーク溶接","アース","アース工事","アース線","アース端子","アーチャー","アーチー・スコット－ブラウン","アーティファクト","アート紙","アーマチュア","アーマライト",
               "アーマーライト","アーミングエリア","アーミン・シュバルツ","アーム","アーム式ヒンジ","アーム式レギュレーター","アームストロング式ショックアブソーバー","アームズ・レングス・プライス","アームド","アームレスト",
               "アーリーモデル","アール","R","RIM-116","RIM-7","RIM-156","RIM-161","RIM-162","RIM-66","RS","RSS","RF-61","RMS","RM-70","RAH-66","RAF","アール加工","RQ-1","RQ-4","R-550","R-530",
               "R-37","RC-135","RGM-84","RTB","RD-9","RD-500","RPK","RPG","RPD","RUR-5","RUM-139","アールをつける","アーレイ・バーク"]
        
        ReturnWordArray += wordStore
        
        //http://www.weblio.jp/category/engineering/ii
        //http://www.weblio.jp/category/engineering/ii/2
        //http://www.weblio.jp/category/engineering/ii/5
        wordStore = ["伊400","イエローケーキ","イエローチップ","イエローフラッグ","イオウ","硫黄回収","硫黄酸化物","硫黄島","硫黄島の戦い","硫黄分","イオナイザ","イオン液体","イオンエッチング","イオンエンジン","イオン化",
                 "イオン化エネルギー","イオン化断面積","イオンギャップ","イオンクリーナ","イオン研磨","イオン交換樹脂","イオンコーター","しま状組織","イオンスパッタ装置","イオンスパッタリング","イオンビーム育種",
                 "イオンビームスパッタ装置","イオンプレーティング","イオンポンプ","イオンミリング","イオンめっき","イオージマ","脱酸","いかづち","医学物理士","鋳型法","異形棒","棒","異形管","異形断面バルブスプリング",
                 "異形条","イギリス規格","イギリス軍","イギリス情報局秘密情報部","イギリス・フォード","生沢徹","生塗料","育苗","イグゼルフス","イグナイタ","イグナイター","スプロケット","イグニッション","イグニッションキー",
                 "イグニッションコイル","イグニッションタイミング","イグニッション・カットオフスイッチ","異形鉄筋","異硬度パッド","イゴール・シコルスキー","細粗鋼","尻流れ","石畳路","蝟集","異種倍率同時表示",
                 "意匠","意匠登録","意匠部品","意匠・デザイン性","移植","ＥＣＣＳ","異常吸収","異常凝結","異常高圧","異常コントラスト","異常時の総合訓練","異常透過","異常燃焼","異常表示","イスト","イスラエル軍",
                 "イスラム原理主義","いすゞ","いすゞ 圧縮天然ガスエンジン","いすゞ117クーペ","いすゞBX91型","いすゞD920型ディーゼルエンジン","いすゞＰＡ90型","いすゞＰＲ90型","いすゞＰＳＤ10型","いすゞTL151型",
                 "いすゞTX40型","いすゞTX80型","いすゞエルフトラック","いすゞ大型観光バス「ガーラ｣","いすゞギガ","いすゞトラック","いすゞバス","いすゞヒルマン・ミンクス","いすゞベレット1600ＧＴ","いすゞベレル・ディーゼル",
                 "いずしま","異性化","ISO","位相コントラスト","位相コントラスト伝達関数","位相制御","位相板","イソッタ・フラスキーニ","イソねじ","磯焼け","いそやけ","いそゆき","条","板厚減少","板金","板金化",
                 "板金塗装","板ガラス","板ガラスの組成","依託射撃","委託精製","板取シミュレーションソフト","伊丹空港","イタラ","イタリア軍","位置エネルギー","1号","一式陸上攻撃機","一次エネルギー","一次回路",
                 "一次側温水","一次側冷水","一軸圧縮試験","一軸圧縮強さ","一次空気","一次採収","一時停止","一次電子","一次標準","ボロナイジング","一充電走行距離","一条ねじ","一次冷却系","一次冷却材","一次冷媒",
                 "一坪","一人工","市場浸透度","市場排気保証距離","一部事務組合","19500トン型護衛艦","一本足場","萎凋点","一回散乱","一括下請負","一括補水装置","一貫操業","１間","一酸化炭素","溢水管","一体化",
                 "一体型オイルリング","一体型クランク","一点係留","一般球","一般球クリア","一般建設業者","一般車両保険","一般廃棄物","一品一葉図面","一品多葉図面","一方通行","逸泥","移転価格","移転登録","出口",
                 "出口の予告","遺伝子座","遺伝的影響","糸錆び","金鋸","糸鋸","イトノコ","糸引き","移動","移動型機器","移動格子","移動式海洋掘削装置","移動式クレーン","易動度","移動無線電話車","井戸蓋","井戸元価格",
                 "田舎間","イナーシャ","イナーシャロック型シンクロ","イナータンス","イナート・ガス・システム","イニシャル荷重","イニシャルコスト","イニシャルリセット","犬走り","イネス・アイルランド","井上隆智穂",
                 "命綱","イノベーション25","酸洗仕上げ","鋳肌","鋳ばり","イバン・力ペリ","イプサム","イプシロンロケット","異方性","断面絞り","イマージョンレンズ","イメージEELS","イメージウォブラ","イメージシフト",
                 "イメージトレーニング","イメージングプレート","イモヅチ","いも鎚","イモねじ","鋳物","金型鋳物","酸化銅","イモビ","タンクバッグ","イモビライザー","嫌がらせ爆撃","違約金","伊-四〇〇","イラン軍",
                 "イランゲート事件","イラン・イラク戦争","入口の方向","入口の予告","チョーク","イリジウム","イリジウム点火プラグ","遺留水","医療廃棄物","威力偵察","入間基地","イルミネーション","イルミネーションコントロール機能",
                 "イルミネーター","イルモア","入れ子","色","色落ち","色温度","色温度変換フィルター","色収差","色の三属性","岩圧","磐城沖ガス田","鋳枠","岩はだ","岩船沖油ガス田","陰影","陰影付け","陰解法",
                 "引掛けシーリング","引火点","インカンブランス","インガルス造船所","陰極","陰極レンズ","インクジェット塗布装置","インクジェットプリンタ用継手","インクジェットプリンター","インクジェット法","インコネル",
                 "インコラムタイプ","インゴット","インサイト","インサイド・ブローアウト・プリベンター","インサイドBOP","インサイドロック","印刷","印刷試験機","ワイヤカット線","インサート","インサートクロス",
                 "インサートジョイント","インサートナット","インサートパッド","インサートビット","インサートフレーム","インサートワイヤ","インシチュー採収法","飲食物摂取制限","インジウム","インジェクション",
                 "インジェクション モールド","インジェクションノズル","インジェクションブロー金型","インジェクションポンプ","インジェクター","インジェクタードライブユニット","インジケータ","インジケーター","インジケーター線図",
                 "ディメンション","インジケーターランプ","インスタントフィルム","インスツルメント","インスツルメントパネル","インストラクションマニュアル","インストロアカバー","インスパイア","インスペクションランプ",
                 "インセンティブ・オイル","インゼクター","インタスケール・レート","インタンク式燃料ポンプ","インタンジブル・ドリリング・コスト","インターTEC","インタークーラー","インタークーラーウオータースプレー",
                 "インタークーラー付きターボエンジン","インターコム","インターセプトポイント","インタータンコ","インターナショナルライセンス","インターナショナルラリー","インターナビ・プレミアムクラブ",
                 "インターナルギヤ","インターネットITS","インターネットSEM","インターバンドトランジション","インターフェイス","インターホン","インターミディエイトシャフト","インターミディエイトタイヤ",
                 "インターミデイエイトシャフト","インターミデイエイトハウジング","インターメディエートケーシング","インターリング入りブッシュ","インターリーフ","インターロック","インターロック接点","インターロック装置",
                 "インターロック・システム","インダクション検層","インダクションボックス","インダクションユニット","インダクタ","インダクティブ充電器","インダストリアルデザイン","インチ","インチアップ",
                 "インチねじ","インテグラ","インテグラル型パワーステアリング","インテグラルタンク","インテグラルリヤアクスル","インテグレーテッド・リファイナリー","インテグレーテッドシートベルト",
                 "インテグレーテッドチャイルドシート","インテグレーテッドバンパー","インテリア","インテリアゾーン","インテリアファン","インテリアランプオートカット＆ヘッドランプオートカット",
                 "インテリジェント ナイトビジョン","インテリジェントクルーズコントロール","インテリジェント自動車","インテリジェント自動車道路システム","インテリジェントハイウェイクルーズコントロール",
                 "インテークカムシャフト","インテークコレクター","インテークバルブ","インテークポート","インテークマニホールド","インディカーワールドシリーズ","インディベンデントサスペンション","インディペンデント",
                 "インディペンデント・オイル・カンパニー","インディ・ライツ","インデイアナポリス500マイルレース","インデキシングドライブ","インデックス角","インデックステーブル","インデックスドライブ",
                 "インデックスハンドラ","インデペンデンスデイ","イントラバンドトランジション","インドロ図","インナーグリーン","インナーシム","インナーストリングセメンチング","インナーパネル",
                 "インナーフィンチューブ","インナーベベル型コンプレッションリング","インナーミラー","インナーライナー","因島","インバータ","インバータ安定器","インバータ車","インバータシーリングライト",
                 "インバータ盤","インバータバン","インバータプルレス","インバーター","インバーテッドエマルジョンマッド","インパクト","インパクト成形","インパクトレンチ","インパクト・クラッシャ",
                 "インパネシフト","インヒビタースイッチ","インビンシブル","インピーダンス","インフィニティQ45","インフィル・ドリリング","インフォーメーションリミット","インフラストラクチャー",
                 "インプットシャフト","インプレッサ","インプレッション・ブロック","インベストメント・クレジット","インベストメントモールド法","インペラー","インペラープレード","インホイールダブルウイッシュボーンサスペンション",
                 "インホイールモーター","インボリュート曲線","インボリュート修正歯車","インボリュートスプライン","インボリュートねじ面ウォーム","インボリュートはす歯ギヤ","インボードサスペンション",
                 "インボードブレーキ","インマルサット","インメルマンターン","インモールドコーティング","インライン型","インラインフォー","インレンズFE電子銃","インレンズ形対物レンズ","インロー",
                 "インロー式","イン・イン・アウト","EH101","ESM","EX","EMD","EAP","イークロスビー検出器","イーグル","イーグルドライバー","EC135","ECM","ECCM","EC120","イージーアウトローラーシート",
                 "イージーアクセス機能","イージーシステム","イージーセレクト4WDシステム","イーストテキサス油田","E-3","E-2","EADS","ETA","ETC","ETOPS","E-767","E-8","E-4","イールス",
                 "イールド","EEM","EPMA"]
        
        ReturnWordArray += wordStore
        
        wordStore = ["VADS","ウィザード","ウィッシュ","ウィルコ","ウィルコンセプトシート","ウィルミントン油田","ウィングマン","ウィングマーク","ウィングレット","ウィングロード","ウィンストン･チャーチル","ウィンダム",
                  "ウィンドウレス型EDS検出器","ウィンドウレス検出器","ウィンドフォール・プロフィット","ウィンドフォール・プロフィット・タックス","ウィークビーム法","ウィーゼル","ウィービング","ウィービングビード",
                  "ウィーン条約","ウィーンフィルタ","ウイザード","ウイッシュボーン","イオン衝撃熱処理","ウイナー","ウイニングラン","ウイリアムズ","ウイルバー・ショー","ウイング","ウイングカー","ウイングマン",
                  "ウイングランプ","ウイングレット","ウインタータイヤ","ウインドウウォッシャー","ウインドウウォッシヤー液","ウインドウデフォッガー","ウインドウレギュレーター","ウインド形ルームエアコン",
                  "ウインドシールドアングル","ウインドシールドポスト","ウインドスロップ","ウインドデフレクター","ウェアーブッシング","ウェイストゲートバルブ","ウェイト・インジケーター","ウェイトアンドウェイト法",
                  "ウェザオメーター","ウェスティングハウス","ウェスレイク","ウェッタビリティ","パーツクリーナー","パラレルツイン","ウェハー検査SEM","ウェビング","ウェビング感応式","ウェブ","ウェブ搬送",
                  "ウェブハンドリング","ウェポンズフリー","ウェポンベイ","ウェル・シューティング","ウェル・ポイント","ウェルドライン","ウェルヘッド","ウェーザーストリップ","ウェーネルト円筒","ウェーネルト電極",
                  "ウェーバ","ウェーバー条項","WAVE","ウェーブレット処理","ウェーブワッシャー","ウェーラ曲線","ウエイストモールド","ウエイトディストリビューション","ウエイトハンディ","植込みボルト",
                  "上方光束","ウエザーストリップ","上下配光タイプ","上死点","ノッキング","ウエス","ウエスト","ウエストシール","ウエストライン","ウエッジ形燃焼室","ウエッジシェイプ","ウエッジ式エアブレーキ",
                  "ウエット","ウエットグリップ","ウエットサンプ","ウエットタイヤ","ウエットバルブ","ウエットライナー","ウエットレース","ウエハ","上向き取付可能型","ウエルヘッドハウジング","ウエーバーキャブレーター",
                  "ウォッカ","ウォッシャー連動間欠ワイパー","ピストン","ウォッベ指数","ウォブラ","ウォークイン型冷蔵庫","ウォークダウン","ウォータジェット加工","ウォーター・ガン","ウォーター・コーニング",
                  "ウォーニングランプ","ウォーバーズ","ウォームアップラン","ウォームギヤ","ウォームギヤ油","ウォームローラー式ステアリングギヤボックス","ウォール","ウォールウォッシャー","ウォールスタンド",
                  "ウォールスポット","ウオッシュコート","ウオッチ","ウオークイン機構","ウオークスルー","ウオークスルーバン","ウオーターインジェクション","ウオーターギャラリー","ウオータージャケット","ウオーターチラー",
                  "ウオーターチリングユニット","ウオーターハンマー","ウオーターフェード","ウオーターポンプ","ウオーターポンププーリー","ウオーターリカバリー","浮き上がり","浮き防衝堤","浮き屋根式タンク",
                  "浮き屋根タンク","請負契約","請負者","請負代金","請書","薄型6角セルセラミック担体","薄肉化","薄引き鋼板","渦","渦電流","渦電流式膜厚計","渦電流動力計","うず巻ポンプ","内販","内板塗装",
                  "内開弁","内気温センサー","内玄関","内外気切替えスイッチ","内だきボイラー","撃ちっ放し能力","内法","内歯車","内歯歯車","梁","内張りダクト","内火艇","宇宙船","宇宙線","宇宙線起源核種",
                  "宇宙服","内輪","内輪最小旋回半径","ウッディ・ワンダー","映り込み","うづくり仕上げ","右手カム","雨滴感知式オートワイパー","うなり音","右方屈曲あり","馬","駅","駅長","海砂","海の境界画定",
                  "ウムアダルク油田","ウムシャイフ油田","埋め込み","埋込型機器",]
        
        ReturnWordArray += wordStore
        
        
        
        return ReturnWordArray
    }

}
