//
//  EngineeringWordStore.swift
//  Hassouseisei_ver_2_0
//
//  Created by 岡大輔 on 2015/07/01.
//  Copyright (c) 2015年 岡大輔. All rights reserved.
//

import Foundation

class EngineeringWordStore: WordStore{
    override func returnCaption() -> String{
        return "工学用語"
    }
    
    override func ReturningWordArray() -> Array<String>{
        var ReturnWordArray:[String] = []
        
        //http://www.weblio.jp/category/engineering/aa/2
        var wordStore = ["アイアンハンド","アイアンワーク","IRST","IED","IHI","IMI","Il-2","Il-76","IAI","ＩＡＥＡ","IA58","合口","愛国号","アイコナール","アイコニック","ＩＣＲＵ","愛称","ＩＣＲＰ","ICV","IJN","IJA",
               "アイスノート","アイスバーン","アイス・オンコイル製氷","アイソクロマティシティ","アイソトープ","アイソパック・マップ","アイソレーター","アイゾット衝撃強さ","相対取引価格","アイデアスケッチ","アイデンティティ",
               "アイドラーアーム","アイドラーギヤ","ホリゾンタルキャブレター","アイドリング振動","アイドリングストップ","アイドリング騒音","アイドリング調整","アイドル安定性","アイドルコントロールバルブ",
               "アイドルポート","アイドルリミッター","I-22","相番","アイボリーコースト・ラリー","アイボルト","アイボーリング","アイボール","アイポイント","合いマーク","アイリプス","アイルトン・セナ","アイルランド解放戦線",
               "アインツェルレンズ","IR法","環境ISO","アイ・ハブ・コントロール","アウター・コンチネンタル・シェルフ","アウターシム式バルブリフター","アウターシート","アウタースライディングサンルーフ","アウターソケット",
               "アウターハンドルカバー","アウターパネル","アウターレース","アウター・コンチネンタル・シェルフ","アウデイ","アウトウニオン","アウトストラーダ","アウトドアライト","アウトバーン","アウトプットギヤ","アウトプットシャフト",
               "アウトボードサスペンション","アウトボードジョイント","アウトライン化","アウトリガー","アウトリーチ活動","アウトレット","アウトレットボックス","アウトレンジ","アウトレンズ形対物レンズ","アウトレンズ検出器",
               "アウト・イン・アウト","アウト・イン・イン","アヴァンシア","アエロクイップ","アエロスパシアル","亜鉛","アエングロ","亜鉛鉄板","亜鉛メッキ","亜鉛めっき","亜鉛めっき鉄線","亜鉛めっき鋼板","レール","青潮","青写真",
               "青熱ぜい性","電解熱処理","青棒","煽り止め","亜音速","銅","赤紙","赤城","赤潮","赤線条項","赤旗法","赤火式","赤水","阿賀沖油・ガス田","アガジャリ油田","阿賀野","上がり框","上り急勾配あり","開き角",
               "アキシャル型ボールテックLSD","アキシャルポンプカップリング4WD","秋田杉","秋津島","秋月","アキュミュレーション","アキュムレータ","アキュムレーター","アキュームレーターユニット","アキーレ・バルツィ",
               "アクアダッグ","アクアドライブシステム","アクアパルス","灰汁洗い","アクシス","アクシデント","アクスル","アクスルシャフト","Lツイン","アクスルステア","アクスルハウジング","アクスルハウジングのＦＣＤ化",
               "アクスルハブ","アクスルビーム","アクスルビーム式サスペンション","アクスルフリー装置","アクセサリー","アクセサリーコンセント","アクセス","アクセスポート","アクセプタンス方式","アクセルセンサー","アクセル全開",
               "アクセルターン","アクセルレスポンス","アクセルワーク","アクセント","アクセント照明","アクセントストライプ","アクチニウム系列","アクチュエータ","アクチュエーター","アクティブ4WS","アクティブエンジンマウント",
               "アクティブキャビンフィルター","アクティブサスペンション","アクティブサスペンション用油圧アクチュエーター","アクティブシート","アクティブ磁気シールド","アクティブ磁場キャンセル装置","アクティブ磁場キャンセラ",
               "アクティブ除振装置","アクティブスタビライザー","アクティブステア","アクティブステルス","アクティブセーフティ","アクティブダンパー","アクティブデフ","アクティブトルクコントロール4WD","アクティブトルクスプリット",
               "アクティブハイトコントロール","アクティブフェイズドアレイレーダー","アクティブフォーシステム","アクティブヘッドレスト","アクティブボディコントロール","アクティブレーダー誘導","アクティブロックアップ機構",
               "アクティブロールオーバープロテクションシステム","アクナキャリー協定","悪の枢軸","悪の帝国","アクリル","アクリルガラス","アクリル強化和紙","アクリル乳白","アクリル乳白和紙貼り","アクリロニトリルブタジエンゴム",
               "悪路走行耐久試験","アクロポリスラリー","アクロマティック面","アグスタウェストランド","アグマ粘度番号","アグレッサー","アグレッシビティ","あけぼの","アコースティック エミッション","アコーディオン戦争",
               "アコード","浅井戸","アサインメント","朝顔","浅皿形燃焼室","浅絞り","浅底リム","アサヒ号 AA型オートバイ","アサブ油田","アサリ","鮮映性","アシスト機構","アシッドフラック","オイルキャッチタンク","足場",
               "足踏み式パーキングブレーキ","足元灯","アシュランド法","アジアカー","アジア原子力協力フォーラム","アジアゲートウェイ構想","アジアパシフィックラリー選手権","アジェンダ２１","アジェンダ21","アジテーター",
               "アジャイル・ファルコン","アジャスタブル","アジャスタブルサスペンション","アジャスタブルシートベルトアンカー","アジャストスクリュー","アジャストボルト","飛鳥","アスカ","アスコット","アスコット・イノーバ",
               "アスター","アストンマーチン","アスピデ","アスファルト","アスファルト固化","アスファルト固化処理施設火災爆発事故","アスファルトコンクリート","アスファルト・サンド","アスファルトシート","アスファルト量",
               "アスファルトルーフィング","アスフェリックスミラー","アスベスト","アスベストフリー","アスベスト・ファイバーボード","アスペクト比","アスペクトレシオ","アスマリ層","アスマン式温湿度計","ASEAN 石油評議会",
               "遊び","遊び車","遊び歯車","アタカ油田","アタック","プラグ","アタッチメント","頭","当り","当たりゲージ","当たり図","アダブティブプログラム＆ニュートラルコントロール付き4AT","アダプター","アダプティブシート",
               "アダプティブ法","アダプティプシフトコントロール","アチザリット","アッカーマンジオメトリー","アッカーマンステア角","アッカーマン・ジャントー理論","圧空成形","アッシャー","圧縮圧力","圧縮機","圧縮機保護サーモ",
               "圧縮強度","圧縮行程","圧縮効率","圧縮成形","圧縮着火機関","圧縮抵抗","圧縮点火","圧縮天然ガス","圧縮天然ガス自動車","圧縮天然ガス船","圧縮特性","圧縮熱","圧縮破壊","オフ車","アッシュトレイ","アッシング",
               "圧接","アッセンブリータイム","圧送式潤滑装置","アッパーアーム","アッパークラス","アッパーストラクチャー","アッパーバックパネル","カプラー","アッパーボデイ","アッパーミドルサイズ","アッパーライト","アッパーレール",
               "アッパーロッキングアーム","アップグレーディング","アップシフト","アップスイープ","アップストリーム","アップトランス","アップドラフトキャブレーター","アップライト","アップリフト","圧延","圧力容器用鋼材",
               "圧延潤滑","圧延車輪","焼なまし双晶","圧締","圧電効果","圧電素子","圧入","圧入指数","圧入パターン","圧密","圧密度","圧造","圧力","圧力解析","圧力開閉器","圧力角","圧力計","圧力校正器","圧力勾配",
               "圧力制御","圧力扇","圧力センサ","圧力損失","圧力調整器","圧力調整装置","圧力調整弁","圧力抵抗","圧力トランデューサー","圧力逃がし弁","圧力発信器","圧力比","圧力噴霧式燃焼装置","圧力容器","冷間圧造用鋼線",
               "当て馬","当金","当盤","後押し","アトキンソンサイクル","後処理装置","後だれ","後突","アトラス","アトレー7","アトレー・ワゴン","後輪横力","後輪独立懸架装置","アドバンサー","アドバンススタジオ","アドバンスドデザイン",
               "アドバンタイヤ","アドバン・クロノグラフ","アドバースヨー","アドヒージョン","アドミラル・オブ・ザ・ソビエトフリート・NG・グズネツォフ","りん青銅","アドミラル・フロータ・ソヴィエツカヴァ・ソユーザ・クズネツォフ",
               "アドルフ・ガーラント","アドルフ・ヒトラー","穴","穴あけ","穴開け加工","アナグリフステレオ","ガルバニック腐食","アナスティグマート","アナプラート","アナログクオーツ時計","アナログ信号","アナログ走査",
               "キャブレター","アナログメーター","アニオン電着塗装","アニマルガード","アニマルバー","アニメーション","アニュラス","アニュラーガスフロー","アニュラー・ブローアウト・プリベンター","アニュラー防噴装置",
               "アニリン点","アニール炉","アニールロ","アネモ形吹き出し口","足乗せ減速","アノマリー","アノード","アバルト","アバロン","アパッチ・ロングボウ","アパーチュアランプ","アビオニクス","アフターグローシステム",
               "アフターサービス","アフターバーナー","アフターバーン","クランク","アフターマーケット","アフターマーケットパーツデザイン","アフリカンコンチネントラリーチャンピオンシップ","アブカイク油田","アブギラブ油田",
               "油回収船","油回転ポンプ","油拡散ポンプ","油吸着シート","油焚燃焼装置","油分光分析法","油分離器","油焼入れ","水焼入れ","油焼け","アブレイダブルシール","アブレシブ摩耗","アブレスト","アブレージョン","アブレータ",
               "アブログ","アブロ・バルカン","アプセット溶接","アプト式鉄道","アプライドフェンダー","アプライドモデル","アプローズ","アプローチ","アプローチ灯","アプローチアングル","アプローチアール","アプローチライト",
               "アベニール","アベレージスピード","アペックスシール","アポトーシス","あまぎり","雨仕舞","あまじまい","雨水コントロールドアミラー","アマモ","アマルキャブレーター","足まわり","網入りガラス","アミノ樹脂",
               "AMRAAM","アムラームスキー","雨センサー","天地","アメリカアフリカ軍","アメリカ宇宙軍","アメリカ沿岸警備隊","アメリカ欧州軍","アメリカ海軍","アメリカ海兵隊","アメリカ艦隊総軍","アメリカ合衆国軍用規格",
               "アメリカ空軍","アメリカ国防総省","アメリカサイバー軍","アメリカ自動車技術会","アメリカ戦略軍","アメリカ太平洋艦隊","アメリカ太平洋軍","アメリカ中央軍","アメリカ統合参謀本部","アメリカ統合戦力軍",
               "アメリカ特殊作戦海軍","アメリカ特殊作戦軍","アメリカ特殊作戦陸軍","アメリカ南方軍","アメリカ方式","アメリカ北方軍","アメリカ輸送軍","アメリカ陸軍","アメリカ陸軍特殊部隊群","アメリカ連邦航空局",
               "アーシング","アメリカンスタイル","アメリカン・グランド・プライズ・レース","アメリカ・フォード","アモタイゼーション","足下灯","アモルファスカーボン","歩み板","あゆみ板","洗い試験","新井敏弘","洗い分析",
               "アライメント","アライメントコイル","アライメントテスター","アライメント変化","あら先","荒し鎚","アラシヅチ","荒ずり","荒ずり皿","新戦闘指揮システム","新燃費規制","新汎用サイズ","アラバスタ","粗引き",
               "線","アラブ石油会議","アラブ石油輸出国機構","アラブ層","アラミド紙","アラミド繊維","アラメ","粗ラッピング","粗利","電解浸炭","アラン・ジョーンズ","アラート待機","アラートハンガー","アラーム","アラームメータ",
               "アラームランプ","ありあけ","アリスター・マクレー","アリスト","亜硫酸ガス","アリ・バタネン","アルアクサ殉教団","二硫他モリブデン","アルカリ骨材反応","アルカンターラ","アルキル基","アルキルシクロブタノン類",
               "アルキレーション","アルキレートガソリン","アルケミ","アルコ形","アルコールエンジン","アルコール温度計","アルコール混合ガソリン","アルコール超音波洗浄機","アルコール凍結割断法","アルコール燃料",
               "アルゴンアーク溶接","アルゴン溶接","アルシオーネ","主照明","主排気","アルゼンチンラリー","アルティス","アルテッツァ","アルテッツァ・ジータ","アルデヒド除去機能付きエアフィルター","アルデンヌ周回レース",
               "アルト","アルピナ","アルピーヌ","アルファ線","アルファ線スペクトロメータ","アルファフィルタ","アルファフリンジ","アルファ崩壊","アルファロメオ","アルファードG/ V","アルフィンドラム","アルプス造山運動",
               "アルベルト・アスカーリ","アルマイト","サーモスタット","アルマイト加工","アルマイト仕上げ","アルマダ","アルミ","アルミ鋳物","アルミシリンダーブロック","アルミシリンダーヘッド","アルミ蒸着リフレクター",
               "アルミセード","アルミ鍛造ピストン","アルミダイカスト","アルミダイクロ反射板","アルミ鋳造ピストン","アルミナ","電解焼入れ","アルミナイジング","アルミナ基板","アルミナセメント","シートレール","アルミニウム",
               "アルミニウム青銅","アルミニウム合金メタル","アドミラルティ黄銅","アルミニウムチタネート","アルミハニカム","アルミブレーキローター","アルミボディ","アルミめっき鋼板","アルミモノコック","アルミ溶解炉","アルミライナー",
               "アルミロールボンドクーラー","アルミン酸三石灰","アルミン酸三カルシウム","二焼き鍛造","アルンガス田","アル・アンサー","アル・アンサー・ジュニア","アレイレーダー","アレス","アレスティングギア","アレスティングフック",
               "アレスティングワイヤー","アレックス","アレックス・ザナルデイ","アレッサンドロ・ナニーニ","アレージ","アロアブル","アロイホイール","アロウズ","アロマティクス","アロー","アローダイヤグラム","アローヘッド",
               "泡原液搬送車","泡消火設備","合わせ板","合わせガラス","合わせピン","泡立ち試験","アワーグラスモード","アンカー","アンカーアーム","アンカーコート","アンカー仕上","アンカー船位保持","アンカーピン",
               "アンカープラグ","アンカーボルト","暗渠","アンギュラーアクセラレーション","アンギュラー軸受け","アンギュラー自動調心ころ軸受け","アンギーユ・マリン油田","アンクルサム","アングライヒ装置","アングル",
               "アングルドデッキ","アングル弁","暗殺","アンサンブル","アンサーバック機能","安山岩","暗視野像","安心情報","アンスケ","安全インターロック","安全衛生委員会","安全衛生管理","安全荷重","安全管理者",
               "安全ガラス","安全規制","安全規制担当省庁","安全規則","安全区域","安全区画","安全靴","安全審査","安全情報","安全情報公開試験","安全スイッチ","安全設計指針","安全装置","安全帯","安全対策","安全地帯",
               "安全超低電圧回路","安全の確保","安全ブレーカー","安全文化","安全弁","安全保障会議","安全率","安全離陸速度","暗騒音","アンダー","アンダーウイング","アンダーカット","アンダーカット型コンプレッションリング",
               "アンダーカバー","アンダーガード","アンダーグラウンドブローアウト","アンダーコート","アンダースクエアエンジン","車載工具","アンダーステア","アンダースラング式","アンダートレッド","アンダーバランス掘削",
               "アンダーフォーカス","アンダーフロアエンジン","アンダーボディ","アンダーライド","アンダーリーマー","アンチアッカーマン","アンチアフターバーンバルブ","アンチエイリアシング","アンチグレアコート剤","アンチスキッド装置",]
        
        ReturnWordArray += wordStore
        
        
        
        return ReturnWordArray
    }

}
