//
//  EngineeringWordStore.swift
//  Hassouseisei_ver_2_0
//
//  Created by 岡大輔 on 2015/07/01.
//  Copyright (c) 2015年 岡大輔. All rights reserved.
//

import Foundation

class EngineeringWordStore: WordStore{
    override func returnCaption() -> String{
        return "工学用語"
    }
    
    override func ReturningWordArray() -> Array<String>{
        var ReturnWordArray:[String] = []
        
        var wordStore = ["アイアンハンド","アイアンワーク","IRST","IED","IHI","IMI","Il-2","Il-76","IAI","ＩＡＥＡ","IA58","合口","愛国号","アイコナール","アイコニック","ＩＣＲＵ","愛称","ＩＣＲＰ","ICV","IJN","IJA",
               "アイスノート","アイスバーン","アイス・オンコイル製氷","アイソクロマティシティ","アイソトープ","アイソパック・マップ","アイソレーター","アイゾット衝撃強さ","相対取引価格","アイデアスケッチ","アイデンティティ",
               "アイドラーアーム","アイドラーギヤ","ホリゾンタルキャブレター","アイドリング振動","アイドリングストップ","アイドリング騒音","アイドリング調整","アイドル安定性","アイドルコントロールバルブ",
               "アイドルポート","アイドルリミッター","I-22","相番","アイボリーコースト・ラリー","アイボルト","アイボーリング","アイボール","アイポイント","合いマーク","アイリプス","アイルトン・セナ","アイルランド解放戦線",
               "アインツェルレンズ","IR法","環境ISO","アイ・ハブ・コントロール","アウター・コンチネンタル・シェルフ","アウターシム式バルブリフター","アウターシート","アウタースライディングサンルーフ","アウターソケット",
               "アウターハンドルカバー","アウターパネル","アウターレース","アウター・コンチネンタル・シェルフ","アウデイ","アウトウニオン","アウトストラーダ","アウトドアライト","アウトバーン","アウトプットギヤ","アウトプットシャフト",
               "アウトボードサスペンション","アウトボードジョイント","アウトライン化","アウトリガー","アウトリーチ活動","アウトレット","アウトレットボックス","アウトレンジ","アウトレンズ形対物レンズ","アウトレンズ検出器",
               "アウト・イン・アウト","アウト・イン・イン","アヴァンシア","アエロクイップ","アエロスパシアル","亜鉛","アエングロ","亜鉛鉄板","亜鉛メッキ","亜鉛めっき","亜鉛めっき鉄線","亜鉛めっき鋼板","レール","青潮","青写真",
               "青熱ぜい性","電解熱処理","青棒","煽り止め","亜音速","銅","赤紙","赤城","赤潮","赤線条項","赤旗法","赤火式",]
        
        ReturnWordArray += wordStore
        
        
        
        return ReturnWordArray
    }

}
