//
//  EngineeringWordStore.swift
//  Hassouseisei_ver_2_0
//
//  Created by 岡大輔 on 2015/07/01.
//  Copyright (c) 2015年 岡大輔. All rights reserved.
//

import Foundation

class EngineeringWordStore: WordStore{
    override func returnCaption() -> String{
        return "工学用語"
    }
    
    override func ReturningWordArray() -> Array<String>{
        var ReturnWordArray:[String] = []
        
        //http://www.weblio.jp/category/engineering/aa/2
        var wordStore = ["アイアンハンド","アイアンワーク","IRST","IED","IHI","IMI","Il-2","Il-76","IAI","ＩＡＥＡ","IA58","合口","愛国号","アイコナール","アイコニック","ＩＣＲＵ","愛称","ＩＣＲＰ","ICV","IJN","IJA",
               "アイスノート","アイスバーン","アイス・オンコイル製氷","アイソクロマティシティ","アイソトープ","アイソパック・マップ","アイソレーター","アイゾット衝撃強さ","相対取引価格","アイデアスケッチ","アイデンティティ",
               "アイドラーアーム","アイドラーギヤ","ホリゾンタルキャブレター","アイドリング振動","アイドリングストップ","アイドリング騒音","アイドリング調整","アイドル安定性","アイドルコントロールバルブ",
               "アイドルポート","アイドルリミッター","I-22","相番","アイボリーコースト・ラリー","アイボルト","アイボーリング","アイボール","アイポイント","合いマーク","アイリプス","アイルトン・セナ","アイルランド解放戦線",
               "アインツェルレンズ","IR法","環境ISO","アイ・ハブ・コントロール","アウター・コンチネンタル・シェルフ","アウターシム式バルブリフター","アウターシート","アウタースライディングサンルーフ","アウターソケット",
               "アウターハンドルカバー","アウターパネル","アウターレース","アウター・コンチネンタル・シェルフ","アウデイ","アウトウニオン","アウトストラーダ","アウトドアライト","アウトバーン","アウトプットギヤ","アウトプットシャフト",
               "アウトボードサスペンション","アウトボードジョイント","アウトライン化","アウトリガー","アウトリーチ活動","アウトレット","アウトレットボックス","アウトレンジ","アウトレンズ形対物レンズ","アウトレンズ検出器",
               "アウト・イン・アウト","アウト・イン・イン","アヴァンシア","アエロクイップ","アエロスパシアル","亜鉛","アエングロ","亜鉛鉄板","亜鉛メッキ","亜鉛めっき","亜鉛めっき鉄線","亜鉛めっき鋼板","レール","青潮","青写真",
               "青熱ぜい性","電解熱処理","青棒","煽り止め","亜音速","銅","赤紙","赤城","赤潮","赤線条項","赤旗法","赤火式","赤水","阿賀沖油・ガス田","アガジャリ油田","阿賀野","上がり框","上り急勾配あり","開き角",
               "アキシャル型ボールテックLSD","アキシャルポンプカップリング4WD","秋田杉","秋津島","秋月","アキュミュレーション","アキュムレータ","アキュムレーター","アキュームレーターユニット","アキーレ・バルツィ",
               "アクアダッグ","アクアドライブシステム","アクアパルス","灰汁洗い","アクシス","アクシデント","アクスル","アクスルシャフト","Lツイン","アクスルステア","アクスルハウジング","アクスルハウジングのＦＣＤ化",
               "アクスルハブ","アクスルビーム","アクスルビーム式サスペンション","アクスルフリー装置","アクセサリー","アクセサリーコンセント","アクセス","アクセスポート","アクセプタンス方式","アクセルセンサー","アクセル全開",
               "アクセルターン","アクセルレスポンス","アクセルワーク","アクセント","アクセント照明","アクセントストライプ","アクチニウム系列","アクチュエータ","アクチュエーター","アクティブ4WS","アクティブエンジンマウント",
               "アクティブキャビンフィルター","アクティブサスペンション","アクティブサスペンション用油圧アクチュエーター","アクティブシート","アクティブ磁気シールド","アクティブ磁場キャンセル装置","アクティブ磁場キャンセラ",
               "アクティブ除振装置","アクティブスタビライザー","アクティブステア","アクティブステルス","アクティブセーフティ","アクティブダンパー","アクティブデフ","アクティブトルクコントロール4WD","アクティブトルクスプリット",
               "アクティブハイトコントロール","アクティブフェイズドアレイレーダー","アクティブフォーシステム","アクティブヘッドレスト","アクティブボディコントロール","アクティブレーダー誘導","アクティブロックアップ機構",
               "アクティブロールオーバープロテクションシステム","アクナキャリー協定","悪の枢軸","悪の帝国","アクリル","アクリルガラス","アクリル強化和紙","アクリル乳白","アクリル乳白和紙貼り","アクリロニトリルブタジエンゴム",
               "悪路走行耐久試験","アクロポリスラリー","アクロマティック面","アグスタウェストランド","アグマ粘度番号","アグレッサー","アグレッシビティ","あけぼの","アコースティック エミッション","アコーディオン戦争",
               "アコード","浅井戸","アサインメント","朝顔","浅皿形燃焼室","浅絞り","浅底リム","アサヒ号 AA型オートバイ","アサブ油田","アサリ","鮮映性","アシスト機構","アシッドフラック","オイルキャッチタンク","足場",
               "足踏み式パーキングブレーキ","足元灯","アシュランド法","アジアカー","アジア原子力協力フォーラム","アジアゲートウェイ構想","アジアパシフィックラリー選手権","アジェンダ２１","アジェンダ21","アジテーター",
               "アジャイル・ファルコン","アジャスタブル","アジャスタブルサスペンション","アジャスタブルシートベルトアンカー","アジャストスクリュー","アジャストボルト","飛鳥","アスカ","アスコット","アスコット・イノーバ",
               "アスター","アストンマーチン","アスピデ","アスファルト","アスファルト固化","アスファルト固化処理施設火災爆発事故","アスファルトコンクリート","アスファルト・サンド","アスファルトシート","アスファルト量",
               "アスファルトルーフィング","アスフェリックスミラー","アスベスト","アスベストフリー","アスベスト・ファイバーボード","アスペクト比","アスペクトレシオ","アスマリ層","アスマン式温湿度計","ASEAN 石油評議会",
               "遊び","遊び車","遊び歯車","アタカ油田","アタック","プラグ","アタッチメント","頭","当り","当たりゲージ","当たり図","アダブティブプログラム＆ニュートラルコントロール付き4AT","アダプター","アダプティブシート",
               "アダプティブ法","アダプティプシフトコントロール","アチザリット","アッカーマンジオメトリー","アッカーマンステア角","アッカーマン・ジャントー理論","圧空成形","アッシャー","圧縮圧力","圧縮機","圧縮機保護サーモ",
               "圧縮強度"]
        
        ReturnWordArray += wordStore
        
        
        
        return ReturnWordArray
    }

}
