//
//  FoodWordStore.swift
//  Hassouseisei_ver_2_0
//
//  Created by 岡大輔 on 2015/08/19.
//  Copyright (c) 2015年 岡大輔. All rights reserved.
//

import UIKit

class FoodWordStore: WordStore {
    
    override func returnCaption() -> String{
        return "食品"
    }
    
    override func ReturningWordArray() -> Array<String>{
        var ReturnWordArray:[String] = []
        
        var wordArray = ["ア ラ","あいがも","アイコ","アイシング","ICA","ICO","アイスクリーム","アイスビール","アイスボックス","アイスミルク","あいなめ","アイリッシュウイスキー","アイリッシュ・コーヒー","亜鉛","青い珊瑚礁","青カビ",
         "あおかび","あおさ","青竹打ち","青とさか","あおのり","青ピーマン","あかいか","あかい酒","赤色酵母","あかがい","アカザ","赤酒","赤たまねぎ","赤とさか","赤ピーマン","赤米","赤めし","赤ワイン","秋上がり","灰汁","アクアヴィット",
        "アクアビット","アクアビットの製造方法","アクアビットの飲み方","アクアビットの歴史","アクアビット・カイピリーニャ","阿久根","あくね","あくまき","悪魔ラーメン","灰持酒","あけび","揚げネギ","あげねぎ","あこうだい","アコーダンス",
          "アゴ","あご","あさ","浅葱","あさつき","旭川ラーメン","あさひかわラーメン村","朝ラー","足","アシ","あしたば","亜硝酸","あじ","アジアゴ","味玉","あじたま","味つけ玉子","味付けのり","アスコルビン酸","アスパラガス",
         "アスパラギン酸","アスパルテーム","小豆","アズキナ","アセスルファムカリウム","アセトアルデヒド","アセプティック・ブリックパック","アセロラ","アセンブル","頭","アップルパイ","アップル・カー","アップル・ジンジャー",
         "アップル・ブラン","アッペンツェール","厚揚げ","厚蓋","厚焼きたまご","アテモヤ","アテュヴェ","後熟","アトミゼ","アトランペ","アドニス","あなご","アナナ","アナナス","アニス","アニゼット","あひる","アフィニティ",
        "アフター・テイスト","アフラトキシン","アフロディテ","アブサン","アブサンの飲み方","油揚げ","油臭","油そば","油ダレ","アプリコット オレンジ","アプリコットブランデー","アプリコットブランデーの製造方法","アプリコット・コラーダ",
        "アプリコット・フィズ","アプリコテ","アベゼ","アペリティフ","アボカド","アボカド油","甘辛せんべい","甘辛度","あまご","甘酒","甘酒四段","甘酢漬","アマナ","甘納豆","あまに油","あまのり","奄美諸島焼酎","アマランサス",
        "アマレット","アマンディーヌ","アマンド","アマンド・アッシュ","アマンド・エフィレ","アマンド・ショコラ","アマンド・ブリュット","アマンド・プードル","アマンド・モンデ","あみ","アミノ酸","アミノ酸度","アミノ・カルボニル反応",
        "アミラーゼ","アミロペクチン","アミロース","あめ玉","アメリカスペシャルティコーヒー協会","アメリカン","アメリカンウイスキー","アメリカンコーヒー","アメリカン・ブレンデット・ウイスキー","アメリカ・カリフォルニア・ワイン",
        "アメール","紋船","あやぶね","あゆ","アラウンド・ザ・ワールド","荒櫂","あらがい","阿刺吉","あらき","あらげきくらげ","アラザン","アラシード","アラスカ","アラスカめぬけ","アラック","荒走り","アラバマ・スラマー",
        "アラビカ種","粗挽き","荒焼","アランビック","アリストテレス","有田焼","アルカライズ","アルカリ食品","アルキメデスの原理","アルギン酸","アルコール","アルコール依存症","アルコール計","アルコール収得歩合","アルコール使用限度数量",
        "アルコール耐性酵母","アルコール脱水素酵素","アルコール添加","アルコール添加清酒","アルコール度数","アルコール度数","アルコール度数表示","アルコール発酵","アルコール分","アルデヒト臭","アルト","アルノー・ド・ヴィユヌーヴ",
        "アルヴァレス","アルファ澱粉","α－アミラーゼ","アルファー化","α化","α化米","α－澱粉","アルブミン","アルマニャック","アルミニュムレーキ","アレクサンダー","アレルギー","アレルゲン","アロゼ","アロマ","アロマチックビターズ",
        "アロマパック","アロマフリージング製法","アローム","泡笠","泡消機","粟焼酎","泡なし酵母","泡盛","泡盛菌","あん入り生八つ橋","アンウォッシュド","行火","アンクル・トリス","アングレーズ","アンコルポレ","あんず",
        "杏ジュレップ","杏ソーダ","アンダルシア","アンチモールド","アンティ・フリーズ","アントルメ","あんパン","アンプル仕込み","あんまん","アンモニア","アーティチョーク","アーモンド","アーモンドプラリネ","アーラクリーム",
        "アーリー＆コーラ ハーフロック","アーリー＆ソーダ ハーフロック","アーリー＆トニック ハーフロック"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["胃","いいだこ","家系","家つき酵母","イエーガー・オレンジ","イエーガー・シューター","イエーガー・トニック","イオン","イオン交換樹脂","いか","いかあられ","いかなご","いかフライ","壱岐焼酎","イクラ","伊作",
        "いしだい","異種穀粒","移出","移出価格","イスハタ","イスラ・デ・ピノス","伊豆諸島焼酎","信州そば","異性化糖","いせえび","いそべせんべい","イタイタ","板粕","板ガム","板こんにゃく","板チョコレート","イタドリ",
        "板ふ","いたやがい","イタリア産干しイチジク","イタリアンロースト","イタリアン・アイスティー","イタリアン・カイピリーニャ","イタリアン・サーファー","イタリアン・スティンガー","イタリア・ワイン","板わかめ","いちご",
        "いちじく","一次醪","1：2点法","市房山","一級酒","1個もと","イッタンダラケ","一杯のカクテルのアルコール度数の概算法","糸寒天","糸引き納豆","糸みつば","いとよりだい","イドグサ","いなご","いのしし","イノシトール",
        "イノシン酸","いのちの水","いのぶた","伊波普猷","イブリック","今川焼","芋","いも及びでん粉類-いも及びでん粉類/(さといも類)/さといも/球茎、生","いも及びでん粉類-いも及びでん粉類/(さといも類)/さといも/球茎、水煮",
        "いも及びでん粉類-いも及びでん粉類/(さといも類)/さといも/球茎、冷凍","いも及びでん粉類-いも及びでん粉類/(さといも類)/みずいも/球茎、生","いも及びでん粉類-いも及びでん粉類/(さといも類)/みずいも/球茎、水煮",
        "いも及びでん粉類-いも及びでん粉類/(さといも類)/やつがしら/球茎、生","いも及びでん粉類-いも及びでん粉類/(さといも類)/やつがしら/球茎、水煮","いも及びでん粉類-いも及びでん粉類/(でん粉製品)/くずきり/乾",
        "いも及びでん粉類-いも及びでん粉類/(でん粉製品)/くずきり/ゆで","いも及びでん粉類-いも及びでん粉類/(でん粉製品)/タピオカパール/乾","いも及びでん粉類-いも及びでん粉類/(でん粉製品)/はるさめ/普通はるさめ/乾",
        "いも及びでん粉類-いも及びでん粉類/(でん粉製品)/はるさめ/緑豆はるさめ/乾","いも及びでん粉類-いも及びでん粉類/(でん粉類)/キャッサバでん粉","いも及びでん粉類-いも及びでん粉類/(でん粉類)/くずでん粉",
        "いも及びでん粉類-いも及びでん粉類/(でん粉類)/小麦でん粉","いも及びでん粉類-いも及びでん粉類/(でん粉類)/米でん粉","いも及びでん粉類-いも及びでん粉類/(でん粉類)/サゴでん粉","いも及びでん粉類-いも及びでん粉類/(でん粉類)/さつまいもでん粉",
        "いも及びでん粉類-いも及びでん粉類/(でん粉類)/じゃがいもでん粉","いも及びでん粉類-いも及びでん粉類/(でん粉類)/とうもろこしでん粉","いも及びでん粉類-いも及びでん粉類/(やまのいも類)/じねんじょ/塊根、生",
        "いも及びでん粉類-いも及びでん粉類/(やまのいも類)/だいじょ/塊根、生","いも及びでん粉類-いも及びでん粉類/(やまのいも類)/やまのいも/いちょういも/塊根、生","いも及びでん粉類-いも及びでん粉類/(やまのいも類)/やまのいも/ながいも/塊根、生",
        "いも及びでん粉類-いも及びでん粉類/(やまのいも類)/やまのいも/ながいも/塊根、水煮","いも及びでん粉類-いも及びでん粉類/(やまのいも類)/やまのいも/やまといも/塊根、生",
        "いも及びでん粉類-いも及びでん粉類/きくいも/塊茎、生","いも及びでん粉類-いも及びでん粉類/こんにゃく/板こんにゃく/精粉こんにゃく","いも及びでん粉類-いも及びでん粉類/こんにゃく/板こんにゃく/生いもこんにゃく",
        "いも及びでん粉類-いも及びでん粉類/こんにゃく/しらたき","いも及びでん粉類-いも及びでん粉類/こんにゃく/精粉","いも及びでん粉類-いも及びでん粉類/さつまいも/塊根、生",
        "いも及びでん粉類-いも及びでん粉類/さつまいも/塊根、蒸し","いも及びでん粉類-いも及びでん粉類/さつまいも/塊根、焼き","いも及びでん粉類-いも及びでん粉類/さつまいも/蒸し切干",
        "いも及びでん粉類-いも及びでん粉類/じゃがいも/塊茎、生","いも及びでん粉類-いも及びでん粉類/じゃがいも/塊茎、水煮","いも及びでん粉類-いも及びでん粉類/じゃがいも/塊茎、蒸し",
        "いも及びでん粉類-いも及びでん粉類/じゃがいも/乾燥マッシュポテト","いも及びでん粉類-いも及びでん粉類/じゃがいも/フライドポテト","芋かりんとう","芋焼酎","いよかん","イラ","イラスティシティ","イラ湧き","入口タンク",
        "色","色戻り","岩泡","いわし","いわな","いわのり","イングリッシュマフィン","いんげんまめ","インスタントコーヒー","インスタントラーメン","インスタントラーメンの日","インスタントラーメン発明記念館",
        "インディカ種","インベルターゼ","イースター","イースト","イーストドナッツ","イーストドーナッツ","イーストフード","イールド","ウイスキー","ウイスキーのTPO","ウイスキーの英語のつづり","ウイスキーの香り","ウイスキーのカロリー",
        "ウイスキーの原料","ウイスキーの語源","ウイスキーの製造工程","ウイスキーの中国語のつづり","ウイスキーの保存法","ウイスキーの水","ウイスキーの容量","ウイスキーフロート","ウイスキーボンボン","ウイスキー類",
        "ウイスキー・クラッシュ","ウイスキー・サワー","ウイスキー・ソーダ","ウイスキー・マック","ういろう","ウインナー","ウェッティーニ","ウェット クリスタル","ウェット ソニック","ウェット ブルー","ウェット ベリー",
        "ウェット ミドリ","上島忠雄","上新粉","ウェット炭","ウエハース","上南粉","ウォター・イン・オイル","ウォッカ","ウォッシュド","ウォータードリップ","ウォールナッツ","ウォーレエメンタール","ウォーレエメンタール8P",
        "ウオッカ","ウオッカ・リッキー","ウオツカ","ウオツカの語源","ウオツカの製造工程","ウオツカの飲み方","ウオツカの歴史","浮き","浮き粉","うぐい","うぐいす豆","うぐいすもち","鳥骨鶏","うこっけい卵","うさぎ",
        "ウシュクベーハー","薄皮","薄口醤油","ウスターソース","うずら","うずら卵","うずら豆","打瀬","うたせ","全房","ウド","うどん","うなぎ","うに","ウハギ","うまづらはぎ","御物城","うむぬぐすく","うめ","梅漬",
        "梅酒","うめしゅ","梅酒ストレート","梅酒ソーダ","梅酒ソーダ割り","梅酒水割り","梅酒ロック","梅びしお","梅干し","梅やき","裏うち","ウルイ","粳米","うるち米","うるちまい","うるめいわし","上立ち香","うわだちか",
        "上呑","ウワバミソウ","上火","うんしゅうみかん","ヴァイツェンビール","ヴァッティング","ヴァニーユ","ヴィッテル ルジェ カシス","ヴィティス・ヴィニフェラ","ヴィンテージ","ヴェネチアン・サンセット","ヴェルジーネ",
        "ヴェールダンス","ウーロン茶","ウーロン茶の製造工程","エアシューター","えい","A－B直線","永福町大勝軒系","栄養飲料","エカレ","液化","液化型アミラーゼ","液化仕込み","エキストラクト","エキス分","エキュメ","エクレア",
        "エグゥテ","えごのり","えごま","エシャロット","SI培地","SS","エスカルゴ","SCAA","SCAJ","エステル","エステート","エスプレッソ","エスプレッソマシン","枝桶","えだおけ","えだまめ","エダム","エチルアルコール",
        "エチレン","エックス・ワイ・ジー","エッグノッグ","エッグブランデー","エッセンシャルオイル","エッセンス","枝付干しぶどう","エティバ","エティレ","エテュヴェ","えながおにこんぶ","えのきたけ","えび","えびフライ",
        "エフィレ","エマルジョン","エマンセ","MC炭","エメラルド・シティ","エメラルド・ミスト","エメンタール","エメンタールレゼルベ","エメンタール・プレミエクリュ","エリンギ","エル・ディアブロ","エル・プレジデンテ",
        "塩","塩化アンモニウム","塩基","エンジェルズ・キッス","エンジェルリング","エンダイブ","えんどう","エンハンサー","えんばく","塩ビ","塩分","エンロビング","エンローバー","エンローバーチョコレート","エージング",
        "エージングセラー","ABパック","AP","エール","オ-ブン・スプリング","おいかわ","おいしい水割り","オイスターソース","オイチシカ油","追水","オイル","オイルスプレイ","オイルスプレークラッカー",
        "オイル・イン・ウォーター","横隔膜","押麦","オヴェハ・アル・ロメロ","大姶良","おおさかしろな","おおさが","オオバギボウシ","オオバコ","大福豆","大豆","おおむぎ","おかひじき","岡持ち","オカラ","おから",
        "おきあみ","おきうと","沖縄すば","沖縄そば","札幌ラーメン","沖縄豆腐","沖縄料理","荻窪ラーメン","オクラ","桶売り","桶買い","桶取引","おこし","おこぜ","おごのり","お酒のカロリー","押槽","おしぶね","おたふく豆",
        "小樽運河食堂ラーメン工房","落泡","おちる","乙類","おつるい","踊り","おどり","オニオンパウダー","おにぎり","尾道ラーメン","おのみちらーめん","おのろけ豆","おひょう","帯鉄","オフィスコーヒーサービス",
        "おぼろ豆腐","御物城","親桶","オヤマボクチ","お湯割り","オランジェ","オランジェット","オランジュ","オランダ・ジン","滓","オリゴ糖","滓下げ","滓酒","オリ引き","滓引き","オリンピック","オリーブ","オリーブ油",
        "オレイン酸","折れ線グラフ","オレンジ","オレンジ・キュラソー","オレンジ・ブロッサム","オロブランコ","オンザロック","オンディーヌ","温度補正","オン・ザ・ロックス","オーガズム","オータム・リーブス","オートミール",
        "オードヴィ","オーバーラン","オーブン","オーブン フレシュ ベーカーリー","オームの法則","オールスパイス","オールド・アムステルダム","オールド・アライアンス","オールド・トム・ジン","オールド・ファッションド",
        "オーロラ"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["櫂入れ","貝柱","カイピリーニャ","カイピロスカ","怪物ウスケ","灰分","開放発酵","櫂棒","界面活性剤","かえし","替え玉","かえだま","替え水","かえる","香り米","カカオ脂","カカオジャーム","カカオニブ",
        "カカオハスク","カカオビーンズ","カカオポッド","カカオマス","化学的酸素要求量","鏡","かき油","柿渋","角寒天","各地の焼酎の誕生","格付け","格付法","カクテル","カクテルに使われる主な単位","カクテルの語源",
        "角煮","掛上げ","掛麹","掛下げ","掛流し","掛米","掛けものチョコ","加工乳","鹿児島ラーメン","かさご","過酸化水素水","過酸化物価","糟酒","カシス・ウーロン","カシス・オレンジ","カシス・コラーダ","カシス・ソーダ",
        "カシス・ミルク","菓子類-菓子類/甘納豆/あずき","菓子類-菓子類/甘納豆/いんげんまめ","菓子類-菓子類/甘納豆/えんどう","菓子類-菓子類/あめ玉","菓子類-菓子類/あん入り生八つ橋","菓子類-菓子類/あんパン",
        "菓子類-菓子類/板ガム","菓子類-菓子類/今川焼","菓子類-菓子類/芋かりんとう","菓子類-菓子類/ういろう","菓子類-菓子類/ウエハース","菓子類-菓子類/うぐいすもち","菓子類-菓子類/おこし","菓子類-菓子類/おのろけ豆",
        "菓子類-菓子類/かしわもち","菓子類-菓子類/カスタードプディング","菓子類-菓子類/カステラ","菓子類-菓子類/かのこ","菓子類-菓子類/カバーリングチョコレート","菓子類-菓子類/かりんとう/黒","菓子類-菓子類/かりんとう/白",
        "菓子類-菓子類/かるかん","菓子類-菓子類/きび団子","菓子類-菓子類/キャラメル","菓子類-菓子類/きりざんしょ","菓子類-菓子類/きんぎょく糖","菓子類-菓子類/きんつば","菓子類-菓子類/ぎゅうひ","菓子類-菓子類/草もち",
        "菓子類-菓子類/くし団子/あん","菓子類-菓子類/くし団子/しょうゆ","菓子類-菓子類/クラッカー/オイルスプレークラッカー","菓子類-菓子類/クラッカー/ソーダクラッカー","菓子類-菓子類/クリームパン",
        "菓子類-菓子類/げっぺい","菓子類-菓子類/小麦粉あられ","菓子類-菓子類/小麦粉せんべい/いそべせんべい","菓子類-菓子類/小麦粉せんべい/かわらせんべい","菓子類-菓子類/小麦粉せんべい/南部せんべい/ごま入り",
        "菓子類-菓子類/小麦粉せんべい/南部せんべい/落花生入り","菓子類-菓子類/小麦粉せんべい/巻きせんべい","揚げせんべい","甘辛せんべい","あられ","塩せんべい","コーンスナック","ごかぼう","桜もち/関西風",
        "桜もち/関東風","サブレ","しおがま","シュークリーム","ショートケーキ","ジャムパン","錠菓","スポンジケーキ","オレンジ","コーヒー","ミルク","ワイン","ゼリーキャンデー","ゼリービーンズ","タルト",
        "大福もち","ちまき","チャイナマーブル","ちゃつう","中華風クッキー","チョココロネ","デニッシュペストリー","糖衣ガム","どら焼","ドロップ","イーストドーナッツ","ケーキドーナッツ","ねりきり","バターケーキ",
        "バタースコッチ","ババロア","アップルパイ","パイ皮","ミートパイ","パフパイ","関西風","ひなあられ/関東風","ビスケット/ソフトビスケット","ビスケット/ハードビスケット","風船ガム","ブリットル","プレッツェル",
        "ホットケーキ","ホワイトチョコレート","衛生ボーロ","そばボーロ","成形ポテトチップス","ポテトチップス","マシュマロ","松風","マロングラッセ","カステラまんじゅう","くずまんじゅう","くりまんじゅう",
        "あんまん","肉まん","とうまんじゅう","蒸しまんじゅう","三島豆","ミルクチョコレート","もなか","八つ橋","ゆべし","練りようかん","水ようかん","蒸しようかん","麦らくがん","もろこしらくがん","らくがん",
        "ロシアケーキ","カスタードクリーム入り","ジャム入り","樫樽","菓子パン","カシューナッツ","カシラ","かしわもち","かしわ餅粉","かじか","かじき","果実色飲料","果実飲料","果実飲料の製造工程","果実酒",
        "果実酒類","果実酢","砂じょう、生","30%果汁入り飲料","50%果汁入り飲料","ストレートジュース","濃縮還元ジュース","砂じょう、生","バレンシアオレンジ","マーマレード","にほんすもも","プルーン/乾","プルーン/生",
        "西洋なし/缶詰","西洋なし/生","中国なし/生","日本なし/缶詰","日本なし/生","ネクタリン/生","もも/30%果汁入り飲料(ネクター）","/もも/缶詰/液汁","もも/缶詰/果肉","もも/生","果肉、生","果皮、生","10%果汁入り飲料",
        "アセロラ","アテモヤ","アボカド/生","あんず/乾","あんず/缶詰","あんず/ジャム/高糖度","あんず/ジャム/低糖度","あんず/生","いちご/ジャム/高糖度","いちご/ジャム/低糖度","いちご/生","いちじく/乾","いちじく/缶詰",
        "いちじく/生","砂じょう、生","20%果汁入り飲料","塩漬","調味漬","梅びしお","塩漬","調味漬","生","果実飲料/20%果汁入り飲料","50%果汁入り飲料","果粒入りジュース","ストレートジュース","濃縮還元ジュース",
        "液汁","果肉","じょうのう/普通、生","早生、生","普通、生","早生、生","グリーン","スタッフド","ライプ","砂じょう、生","甘がき、生","渋抜きがき、生","干しがき","果汁、生","かりん/生","キウイフルーツ/生",
        "キワノ/生","全果、生","10%果汁入り飲料","20%果汁入り飲料(ネクター）","グァバ/生","グズベリー/生","ぐみ/生","果実飲料/20%果汁入り飲料","果実飲料/50%果汁入り飲料","ストレートジュース","濃縮還元ジュース",
        "缶詰","砂じょう、生","ココナッツウォーター","ココナッツミルク","ごれんし/生","さくらんぼ/缶詰","さくらんぼ/国産、生","米国産、生","砂じょう、生","ざくろ/生","10%果汁入り飲料","果汁、生","すいか/生",
        "果汁、生","果皮、生","砂じょう、生","タンゴール/砂じょう、生","タンゼロ/砂じょう、生","なつめ/乾","なつめやし/乾","ハスカップ/生","砂じょう、生","バナナ/乾","バナナ/生","果実飲料/10%果汁入り飲料",
        "50%果汁入り飲料","ストレートジュース","濃縮還元ジュース","パインアップル/缶詰","パインアップル/砂糖漬","パインアップル/生","パッションフルーツ/果汁、生","パパイア/完熟、生","パパイア/未熟、生",
        "じょうのう及びアルベド、生","砂じょう、生","びわ/缶詰","びわ/生","ピタヤ/生","果実飲料/10%果汁入り飲料","70%果汁入り飲料","ストレートジュース","濃縮還元ジュース","ぶどう/缶詰","ぶどう/ジャム",
        "ぶどう/生","ぶどう/干しぶどう","ブルーベリー/ジャム","ブルーベリー/生","ぶんたん/ざぼん漬","砂じょう、生","ホワイトサポテ/生","ぽんかん/砂じょう、生","まくわうり/生","マルメロ/生","マンゴスチン/生",
        "マンゴー/生","温室メロン、生","露地メロン、生","やまもも/生","果汁、生","果皮、生","ライチー/生","ライム/果汁、生","ラズベリー/生","りゅうがん/乾","果実飲料/30%果汁入り飲料","果実飲料/50%果汁入り飲料",
        "ストレートジュース","濃縮還元ジュース","りんご/缶詰","りんご/ジャム","りんご/生","レモン/果汁、生","レモン/全果、生","果実の酒","果汁100％","果汁含有率表示","粕","加水調整","加水分解","加水率",
        "粕換算率","カスク・ストレングス","カスタード","カスタードクリーム","カスタードクリーム入り","カスタードプディング","カステラ","カステラまんじゅう","粕取","粕取焼酎","粕離し","粕歩合","粕醪取焼酎",
        "粕四段","カスロール","かずのこ","課税標準","カゼイン","風邪を引く","可塑性","カソナード","カタ","片栗粉","カタジロ","片白","かたはく","カタロース","果段","化調","カチョカバロ・アフミカート",
        "カッセ","活性化エネルギー","活性清酒","活性炭素","カットわかめ","カップ","カップテイスター","カップテスト","かつお","かつお昆布だし","かつお節","カツオ節","カテキン類","カテージ","果糖","果糖葡萄糖液糖",
        "加糖練乳","カナディアンウイスキー","かに","果肉","カニ風味かまぼこ","かに風味かまぼこ","金山寺みそ","カネル","かのこ","カバ","かば焼","カバーリングチョコレート","カビ","かび","カフェイン","カフェインレスコーヒー",
        "カフェ・オ・レ","カフェ・オ・レ・ボウル","カフェバリオ","カフェバリオ","カフェ・マキアート","カフェ・ラテ","カフェ・マッキャート","かぶ","かぶせ茶","兜釜","カブラ・アル・ヴィーノ","カプチーノ",
        "カプチーン・アレクサンダー","カプチーン・ミルク","カプリス デ デュー","カベルネ・ソーヴィニヨン","カベルネ・フラン","果房","かぼす","かぼちゃ","南瓜焼酎","カポック油","かまいり茶","かます","カマンベール",
        "カマンベール4P・ジェラール","カマンベール・ジェラールクラシック","カマンベール・ド・ノルマンディ","カマンベール・ド・ノルマンディ ラ・トラディション","カマンベール・フェルムトランブレイ",
        "カマンベール・ペイザンブルトン","カマンベール・ローゼンボーグ","カミカゼ","カミベル","甕貯蔵","下面酵母","かも","カラカラ","カラギーナン","カラク","カラグナート","唐粉米","枯らし","からし漬",
        "辛子高菜","からしな","からしめんたいこ","からすみ","からふとししゃも","からふとます","カラメリゼ","カラメル","カラメル・ア・セック","カラーリング","カリウム","カリフラワー","かりんとう","カルヴァドス",
        "かるかん","かるかん粉","カルシウム","カルタバ","カルタワイン","カルテット・アイスクリーム","カルテット・オレンジ","カルテット・ソーダ","カルテット・メロン・シューター","カルバドス","カルーア・ウーロン",
        "カルーア・オレンジ","カルーア・コラーダ","カルーア・コーラ","カルーア・ソーダ","カルーア・ベリー","カルーア・ミルク","カルーア・ラテ","カルーア・リッキー","かれい","カレンズ","カレー","カレー粉","カロリー",
        "カロリーオフ","カロリーゼロ","皮","河内源一郎","かわのり","かわはぎ","かわらせんべい","燗","柑橘類","甘ぐり","関係湿度","還元","かんげん","還元乳","還元糖","乾湿球温度計","乾湿差","甘蔗酒","甘藷",
        "甘蔗","完食","甘藷焼酎","カン水","観世ふ","乾燥マッシュポテト","肝臓","寒天","カンディーレン","広東鍋","乾熱殺菌","缶の点字","乾杯","カンパリ","カンパリ・オレンジ","カンパリ・グレープフルーツ",
        "カンパリ・ソーダ","カンパリ・トニック","カンパリ・パイン","カンパリ・ビア","かんぴょう","カンボゾーラ","甘味果実酒","甘みそ","甘味度","乾麺","乾麺の日","甘露煮","カーディナル","カーデナル","カートン",
        "カートンケース","カードル"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["生一本","キウイフルーツ","木桶発酵・木桶仕込","気化","機械麹法","機械焼酎","機械製麹法","規格外米","気化熱","気管","木香","木香様臭","きき酒","利猪口","きく","きくいも","菊地秀右衛門","菊のり","危険率",
        "黄麹菌","器差補正","刻み昆布","基質","基質特異性","キシロオリゴ糖","記述統計学","貴醸酒","喜多方ラーメン","きだい","きちじ","基調香","キッス・イン・ザ・ダーク","キッス・オブ・ファイヤー","規定濃度",
            "きな粉","絹ごし豆腐","あらげきくらげ/乾","あらげきくらげ/ゆで","きくらげ/乾","きくらげ/ゆで","しろきくらげ/乾","しろきくらげ/ゆで","はたけしめじ/生","ぶなしめじ/生","ぶなしめじ/ゆで","ほんしめじ/生",
        "うすひらたけ/生","エリンギ/生","ひらたけ/生","ひらたけ/ゆで","えのきたけ/味付け瓶詰","えのきたけ/生","えのきたけ/ゆで","くろあわびたけ/生","しいたけ/生しいたけ/生","しいたけ/生しいたけ/ゆで",
        "しいたけ/乾しいたけ/乾","しいたけ/乾しいたけ/ゆで","たもぎたけ/生","なめこ/生","なめこ/水煮缶詰","なめこ/ゆで","ぬめりすぎたけ/生","まいたけ/生","まいたけ/ゆで","マッシュルーム/生","マッシュルーム/水煮缶詰",
        "マッシュルーム/ゆで","まつたけ/生","まつたけ/水煮缶詰","やなぎまつたけ/生","キノシタ","希薄もと","気曝法","黍焼酎","きび団子","貴腐葡萄","貴腐ワイン","帰無仮説","キムチ","生もと","生もと系酒母","キャステロブルー",
        "キャステロブルーオイル","キャステロホワイト","キャッサバでん粉","キャティ・ビスキュイ","キャビア","キャベツ","キャラメライズ","キャラメル","キャロル","キュイソン","キュイール","旧式焼酎","九助",
        "級別","キュラソー","キューリグ","京秋","きょうかい酵母","京桜","京都ラーメン","響マーク","強力粉","共立て","きょく子","巨峰　ヨーグリートソーダ","巨峰紫　オレンジ","巨峰紫　ロワイヤル","キラー酵母","桐油",
        "切りいかあめ煮","切返し","切返し機","きりざんしょ","きりたんぽ","切りばな","切干甘藷","キリマンジァロ","切りみつば","キルシュワッサー","キルッシュ","キルッシュワッサー","キルン","布ドリップ","切干しだいこん",
        "木綿豆腐","キワノ","きんかん","きんぎょく糖","キングクリップ","キング・ピーター","キンサイ","禁酒法","金属探知機","きんつば","きんとき","金時豆","金波がえがい","きんばがえがい","きんめだい","キール","キール・アンペリアル",
        "キール・ロワイヤル","空寸","クエン酸","くきわかめ","クグミ","クゴミ","クサソテツ","クサナ","草もち","くさや","くし団子","くじら","クズ","くずきり","葛焼酎","くずしょうちゅう","くずでん粉","屑米","くずまい",
        "くずまんじゅう","下り酒","くだりざけ","口かみ酒","くちなし","クッキングワイン","クッキー","クッシェ","クネーテン","クバ・リブレ","くびれづた","球磨拳","球磨焼酎","熊本ラーメン","組合わせ","汲掛け",
        "汲出し四段","汲水","くみ水","汲水歩合","クモノスカビ","くらげ","クラシフィカドール","クラスタ","クラスト","クラッカー","クラッシャー","クラバンジーナ","クラリフィエ","クランチ","くり","栗ウーロン","栗香",
        "栗焼酎","クリスタリゼ","栗ミルク","クリーミーハバティ","クリーム","クリームスタイル","クリームダウン","クリームチーズ","クリームパン","車糖","車ふ","クルミ","久留米ラーメン","クルードラム","クレソン","クレマ",
        "クレープ","クレープパンキッド","クレームシャンティ","クレーム・アエロバチュ","クレーム・ドゥーブル","クレーム・ド・カシス","クレーム・ド・サンタギュール","黒","くろあわびたけ","くろかじき","黒粕","黒からし油",
        "クロカン","クロカント","黒貴","黒麹","黒麹菌","クロッタンドゥシャビニョール","クロップ","クロテッドクリーム ブランデー","クロテッドクリーム プレーン","黒はんぺん","黒パン","黒ビール","黒米","くろまぐろ",
        "黒豆","クロム","クロロゲン酸","クロロフィル","クロワッサン","クロンダイク・ハイボール","クローブ","クロール","古酒","クーベルチュール チョコレート","クーラー","珪藻土","計量の仕方","ケカビ","毛がに","けし",
        "削り昆布","削り節","削り節つくだ煮","ケチャップ","結晶","欠点豆","ケットル","血液","煙臭","ケルシュ","嫌気性菌","嫌気的発酵","検尺口","検蒸","検定","研米機","ケーキドーナッツ","ケーキミックス",
        "ケーク オ ショコラ","ケーク濾過","ケーゼ","ケーゼクーヘン","ケーゼゲベック","ケーゼレベレン5ヶ月熟成","ケーゼレベレン・マウンテンハーブ","ケール","こいくちしょうゆ","こいろ","こういか","高温短期型",
        "高温短期速醸もと","高温糖化もと","紅花","硬化油","公害対策基本法","好気性菌","好気的発酵","高級アルコール","抗酸化剤","高酸味酒","酵剤仕込み","酵剤浸漬","酵剤糖化四段","硬質小麦粉","硬質米","甲州",
        "沖縄そば","高縮麹","麹","麹エキス","麹カビ属","麹菌","こうじ漬","麹汁","麹箱","麹ばな","麹歩合","麹蓋","麹蓋法","麹米","麹室","硬水","高精白米","酵素","酵素仕込み","酵素浸漬","酵素糖化四段","紅茶",
        "紅茶焼酎","紅茶茶葉の製造工程","口中香","硬度","黄にら","黄ピーマン","高分子物質","酵母","酵母仕込み","酵母純度","酵母密度","香味野菜","高麗人参酒","高梁酒","後留","後留臭","甲類","氷砂糖","凍り豆腐",
        "郡山八幡","糊化","焦がしネギ","濃色ビール","呼吸","国際コーヒー機構","国際コーヒー協定","黒糖","黒糖焼酎","穀物酢","穀粒計","穀類","アマランサス/玄穀","あわ/精白粒","えんばく/オートミール","おおむぎ/押麦",
        "おおむぎ/大麦めん/乾","おおむぎ/大麦めん/ゆで","おおむぎ/米粒麦","おおむぎ/七分つき押麦","おおむぎ/麦こがし","きび/精白粒","うどん/生","うどん/ゆで","そうめん・ひやむぎ/乾","そうめん・ひやむぎ/ゆで",
        "手延そうめん・手延ひやむぎ/乾","手延そうめん・手延ひやむぎ/ゆで","干しうどん/乾","干しうどん/ゆで","[玄穀]/国産/普通","[玄穀]/輸入/硬質","[玄穀]/輸入/軟質","[小麦粉]/強力粉/1等","[小麦粉]/強力粉/2等",
        "[小麦粉]/強力粉/全粒粉","[小麦粉]/中力粉/1等","[小麦粉]/中力粉/2等","[小麦粉]/薄力粉/1等","薄力粉","てんぷら用","ホットケーキ用","即席中華めん/油揚げ","即席中華めん/油揚げ味付け","即席中華めん/非油揚げ",
        "中華スタイル即席カップめん/油揚げ","中華スタイル即席カップめん/油揚げ、焼きそば","中華スタイル即席カップめん/非油揚げ","和風スタイル即席カップめん/油揚げ","ぎょうざの皮","小麦たんぱく/粉末状","小麦たんぱく/ペースト状",
        "小麦たんぱく/粒状","小麦はいが","しゅうまいの皮","パン粉/乾燥","パン粉/生","パン粉/半生","ピザクラスト","沖縄そば/生","沖縄そば/ゆで","中華めん/生","中華めん/ゆで","干し沖縄そば/乾","干し沖縄そば/ゆで",
        "干し中華めん/乾","干し中華めん/ゆで","蒸し中華めん","乾パン","クロワッサン","コッペパン","食パン","ナン","フランスパン","ぶどうパン","ライ麦パン","ロールパン","生ふ","竹輪ふ","焼きふ/板ふ","焼きふ/観世ふ",
        "焼きふ/車ふ","マカロニ・スパゲッティ/乾","マカロニ・スパゲッティ/ゆで","アルファ化米","上新粉","おにぎり","きりたんぽ","米こうじ","ビーフン","焼きおにぎり","玄米","七分つき米","精白米","半つき米","玄米","七分つき米",
        "精白米","はいが精米","半つき米","玄米","七分つき米","精白米","半つき米","玄米","七分つき米","精白米","半つき米","玄米","七分つき米","精白米","はいが精米","半つき米","あくまき","白玉粉","赤飯","道明寺粉","もち",
        "玄米","七分つき米","精白米","半つき米","玄米","七分つき米","精白米","半つき米","生","ゆで","全層粉","中層粉","内層粉","表層粉","そば米","干しそば/乾","干しそば/ゆで","とうもろこし/玄穀","コーングリッツ",
        "コーンフラワー","コーンフレーク","コーンミール","ジャイアントコーン/フライ、味付け","ポップコーン","精白粒","ひえ/精白粒","もろこし/玄穀","もろこし/精白粒","ライむぎ/全粒粉","ライむぎ/ライ麦粉","固形寒天",
        "固形酵母","焦げ臭","ココ","ココア","ココアバター","ココアパウダー","ココス","ココスフロッケ","ココナッツ","ココナッツウォーター","ココナッツパウダー","ココナッツミルク","ココナッツ・ドリーム","ココナッツ・ムーン",
        "ココモ・オレンジ","ココモ・コーラ","ココモ・ピニャ・コラーダ","ココモ・ミルク","心白粒","コゴミ","コシ","こし","こしあん","甑","こしき","甑肌","こしきはだ","古酒","こしょう","個数計算","コスモポリタン",
        "コスレタス","枯草菌","こち","コチニール","コットン・フラワー","コッペパン","粉糖","コナ","コナ・マック","コニャク","コニャック","こねぎ","このわた","琥珀色","コハク酸","小林製麺","コパ・ミルク","コブクロ",
        "コブラー","コポー","古米","古米臭","古米酒臭","こまつな","こむぎ","小麦粉","小麦でん粉","小麦胚芽","小麦胚芽焼酎","米","こめ油","米置き","米菓","米麹","米こうじ","米焼酎","米酢","米でん粉","米糠","米ぬか油",
        "米みそ","子持ちがれい","コリン","コリンズ","コルクスクリュー","コルク栓","コルコバード","コルヌ","コルネ","コロッケ","コロレ","コロンビア","コワントロー","混合指示薬","混合焙煎","コンセイエ","混成酒",
        "混成酒","コンタミ","混濁","コンテ12ヶ月熟成","コント","こんにゃく","コンフィ","コンフィズリー","コンフェクショナリー","コンフリー","昆布","こんぶ","昆布だし","昆布茶","昆布巻かまぼこ","昆布巻きかまぼこ",
        "混和酒","コーヒーアカデミー","コーヒー鑑定士","コーヒー","コーヒー入り清涼飲料","コーヒー飲料","コーヒー飲料の製造工程","コーヒークーポン","コーヒーサーバー","コーヒーシュガー","コーヒー焼酎","コーヒーチェリー",
        "コーヒーの日","コーヒー博物館","コーヒーベルト","コーヒーホワイトナー","コーヒーマイスター","コーヒー豆の産地","コーヒー・リキュール","コーラ","コーラの語源","コーラル・スタイル","コールラビ","コーン油",
        "コーンクリームスープ","コーングリッツ","コーンシロップ","コーンスターチ","コーンスナック","コーンチップ","コーンフラワー","コーンフレーク","コーンミール","細菌","細菌酸度","さいしこみしょうゆ","サイダー",
        "採点法","サイドカー","サイドメニュー","サイフォン","サウザンアイランドドレッシング","サエ","杯","さかずき","酒田ラーメン","酒袋","酒米","サガクラシック","さき","酢酸","酢酸菌","さくらえび","桜ジンジャー",
        "桜葉","さくらます","桜ミルク","桜もち","さくらんぼ","酒粕","酒かす","酒粕焼酎","酒焼酎","酒の五味","酒齢","サゴでん粉","笹かまぼこ","ささげ","笹の葉","ささ身","さざえ","サザン・オレンジ","サザン・コーラ",
        "サザン・ジンジャー","サザン・スパークル","サザン・トニック","サザン・ピーチ","差水","サステナビリティ","サチネット","サッカロミセス属","殺菌剤","殺菌乳製品","札幌ラーメン","名古屋きしめん","さっぽろらーめん",
        "札幌ラーメン横丁","冊封使","さつぽうし","さつま揚げ","薩摩芋","さつまいも","さつまいもでん粉","薩摩焼酎","薩摩焼き","薩摩料理","さといも","さといもしょうちゅう","里芋焼酎","しょ糖型液糖","転化型液糖",
        "角砂糖","氷砂糖","粉糖","コーヒーシュガー","三温糖","上白糖","黒砂糖","氷糖みつ","グラニュー糖","白ざら糖","中ざら糖","和三盆糖","はちみつ","メープルシロップ","異性化液糖","果糖","粉あめ","含水結晶","全糖",
        ]
        
        return ReturnWordArray
        
    }
   
}
