//
//  JijiWord.swift
//  Hassouseisei_ver_2_0
//
//  Created by 岡大輔 on 2015/03/16.
//  Copyright (c) 2015年 岡大輔. All rights reserved.
//

import Foundation

class JijiWordStore: WordStore{
    class func returnCaption() -> String{
        return "時事用語"
    }
    
    class func ReturningWordArray() -> Array<String>{
        var ReturnWordArray:[String] = []
        
        //http://www.weblio.jp/category/business/sngjy
        
        var wordArray = ["アイアムケンジ","ISD条項","ＩＸＶ","IFO注文","ILOグローバルリポート","アイオリス山","アイサイト","アイサイトカメラ","アイザーウェイ","アイシル","ICT維新ビジョン","ICT教育","アイスカップヌードル",
             "アイスクエイク","アイスバケットチャレンジ","アイスバケツチャレンジ","アイスバーグ・スケーティング・パレス","アイスル","ISIL","アイセック","アイソトープ電池","アイソン彗星","Iターン就農","IWG報告書","IT関連銘柄",
             "アイヌ象徴空間","アイヌ文化象徴空間","アイヌ民族象徴空間","アイヌ民族党","アイヌ民族の共生の象徴となる空間","相乗り衛星","あい乗り衛星","相乗り候補","相乗り小型衛星","相乗り小型副衛星","アイピーシーシー",
             "IPCC","アイボール","i-Ball","アイミーブ","IUU","アイランドリバーサル","アイルワースのモナリザ","アイルワース版モナリザ","アウストラロピテクス・アファレンシス","アウストラロピテクス・セディバ",
             "アウターライズ","アウターライズ地震","アウトパフォーム","アウトブレイク","アウトライト","アウトライト取引","青い森信金","青色LED","青色発光ダイオード","青葉アルコール","青海・台場クロスウォーク",
             "赤色警報","赤警報","赤坂議員宿舎","赤坂衆議院議員宿舎","赤三兵","赤三兵先詰まり","赤三兵思案星","暴対法","暴追放センター","赤字国債","赤ちゃん工場","あかちゃんポスト"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/aa/2
        
        wordArray = ["アカデミー名誉賞","赤髭対象","赤ひげ大賞","赤水図","空き家対策の特別措置法","空き家等適正管理条例","空き家等の適正管理に関する条例","空き家の管理条例","秋学期入学","商い3年","商い三年","秋入学",
            "秋の5連休","秋の園遊会","秋の例大祭","秋葉原無差別殺傷事件","空き家管理条例","空き家対策法","空家等対策の推進に関する特別措置法","アクアトップディスプレイ","アクサ","アクシーズ・ジャパン証券株式会社",
            "アクシーズ・アメリカ","アクセプタンス","アクタ","芥川賞選考委員","アクティブラーニング","アク抜け感","あく抜け感","アクロ研究所","アグザム・インベストメント","アグゼス・アメリカ","アグニ5ミサイル",
            "アグニファイブミサイル","アグニ5","上げ足の差し込み線","上げ三法","上げ過ぎ感","上げ転換","上げトレンド","上げの2つ星","上げの3つ星","上げの二ツ星","上げの二つ星","上げの三ツ星","上げの三つ星",
            "上げ幅","上場投資証券","上場投信","上げ余地","アコード","朝霞公務員宿舎","浅川ダム","朝高","アサド政権","アサハンアルミニウム計画","アサハンアルミニウム事業","アサハン開発事業","アサハン計画",
            "アサハン事業","旭大","旭重","旭中","旭双","旭単","朝安","足場の壁つなぎ","足踏み状態","アジア安全保障会議","アジアカップ","アジア株","アジア株式","アジア競技大会"]
        
        //http://www.weblio.jp/category/business/sngjy/aa/3
        
        ReturnWordArray += wordArray
        
        wordArray = ["アジア競技大会","アジア時間","アジア時間帯","アジア太平洋自由貿易圏","アジア太平洋自由貿易地域","アジア大会","アジア中南米協力フォーラム","アジアビジネスサミット","アジア銘柄","アジアリバランス",
            "アジア・ゲートウェイ構想","アジア・ダウ","紫陽花革命","アジサイ革命","あじさい革命","アジュバントによる自己免疫・炎症性症候群","アジュバント病","アジュバント誘発性自己免疫・炎症性症候群","アスキアの墓",
            "アストゥリアス皇太子賞","アスベストはい","アスペルガー障害","アスペルガー症候群","アスペルガーシンドローム","預り保証金","アセアン株","アセアン株式","アセアン中国FTA","ASEAN+6","ASEAN+3","アセアン・韓国FTA",
            "アセタミプリド","アセットバック証券","アタカマ大型ミリ波サブミリ波干渉計","アタックス","ATACS","アタック・オン・タイタン","新しい人権","新しい政策研究会","新しい普通","新しい歴史教科書をつくる会",
            "アダプティブクルコン","アダプティブクルーズコントロール","アダプト制度","アチェ","アチェ州","圧縮空気機関","圧縮空気車","アッシーシ国防相","アッシーシ第1副首相","斡旋収賄罪","あっせん収賄罪","アップトレンド",
            "アップルウオッチ","アップル関連株","アップル関連銘柄","暑さ指数","圧力鍋爆弾","圧力抑制室","圧力抑制室用貯水タンク","圧力抑制プール","我的夢","あて首線","阿寺断層","アディズ","アディポソーム","アディポネクチン",
            "アディポロン","阿寺断層帯","アトキンソンサイクル","アトサイト","後方かかえ込み2回宙返り3回ひねり","アドバンストコンバインドサイクル発電","穴あきダム","アナカルジン酸","アナカルディック酸"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["アナカルド酸","アニマルロス","アニュアルリポート","アニュアルレポート","アノイリナーゼ","アノニマス・イベロアメリカ","アバスチン","アパルトヘイト","アパルトヘイト政策","アビガン","アビガン錠","アフガニ",
            "アフガニスタン侵攻","アフガニスタン銃乱射事件","アフガニー","アフガン銃乱射事件","アフガン紛争関連資料公開事件","アフガン乱射事件","アフターフォー","アフター4","アフラトキシン","アフリカ開発会議","アフリカ大旱魃",
            "アブソーバ","アブデラズィズ・ブーテフリカ","アブデルアジズ・ブーテフリカ","アブデル・ファタハ・シーシ","アブドルジャリル","アブドルファッターフ・アッ＝シーシー","油券","アブ・サリーム刑務所","アブ・バクル・アル・バグダディ",
            "アブ・バクル・バグダディ","アブー・サリーム刑務所","安倍色","安倍カラー","安倍外交","安倍晋三","安倍ドクトリン","あべのハルカス","アベノミクス","アベノミクス解散","アベノミクス三本の矢","アベノミクス3本の矢",
            "アベノミクス戦略特別区","アベノミクス戦略特区","アベノミクス第4の矢","アベノミクス疲れ","アベノミクス特区","アベノミックス","アベノリスク","アポカリプティックサウンド","アホロートル","アポロ宇宙船",
            "アポロ司令船・機械船","雨傘革命","尼崎JR脱線事故","天下り監視委員会","天下り監視委","天下り禁止","天国から帰った少年","あまサミット 別名：アマサミット","海女サミット","アマゾン税","アマゾン・プライム・エアー",
            "アミロイドβ","アミロイドβ蛋白","アミロイドβタンパク","アミロイドβ蛋白質","アミロイドベータ蛋白","アミロイドベータタンパク","アミロイドベータタンパク質","アミロイドβタンパク質"]
        
        ReturnWordArray += wordArray
        
        
        //http://www.weblio.jp/category/business/sngjy/aa/5
        wordArray = ["アミロイドベータ蛋白質","アミロイドベータプロテイン","アムダ","AMDA","アメイジア","アメイジア大陸","アメリカEU自由貿易協定","アメリカ軍軍属","アメリカ運輸省道路交通安全局","アメリカ欧州連合FTA",
            "アメリカ欧州連合自由貿易協定","アメリカ株","アメリカ株式","アメリカ外交公電Wikileaks流出事件","アメリカ合衆国運輸省道路交通安全局","アメリカ金塊先物相場","アメリカ金融規制改革法","アメリカ軍属","アメリカ鉤虫",
            "アメリカ黒人青年射殺事件","アメリカ国家安全保障局","アメリカ証券業協会","アメリカ時間","アメリカ時間帯","アメリカ同時多発テロ","アメリカナマズ","アメリカ白人警察官による黒人射殺事件","アメリカ銘柄",
            "アメリカライフル協会","アメリカ・韓国間FTA","アメリシウム","アメーバ経営","アユモドキ","新たな国土のグランドデザイン","新たな常態","新たな地域名表示ナンバープレート","新たな電波の活用ビジョンに関する検討チーム",
            "アラビア半島のアルカイダ","アラビア半島のアルカーイダ","アラファト","アラファト議長","粗付加価値","アラブ人街","アラブの春","アラブ街","粗利益率","粗利率","アラル海","露軍グルジア侵攻","アリアン5",
            "アリス・アン・マンロー","アリス・マンロー","アリピプラゾール","アリューシャン列島","アリラン3号","アルカンサ旅団","歩きスマホ専用歩道","歩きスマホ用歩道","アルクチゲニン","アルコール性肝障害",
            "アルコール専売事業","アルゴリズム取引","アルシャバブ","アルジャジーラ","アルストムグリッド","アルセニ・ヤツェニュク","アルセニー・ヤツェニュク","アルバート・ラスカー医学研究賞","アルビン・ロス",
            "アルファシヌクレイン","アルマ","ALMA","アルマ望遠鏡","アルメニア原発","アル・カンサ・ブリゲード","アル・ヌスラ戦線","アレヴァ","アレクサンドル・トゥルチノフ","アレッポ","アレバ"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/aa/6
        
        wordArray = ["アレルギー性肉芽腫性血管炎","アローヘッド","アローワンス","アンギオテンシン2受容体遮断薬","アングレーム国際漫画祭","暗黒エネルギー","暗黒物質","アンシステマティックリスク","安心子ども基金",
             "アンジオテンシンII受容体拮抗薬","アンジオテンシン2受容体拮抗薬","安重根記念館","安重根義士記念館","安重根","アンジュングン記念館","安全資産","安全通貨","安全の鐘","安全保障担当大臣","安全保障担当相",
             "安全保障ダイヤモンド","安全保障のダイアモンド","安全保障法制担当相","安全保障法制担当大臣","安全保障理事会決議1874","安息香酸ナトリウムカフェイン","アンタレスロケット","アンダーパフォーム","アンチGLBT",
             "アンチLGBT","アンチアマゾン法","アンチサテライトウェポン","アンチサテライトミサイル","アンチ菅","アンチバラカ","安哲秀","アンチョルス","アンチ・ダンピング関税","アンドラペセタ","アンドルー王子",
             "アンドロイドガラケー","Androidガラケー","アンナカ","アンネの日記","アンビシャス","アンビシャス市場","アンピンシャ","アンフィレギュリン","アンフィレグリン","アンブレラレボリューション","アンブロークン",
             "アンペア下げ","安保相","安保理改革","安保理決議","アンミス","UNMISS","UNMIS","アンメットメディカルニーズ","安龍福","アンレバードベータ","アンレバードβ","アンワインド","アン・ヨンポク","アークホーン",
             "アースアワー","アートメイク","アートメイク・タトゥー","アーニングサプライズ","アーリーハーベスト","アールオーシー","RO膜","Rce1タンパク質","RJCカーオブザイヤー","RCEP","RDF発電"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/ii
        
        wordArray = ["伊400型","伊400型潜水艦","委員長解任決議","言う吉くん","言うだけ番長","云南地震","イェタグンガス田","家電銘柄","イエメンリアル","イエメンリヤル","イエメンリヤール","家歴書","イエロールート",
              "硫黄島","魚の水域表示","イオン吸着型の鉱床","イオン吸着型のレアアース鉱床","イオン吸着型レアアース鉱床","イオン吸着型鉱床","伊方原子力発電所","伊方原発","伊方発電所","依願退職","行き詰まり線",
              "域内包括的経済連携","イギリスGCHQ","イギリス重大不正捜査局","イギリス政府通信本部","イギリスの政府通信本部","育英資金","いくさの子","いくさの子－織田三郎信長伝－","イクジイ","育児休業基本給付金",
              "育児休業給付金","育児休業者職場復帰給付金","育児用粉ミルク","育鵬社版教科書","育メン","イクメン","イクメンの素","イクランドラコ・アバタル","イクランドラコ・アバター","遺訓統治","イグナリナヴィサギナス原発",
              "イグナリナ原子力発電所","イグニッションスイッチ","イグノーベル賞","イグノーベルプライズ","犠牲祭","イコモス","伊號第四百型潜水艦","鯨資源","諫早湾干拓開門請求訴訟","諫早湾干拓事業訴訟","諫早湾干拓訴訟",
              "イサンドゥク","李相得","イサンドク","石井部隊","石撃ち","石打ち","石撃ち刑","石打ち刑","石撃ちの刑","イシスクソコラグランプリ","石投げの刑","石原グランドチルドレン"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/ii/2
        
        wordArray = ["石原グランドチルドレン","石原グループ","石原慎太郎新党","石原新党","石破茂","異種トレ","異種トレード","石綿肺","維新8策","維新政治塾","維新の会分党","維新の党","維新八策","維新版船中八策","維新分党",
              "異次元金融緩和","維持保証金","イスカンダル作戦","イスカンダルプロジェクト","イスカンダル・バイオプロジェクト","イスカンデル","イスダ","ISDA","イスラミックステート","イスラム学者委員会","イスラム国",
              "イスラム聖戦士血盟団","イスラム・マグレブ諸国のアルカイダ組織","イスラム街","イスラム・マグリブ諸国のアルカイダ組織","イスラム・マグレブ諸国のアルカイダ","イスラム・マグレブ諸国のアルカイダ機構",
              "イスラーム国","イスラーム・マグリブ諸国のアルカイダ組織","イスラーム・マグレブ諸国のアルカイダ組織","出雲氏","出雲国造家","伊勢原断層","伊勢二見メガソーラー光の街","磯焼け","イソリクイリチゲニン",
              "遺族生活資金","板","イタイイタイ病","委託介入","委託仕入れ","委託仕入","委託物流","痛四股名","板状況","痛スイカ","痛Suica","板寄せ方式","イタリア危機","イタリア債務危機","イタリア財政危機",
              "一院制","一月効果","1月効果","1月バロメーター","1区間割引","一国家二制度","一次卸","一次卸業者","一時帰宅同意書"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/ii/3
        
        wordArray = ["一時国有化","一時貯蔵プール","一事不再議","一時亡命","一人別枠方式","一日契約","1年間4学期制","一部執行猶予","一覧払輸出手形買相場","一覧払輸入手形決済相場","一類感染症","一個中國","一個中國原則",
            "一括交付金","一国两制","一国二制度","一国両制","一式双発高等練習機","一式双発高練","1者応札","一斉帰宅","一斉帰宅抑制の基本方針","イッセン・ハブレ","一致DI","一致指数","一致指標","一兆ドル貨幣","一兆ドル硬貨",
            "1兆ドル硬貨","一店一帳合制","イットガール","一般会計総額","一般化社会拠出金","一般勘定","一般教書","一般教書演説","一般気配","一般財団法人","一般社会税","一般社団法人","一般信用取引","一般世帯",
            "一般特恵関税制度","一般特恵制度","一般の地下利用に対し十分に余裕を持った深度への埋設","一般廃棄物処理手数料減免申請書","一般廃棄物処理手数料減免等申請書","一般廃棄物搬入申請書","一般用医薬品",
            "一票の重みの不平等","一票の格差","1票の格差","一本値","遺伝学的検査事業","遺伝学的検査ビジネス","遺伝子組み換え細菌","遺伝子組み換え添加物","遺伝子組み換え微生物","遺伝子検査事業","遺伝子検査ビジネス",
            "遺伝子診断ビジネス","遺伝子治療薬"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/ii/4
        
        wordArray = ["移動式新型ミサイル","移動平均乖離率","移動平均収束拡散指標","移動平均収束拡散法","井戸沢断層","イナビル","委任状争奪戦","委任状闘争","犬肉祭","イヌ肉祭り","犬ジステンパー","いぬジステンパー","犬肉の祭",
            "犬肉の祭り","犬肉祭り","イネ稲熱病菌","イネいもち病菌","居眠り運転防止グッズ","居眠り運転防止装置","居眠り運転防止用品","茨城沖","茨城県沿岸沖合","茨城県沖","茨城県沖合の海域","茨城県の沖合","IFD注文",
            "イブニングセッション","イプシロン","イプシロンロケット","イベントリスク","違法漁業国","違法操業国","違法ドラッグ","違法・無報告・無規制","李明博","イミョンバク","イムノクロマト","イムノクロマトグラフィー",
             "イムノクロマトグラフィー法","イムノクロマト法","イムノトキシン","夢洲大規模太陽光発電所","稲熱病菌","イモチ病菌","イモビカッター","イモビライザーカッター","医薬前駆体","医薬品のインターネット通信販売",
             "医薬品の通信販売","医薬品のネット販売","嫌気売り","イ病","伊四〇〇型","伊四〇〇型潜水艦","イラク戦争の米軍機密文書公開事件","イラク通貨詐欺事件","イラク通貨事件","イラクディナール詐欺事件","イラクとシャームのイスラーム国",
             "イラクとシリアのイスラーム国","イラクとレバントのイスラム国","イラクとレバントのイスラーム国","イラク･シャーム･イスラム国","イラク･シャーム･イスラーム国","イラク･シリア･イスラーム国","イラク・レバントのイスラム国",
             "イラク・レバント・イスラーム国","イラン核開発問題","イラン核問題","イラン経済制裁","イランのウラン濃縮施設","イランの核開発問題","イランの核問題","入り首線","イリューシン78","医療格差","医療観光",
             "医療機関債"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["医療ツーリズム","医療費2025年問題","医療費の2025年問題","医療費の自己負担","医療用に準じたカテゴリーの医薬品","威力業務妨害","威力業務妨害罪","イルカ追込み猟","イルカ追い込み猟","イルカ追込み漁",
             "イルカ追い込み漁","イルワン","入替売買","入れ墨メイク","イレッサ","イレッサ訴訟","磐余池","飲食物摂取制限","飲食物摂取制限に関する指標","インジェクション牛肉","インジェクション肉","インジェクションビーフ",
             "隕石と彗星の違い","インセル型タッチパネル","インタゲ政策","インターナショナルエイズワクチンイニシアチブ","インターナショナルスワップデリバティブ協会","インターナショナル・スワップ・アンド・デリバティブ・アソシエーション",
             "インターナルポンプ","インターネット売上税","インターネット売上げ税","インターネット売り上げ税","インターネット監視法","インターネット関連株","インターネット関連銘柄","インターネット選挙運動解禁法案",
             "インターネット選挙解禁","インターネットセールス税","インターネットセールスタックス","インターネット等の適正利用に係る指導事例・活用手引","インターネット銘柄","インターネット予備校",
            "インターネットを利用した選挙運動を解禁する公職選挙法改正案","インターバンク直結方式","インターポールノーティス","インターロイキン33","インテリグリッド","インテリジェントグリッド","インテリジェント電源",
            "インテリジェントビル","インテンス・パルス・ライト脱毛","インテークマニホールド","インディ","インディ紙","インディー","インディー紙","インデペンデント","インデペンデント紙","インド高速鉄道",
            "インド人民党","インドの高速鉄道","インドの常任理事国入り","インド洋大津波","陰の陰はらみ","陰の大引け坊主","陰のコマ","陰の丸坊主","陰の陽はらみ","陰の寄り付き坊主","インパクトファクター",
            "インビザライン","インビザライン矯正","インフラバッテリー"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/ii/6
        
        wordArray = ["インフルエンザA型ウィルス","インフルエンザAウィルス","インフルエンザ菌b型ワクチン","インフルエンザ警報","インフルエンザ注意報","インフルエンザの流行発生警報","インフル警報","インフレ圧力","インフレ高進",
              "インフレ指数連動債","インフレターゲット政策","インフレ率","インフレ率目標政策","インフレ連動債","インフレーション宇宙論","インフレーション率","インフレーション理論","インホイールモーター","インマニ",
              "隠密介入","インレットマニホールド","陰連","イ・ジェソク","イ・スンマンライン","イーエフウィング","efWING","EMDR","ELSI","E型肝炎","EGF受容体","イースター航空","イースタージェット",
              "ETN","ETF","EVネオ","EU韓FTA","EU大統領","イールドレシオ"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["ウィメノミクス","ウィリアム・モーナー","ウィルス供用","ウィルス性食中毒","ウィルチェアーラグビー","ウィンドパーク","ウィンドファーム","ウィンドレンズ風車","ウィークオーダー","We the People",
               "ウイグル人労働者襲撃事件","ウイルス性食中毒","微山鉱床","ウェイシャン鉱床","ウェスチングハウス","ウェスティングハウス","ウェスティングハウス・エレクトリック","ウェストナイル熱","ウェリントン市場",
               "ウェルシュ菌","ウェルスマネジメント商品","ウェルドニッヒ・ホフマン病","ウェーバー・コケイン症候群","ウェーブライダー","上野東京ライン","上ヒゲ","植物石","植物新品種保護国際同盟条約","ウォッチコン",
               "ウォッチコンディション","ウォルソン原子力発電所","月城原発","ウォルソン原発","ウォルフソン経済学賞","ウォルフソン賞","ウォン高","ウォン安","ウォーターゲート事件","ウォーターゲート・スキャンダル",
               "ウォームビズ","ウォール街デモ","ウォール・ストリート・ジャーナル","ウォール・ストリート・ジャーナル紙","迂回寄付","迂回献金","う回献金","うかい献金","ウクライナグリヴナ","ウクライナグリブナ",
               "ウクライナ暫定政権","ウクライナ祖国党","ウクライナフリヴナ","ウクライナフリヴニャ","ウクライナフリブナ","ウクライナフリブニャ","ウクライナ民主化革命","ウクライナ連合野党・祖国","受取手付金",
               "于山島","牛トレーサビリティ法","失われた世代","牛のオーナー制度","牛の個体識別のための情報の管理及び伝達に関する特別措置法","蛆虫療法","ウジ虫療法","うじ虫療法","羅老","歌会始","うたかいはじめ",
               "歌会始の儀","歌御会始","宇宙活動行動規範","宇宙クラブ","宇宙ゴミ","宇宙ごみ","宇宙ごみ掃除衛星","宇宙ごみ掃除機","宇宙ジェット","宇宙船ドラゴン"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["宇宙太陽光発電","宇宙発射システム","宇宙帆","宇宙マウス","ウップス","鬱陵島","台日漁業委員会","台日漁業協定","台日民間投資協議","海上データセンター","海上土木工事業者","海上配備型迎撃ミサイルSM3",
                "海上立地原子力発電所","海上連合2012","ウナギ完全養殖","ウナギの完全養殖","頷き症候群","頷き病","うなずき病","海底ごみ","海底に沈んだゴミ","海底のゴミ","右尿管結石","うねり取り","右派セクター",
                "産活法","産革機構","うまい米","甘川洞","甘川文化村","海ゴミ","海ごみ","海の汚染水","海の聖域","海の聖域構想","梅北","浦底断層","裏帳簿","心リハ","ウラン燃料","ウラン濃縮施設","売上原価率",
                "売上債権回転率","売上高営業利益率","売上高経常利益率","売上高広告費比率","売上高総利益率","売上高当期純利益率","売上高連単倍率","売り圧力","売り一巡","売り一服","売り埋め","売りオペ","売りオペレーション",
                 "売り買い拮抗","売り買い交錯","売り買いまちまち","売りサイン"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["売り下がり","売り材料","売り残","売りシグナル","売り先行","売出し","売出し3年","売り出し3年","売出株","売出株式","売出し三年","売り出し三年","売り手掛り","売り手掛かり","売り手がかり",
                "売りトレンド","売り長","売りバイアス","売り本尊","売り戻し","売物一巡","売り物一巡","売り優勢","売呼値","売り呼値","閏秒","乙支フリーダムガーディアン","ウルチフリーダムガーディアン",
                "乙支フリーダムガーディアン演習","ウルトラクールビズ","ウルバッハ・ビーテ病","ウルバッハ・ヴィーテ病","ウルフ賞","ウルルン島","ウルルンド","売れないリスク","上影陰線","上影陽線","上書権",
                "上書き権","上抜け","上値遊び","上値固め","上値切下げ","上値切下","上値切り下げ","上値限定","上値めど","上値模索","上値揉み合い","上値もみ合い","上値余地","上放れ陰線","上放れタスキ",
                "上ひげ","上振れ要因","上寄り陽引け","ウンウントリウム","運賃改定","運動器症候群","運動誘発性肺出血","雲南・四川省の境の地震","雲南省地震","雲南省地震 別名：中国雲南省地震"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["雲南省と四川省の境の地震","雲南地震","雲南・四川省境の地震","雲母橄欖岩","運用レポート","ヴァリャーグ","ヴァン","ヴァーチャルウォーター","ヴィクトル・ヤヌコヴィッチ","ヴィクトル・ヤヌコーヴィチ",
                 "ヴィクラント","ヴィサギナス原子力発電所","ヴィサギナス原発","ヴィシェグラード4ヵ国","ヴィシェグラードグループ","ヴィシェグラードフォー","ヴィシェグラード4","ヴィークトル・フェードロヴィチ・ヤヌコーヴィチ",
                 "ヴィークトル・ヤヌコヴィッチ","ヴィークトル・ヤヌコビッチ","ヴィークトル・ヤヌコーヴィチ","ヴィースキャン","Vscan","ヴィーダ湖","ウーパールーパー","ウーマノミクス"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["エアアジア","エアアジア・ジャパン","エアカウンター","エアコンマット","エア断震","エアバスA380","エアバスA380機","エア免震","エア・シーバトル","永久メイク","営業外損益","営業外利益","営業損益",
                 "営業利益率","英国GCHQ","英国歳入税関庁","英国人女性殺害事件","英国政府通信本部","英国の政府通信本部","英重大不正捜査局","エイジングストレス","エイズ予防ワクチン","エイズワクチン","衛星打ち上げビジネス",
                 "衛星攻撃兵器","HSBC資金洗浄問題","H3ロケット","H断層系","H2B","H1N1亜型ウィルス","営農型発電設備","APEC閣僚会議","APEC首脳会議","江衛II型フリゲート","江衛II型フリゲート艦","液化天然ガスプラント",
                 "液状化危険度マップ","液状化マップ","液状化予測図","エキゾチック通貨","エキゾーストマニホールド","益出し","益だし","益出し一巡","益出し売却","エキマニ","エクイティリスクプレミアム","エクオール",
                 "エクササイズ・マラバール","EX-IC","エクスプレスIC","エクソフィアラ","エコウィル","エコカー補助金","エコ玩具","エコキュート","エコジョーズ","エコセメント","エコテロリズム","エコノミスト","エコノミスト紙",
                 "エコノミック・アウトルック","エコノモ脳炎","エコピア","ECOPIA","エコプロダクツ展","エコポイント","エコポイント事業","エコポイント事務局"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["エコポイントの活用によるグリーン家電普及促進事業","エコルミ","エコーネット","エシカルファンド","エジプトCASE30","エジプトCASE30指数","エジプトEGX30","エジプトEGX30種指数","エジプトEGX30指数",
                  "エジプトEGX30種","エジプト新憲法案","S&P 500種株価指数","SNH48","SFTSウィルス","SM-3","Sチップ","ST倍率","エチゼンクラゲ","越境汚染","越境大気汚染","エックス線自由電子レーザー","エックスバンドレーダー",
            "Xバンドレーダー","越波","越流浸食","エトナ火山","エトナ山","江戸っ子1号","エドワード・ジョセフ・スノーデン","エドワード・スノーデン","エナジードリンク","N95微粒子マスク","NTT分社化","NT倍率",
            "NDD","N700A","エネファーム","エネブライト","エネルギー基本計画","エネルギー収支比","エネルギー消費機器","エネルギー政策","エネルギー地産地消","エネルギーの地産地消","エネルギーペイバックタイム",
            "エネルギー・スマートコミュニティ・イニシアティブ","エヒメアイト","愛媛閃石","エビリファイ","エピオルニス","FX取引規制","エプスタインバーウイルス感染症","エプスタインバールウィルス","エプスタインバールウイルス感染症",
            "エボラウィルス","エボラウィルス感染症","エボラウィルス疾患","エボラウィルス病気","エボラウイルス","エボラウイルス感染症","エボラウイルス疾患","エボラウイルス病","エボラ出血熱","エボラ出血熱と闘う人たち",
            "エボラと闘う人たち","エボラ熱","エボラファイター","エボラファイターズ","MNPインセンティブ"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["MFグローバルFXA証券","MFグローバル・ホールディングス","MQ-4Cトライトン","M細胞","エメラルドエース","えらぼーと","エリア社員","エリザベスタワー","エリザベス塔","エリック・ベッチグ","エリベルト・ラスカノ",
             "LNG船","エルシニア","エルシニア菌","エルシニア細菌","エルシニア属菌","エルシー","エルジシュ","エルジュジュ","LGBT","Ｌ0系","LT貿易","エルトゥルル号","エルトゥールル号","エルドアン","エルドアン首相",
             "エルニーニョ","エルニーニョ現象","LPG車","エルベグドルジ","エルベグドルジ氏","エルベグドルジ大統領","エルラッド","エルラッド","エレファントバード","エロモナス・ハイドロフィラ","円売り介入",
             "円売り協調介入","円売り地合い","円売りトレンド","円売りドル買い","円売り・ドル買い介入","円売り・ドル買い協調介入","円貨建外債","塩化ビニルモノマー","塩化ビニールモノマー","猿害","円買い地合い",
             "円買いトレンド","円キャリー取引","円キャリートレード","円急騰","円急落","遠距離大量送水システム","円債","円サイド","塩酸ラクトパミン","円借款","円ショート","遠日点","煙草相談員","円相場",
             "円建資産","エンタメ流行語","円高圧力","円高介入","円高株安"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["円高為替介入","円高関連倒産","円高基調","円高地合い","円高総合対策","円高相場","円高対応緊急ファシリティ","円高対策","円高倒産","円高ドル安","円高ファシリティ","円高ユーロ安","円建て外債","円建て資産",
             "円建て借款","遠地地震","エンテロウイルス","エンテロウイルス71","エンテロウイルス71型","エンディングノート","円投/ドル転","エントモファジー","円独歩高","円独歩安","円売介入","円売・ドル買介入","塩ビモノマー",
             "延坪島","延坪島事件","煙霧","円安圧力","円安介入","円安株高","円安為替介入","円安基調","円安地合い","円安相場","円安ドル高","円安ユーロ高","円ロング","ARF","ASIA症候群","ALSマウス","AAA",
             "Aa3","AAプラス","エース級種牛","Aトレイン"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["小1問題","追込み猟","追い込み猟","追い込み漁","美味しんぼ","「美味しんぼ」鼻血問題","オイルフェンス","オイルボール","王位継承権","応援警察官","応援融通","応急仮設住宅","応急危険度判定","応急危険度判定士",
              "応急組立橋","応急組み立て橋","扇島太陽光発電所","黄金の3年","黄金の72時間","黄金の三年","黄金の三年間","黄金の3年間","特買い","特商","特商法","欧州安全保障協力機構","欧州安定メカニズム","欧州安保協力会議",
              "欧州ウナギ","欧州うなぎ","欧州加圧水型原子炉","欧州株","欧州株式","欧州韓国FTA","欧州共同債券","欧州金融安定化基金","欧州金融安定化債","欧州金融安定基金","欧州金融安定基金債","欧州金融安定ファシリティ",
              "欧州金融安定ファシリティ債","欧州金融安定ファシリティー","欧州金融危機","欧州原子力共同体","欧州債券機関","欧州債務危機","欧州債務危機問題","欧州時間","欧州時間帯","欧州ソブリン危機","欧州ダウ","欧州中核国",
              "欧州馬肉問題","欧州広場","欧州ミサイル防衛","欧州銘柄","欧州理事会議長","欧州連合大統領","欧州連合統計局","欧州連合理事会議長","黄綬褒章","往復外交","欧米株","欧米株式","欧米銘柄","オウム真理教",
              "王立軍米総領事館駆け込み事件","王立軍亡命未遂事件","王立軍事件","大飯原発再稼働","大飯原発再稼働問題"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["狼男ゲーム","大川小津波訴訟","大川小学校訴訟","大川小訴訟","大型台風","大型ハドロンコライダ","大型ハドロン衝突型加速器","大型浮体式構造物","大型放射光施設","大型リチウムイオン蓄電池","大型リチウムイオン電池",
               "大型リチウムイオン二次電池","大口取り引き","大蔵省担当者","大口売り","大口買い","大口取引","大口取引き","大阪W選","大阪W選挙","オオサカアイト","大阪維新の会","大阪駅北地区","大阪広域水道企業団",
               "大阪市客引き行為適正化条例","大阪市客引き行為等の適正化に関する条例","大阪市客引き行為の適正化条例","大阪市客引き条例","大阪市職員の入れ墨問題","大阪消防庁","大阪石","大阪ダブル選","大阪ダブル選挙",
               "大阪都","大阪都構想","大阪版学力テスト","大阪版広域連合構想","大阪府職員基本条例","大隅海峡","大隅良典","大つけ麺博","大手銀","大手銀行","大手町温泉","大花水金梅","大媽","大幅続伸","大幅続落",
               "大幅反発","大幅揉合い","大幅揉合","大幅揉み合い","大幅もみ合い","大反魂草","大間原子力発電所","大間原発","大室ダシ","大飯F-6断層","大飯原発F-6断層","大飯発電所敷地内F-6断層","大飯発電所敷地内F-6破砕帯",
               "大谷石","公の秩序又は善良の風俗に反する事項を目的とする法律行為","大揺れ度","岡山石","オカヤマライト","オガララ帯水層","沖縄キズナ宣言","沖縄基地負担軽減策","沖縄密約","オクサンドル・トゥルチノフ",
               "屋内退避圏","オクラホマ竜巻","オクラホマトルネード","送り付け詐欺","送りつけ詐欺","送り付け商法","送りつけ商法","お化粧買い","お米の放射性物質検査","オサート","オサート・オルソケラトロジー","小沢ガールズ",
               "小澤の不等式","押し上げ介入","押し買い規制","押し買い","押し付け販売","押しのけ効果","押しは空まで","押し目買い","押目待ちに押目なし","押し目待ちに押し目なし","押目待ちの押目なし","押し目待ちの押し目なし",
               "汚職指数","オシレーター系","オシレーター系指標","オスグッド病","オスグッド・シュラッター症候群","オスグッド・シュラッター病","オスグッド・シュラッテル病","オスプレイ","オスプレイ搬入計画","オスプレイ横田基地配備",
               "オスプレイ横田配備","オスロ事件","オセアニア株","オセアニア株式","オセアニア市場","オセアニア通貨","オセアニア銘柄","おせち問題","汚染石","汚染疑い牛","汚染疑い牛肉","汚染疑いの牛肉","汚染がれき",
               "汚染砕石","汚染樹皮","汚染水","汚染水の海への放出","汚染水の海洋への放出","汚染水の海洋放出","汚染水の浄化システム","汚染米水田","汚染マップ","遅行指数","オゾン層破壊"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["オゾン層の破壊","オゾン層破壊","お台場株","お台場関連株","お台場関連銘柄","お台場中央連絡橋","お台場銘柄","汚濁防止膜","オットー・ハーン平和賞","オットー・ハーン平和メダル","オットー・ハーン・プライズ",
               "御手盛り","御手盛","お手盛り","汚泥処理施設","オデッセイの夜明け","オデッセイの夜明け作戦","音カメラ","大人の発達障害","お泊りデイ","お泊まりデイ","お泊りデイサービス","お泊まりデイサービス","お友達代行",
               "少女兵","女子受刑者収容施設","女子中高生ケータイ流行語大賞","女子中高生理系進路選択支援事業","オニカマス","オバマケア","オバマドン","オバマノミクス","オバマノミックス","首うきわ","首掛式浮き輪","首掛式乳幼児用浮き輪",
               "首に巻くタイプの浮き輪","オピステル","オフィスアワー","オフィステル","オフィスニート","オフサイトセンター","オフショア市場","お風呂ディスプレイ","オブリーン","オプション価格","オプション料",
               "オヘルネ事件","オペレーションツイスト","オペレーション・ジャパン","オマル･ボルカン･アルガラ","オマール･アルガラ","オマール･ボルカン･アルガラ","面合わせ","面合せ","以経促統","親会社等状況報告書",
               "親子上場","親投資信託","親ファンド","親指の狭窄性腱鞘炎","オランダギルダー","オランド氏","織込み済み","織り込み済み","オリンピック招致","オリンピック招致レース","オリンピック専用レーン",
               "オリンピック追加競技投票","オリンピックレーン","オルキルオト","オルキルオト原子力発電所","オルソ","オルソケラトロジー","オルタナティブ投資","俺俺詐欺","オレオレ詐欺","オレンジ革命","オレンジ警報",
               "オレンジルート","卸売業販売額"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["卸売団地","卸売り団地","卸供給事業者","卸団地","卸配送センター","卸物流センター","卸流通センター","終値","終値関与","終値ベース","オンカロ","オンカロ最終処分場","音楽政治","御嶽山","音波浮揚",
                "オンライン海賊行為阻止法案","O抗原","オーシャンローズ","OCO注文","オーストラリア証券取引所","オータムジャンボ","オータムジャンボ宝くじ","オートドアゼロ","オートパイロット","オートパイロットシステム",
                "オートファジー","オートプシー・イメージング","オーナーキリング","オーファンデバイス","オーファンドラッグ","オーファン・ワークス","オープンES","オープンエントリーシート","オープンガバメント","オープンスカイ",
                "オープンスカイ協定","オープンポジション","オープンリークス","OpenLeaks","オーランチオキトリウム","オール与党","オール与党体質"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["サイアミナーゼ","再エネ","サイエンス","西海フェリー号沈没事故","西海ペリー号沈没事故","災害関係特約","災害関連死","災害救助法","災害公営住宅","災害死亡給付特約","災害障害見舞金","災害弱者","災害時要援護者",
                 "災害弔慰金","災害特約","災害廃棄物","災害派遣医療チーム","災害見舞金","災害見舞い金","災害用伝言ダイヤル","災害リスク","災害割増特約","サイクルシェアリング","再クローニング","債権残高","債券市場",
                 "債権超過国","債権放棄","債券リパーチェス市場","債券レポ市場","債券レポ取引市場","歳月号","再興型インフルエンザ","サイコトキシシティ","最後の抱き線","採算点","最終赤字","最終気配値段",
                 "最終高級実務者会合","再就職監視委","再就職等監視委員会","済州島","最終売買日","最終利益","再生医療安全性確保法","再生医療等安全性確保法","再生医療等の安全性の確保等に関する法律","再生医療法",
                 "再生エネ","再生エネルギー","再生エネルギー特別措置法","再生エネルギー法","再生エネルギー法案","再生可能エネルギー","再生可能エネルギー買い取り法","再生可能エネルギー全量買い取り制度",
                 "再生可能エネルギー特別措置法","再生可能エネルギー特別措置法案","再生可能エネルギーの固定価格買取制度","再生可能エネルギーの固定価格買取り制度","再生可能エネルギーの固定価格買い取り制度",
                 "再生可能エネルギーの全量買取制度"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/ka
        //http://www.weblio.jp/category/business/sngjy/ka/3
        
        wordArray = ["母さん助けて詐欺","母さん助けてサギ","買い上がり","買い圧力","買い一巡","買い一服","飼い犬税","買い埋め","買いオペ","買いオペレーション","買方金利","買い方金利","買方日歩","買い方日歩","開花ホルモン",
                  "海監","海監8002","海外筋","海外市場","海外勢","海外投資家","海外における消費","海外水インフラPPP協議会","海外要因","会計操作","壊憲記念日","改憲手続法","改憲要件","海溝型地震","海溝軸外側",
                  "海溝軸の海側","解雇規制緩和","解雇規制の緩和","開国フォーラム","介護休業給付金","介護休業制度","介護者へのケア","介護認定","介護福祉士・社会福祉士修学資金","介護報酬","介護保険被保険者証",
                  "介護保障保険","介護予防訪問介護","介護予防訪問看護","介護予防訪問入浴介護","介護療養型医療施設","買いサイン","買い下がり","解散総選挙","買い材料","買いシグナル","海嘯罹災地","海嘯罹災地建築取締規則",
                  "海巡01","海上警察権","海上原子力発電所","海上原発","開城工団","開城史跡群","海上予報","介助犬","解除ルール","海神神社の銅造如来立像","海水中の放射性物質","海水中の放射性物質濃度",
                  "海水の放射性物質","海水の放射性物質濃度","海水の放射性物質の濃度","海水の放射性物質量","海水ポンプ電動機","改正温暖化対策法","改製原戸籍抄本","改製原戸籍謄本","改正高年齢者雇用安定法",
                  "改正地球温暖化対策推進法","改正地球温暖化対策法","改正日本輿地路程全図","改正東日本大震災復興特別区域法","改正復興特区法","改正郵政民営化法","改選議席","買い先行","海賊行為の処罰及び海賊行為への対処に関する法律",
                  "海賊行為への対処に関する法律","海賊対処法","買付代金即日徴収","海底ゴミ","海底断層","海底熱水鉱床","買い手掛り","買い手掛かり","買い手がかり","買取仕入れ","買取請求","買いトレンド",
                  "買い長","介入警戒","介入警戒感","介入出尽くし感","解任決議","解任決議案","買い残","下位の化け線","下位のバケ線","下位の陽線五本","開発協力大綱","会派みどりの風","会派離脱","会派離脱願",
                  "会派離脱届","会派離脱問題","買いバイアス","怪物銀河","買いぶら下がり","開放特許","買い持ち","買い戻し","買い物一巡","買物一巡","買い物弱者","買い物難民","買い優勢","海洋温度差発電",
                  "海洋基本計画","海洋警察庁","海洋建設業者","海洋国土","海洋ゴミ","海洋ごみ","海洋酸性化","海洋土木工事業者","買呼値","買い呼値","カイラシュ・サティヤルティ","カイラシュ・サティーヤルティ",
                  "改良型BWR","改良型コンバインドサイクル発電","改良型沸騰軽水冷却水炉","改良型沸騰水型軽水炉","改良型沸騰水型原子炉","改良型沸騰水型炉","楓ちゃん事件","買えないリスク","火炎茸","顔合せ","花王デモ",
                  "花王本社平日デモ","顔見せ外交","価格感度測定法","化学科","化学科部隊","科学技術研究調査","科学捜査研究所","化学・生物兵器事態対応部隊","輝く女性","かがやく女性","夏季賞与",
                  "下気道炎","夏季の軽装運動","夏季ボーナス","家禽ペスト","格上げ","架空計上","架空循環取引","架空循環取り引き","架空循環取引き","架空請求詐欺仲間割れ事件","架空請求詐欺仲間割れリンチ殺人事件",
                  "核拡散防止条約","閣議決定","閣議決定書","閣議における決定","格下げ","格差是正デモ","格差反対デモ","各省庁作業班議会報告書","各省庁作業班報告書","各省版事業仕分け","核心的利益","核セキュリティ",
                  "核セキュリティ・サミット","核セキュリティー","核セキュリティーサミット","客船コスタ・コンコルディア","格付け格上げ","格付け格下げ","格付見通し","格付け見通し","核テロ対策","各党・政府震災対策合同会議",
                  "核ドミノ","閣内不一致","核燃料税","核燃料物質等取扱税","核のない世界","核の闇市場","核廃絶決議案","核反応生成物","核不拡散条約","各府省庁版事業仕分け","核物質","核物質防護","核兵器拡散防止条約",
                  "核兵器不拡散条約","核暴走","革命組織","核問題めぐる6カ国協議","核焼け","格安航空会社","核抑止力","閣僚級","閣僚懇談会","閣僚人事","閣僚懇","閣僚レベル","掛け子","駆け込み天下り","駆け付け警護",
                  "駆けつけ警護","過激派組織IS","影の銀行","影の銀行業務","陰の寄付き坊主","下限価格","下限値段","火口周辺規制","火口立入規制","火口立ち入り規制","下降トレンド","下降率","過酷事故","過去最高値",
                  "過去最安値","鹿児島七ツ島メガソーラー発電","鹿児島メガソーラー発電","葛西臨海公園マグロ大量死","葛西臨海水族園におけるマグロの大量死","葛西臨海水族園のマグロ大量死","葛西臨海水族園マグロ大量死",
                  "葛西臨海水族園マグロ・カツオ大量死","葛西臨海水族館マグロ大量死","傘革命","傘デモ","傘の革命","カザトムプロム","火山性地震","貸株市場","貸株料","樫ガス田","貸出金利","貸出債権","貸出平均残高",
                  "貸出平残","貸出・資金吸収動向","貸出・資金吸収動向等","華春瑩","カジノ株","カジノ関連株","カジノ関連銘柄","カジノ構想","カジノ合法化","カジノ合法化構想","カジノ銘柄","加重議決権制度","加重逃走",
                  "加重逃走罪","加重投票制","加重投票制度","加重表決制","加重票決制","過剰内部被曝","過剰内部被ばく","過剰被曝","過剰流動性相場","加水分解コムギ末グルパール19S","カスカディア地震","春日山原始林",
                  "カスケード地震","粕発電","カス発電","かす発電","霞が関埋蔵金","被仕向け","被仕向","被仕向け銀行","花斉会","花成ホルモン","化石賞","仮設汚染水タンク","仮設集落","仮設住宅","河川法","課税証明書",
                  "風邪症候群","かぜ症候群","風頼みの政党","風レンズ風車","仮装隠蔽行為","科捜研","仮想水","仮想的な地理的境界線","仮想の地理的境界線","加速器駆動未臨界炉","加速償却","加速度償却","家族葬",
                  "過怠金","硬着陸","家宅捜索","肩叩き","カタール液化ガス","課題先進国","カダフィ","カダフィ政権","カダフィ大佐","カダフィ・ムアンマル・ムハンマド・アブミンヤール","カダフィ派","家畜伝染病",
                  "課徴金減免制度","課徴金制度"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["課徴金納付命令","カッザーフィー","勝手TLD","勝手トップレベルドメイン","勝手ドメイン名","カップヌードルおにぎり","カップルカフェ","カップル喫茶","鰹のぼり","滑膜肉腫","家庭内エネルギー管理システム",
                  "家庭の節電対策メニュー","家庭福祉員","家庭用蓄電池","糧券","家電エコポイント","家電エコポイント事務局","家電エコポイント制度","家電エコポイント制度の見直し","家電株","カトリーヌ・サンバパンザ",
                  "可動防波堤","要決定","要指導薬","かに座55e","かに座55番星e","蟹座55番星e","蟹座55e","金余り","金余り相場","金先物","金先物取り引き","カネミ油症","カネミ油症事件","化膿性リンパ節炎",
                  "夏の軽装運動","下ヒゲ","カフェイン汚染","カフェインによる汚染","寡婦控除","寡夫控除","花粉飛散予測","花粉飛散予報","株売り債券買い","株価位置","株価売上高倍率","株価釘付け","株価固定",
                  "株価騰落率","株券不発行制度","株式会社NMKV","株式会社産業革新機構","株式数比例配分方式","株式の相互保有","株式の持合い","株式の持ち合い","株式払込剰余金","株式売買委託手数料","株式売買手数料",
                  "株式報酬型ストックオプション","株式持合い","株式持ち合い","かぶせ線","かぶせ線の上抜き","被せ線の上抜き","カブセ線の上抜き","株高","株高基調","株高連鎖","カブトム","KABUTOM","株睨み",
                  "株主資本コスト","株主総会特別警戒本部","株主損害賠償請求","株主代表訴訟","株主特約店契約","株主特約店制度","神舟九号","株安","株安基調","株安連鎖","カプロシン","可変抗体","壁繋ぎ","壁つなぎ",
                  "下方修正","蒲田第一踏切","蒲田第1踏切","カマッテ","Camatte","カミカゼ・パイロット","上期決算","カミツキガメ","過密なき過疎","雷ナウキャスト","神縄・国府津-松田断層","神縄・国府津-松田断層帯",
                  "神の御教え","神の銀行","上関原子力発電所","上関原発","神誡","カミンズレンジ鉱山","カミンズレンジ鉱床","カミンズレンジレアアース鉱山","カムチョンドンムナマウル","カムランド","亀井新党・反TPP",
                  "仮名取引","亀尾市フッ酸ガス漏れ事故","亀尾フッ化水素酸漏出事故","亀尾フッ酸ガス漏れ事故","亀尾フッ酸漏出事故","貨物検査特措法","貨物検査特別措置法","カラアザール","カラアザール病","韓印CEPA",
                  "カラギャン","韓国軍弾道ミサイル射程距離制限","韓国軍の三軸体制","韓国軍の弾道ミサイルの射程距離制限","韓国海軍次期護衛艦","韓国キムチ検疫免除","韓国キムチの衛生検査免除","韓国コーストガード",
                  "韓国七大宗教","韓国哨戒艦撃沈事件","韓国哨戒艦沈没事件","韓国哨戒艇沈没事件","韓国次期護衛艦","韓国次期フリゲート","韓国弾道ミサイル射程距離制限","韓国弾道ミサイル射程制限","韓国と北朝鮮との銃撃戦",
                  "韓国の旭日旗禁止法案","韓国の旭日旗掲揚禁止法案","韓国の旭日旗使用禁止法案","韓国のサントリーニ","韓国の弾道ミサイル射程距離の制限","韓国の防空識別区域","韓国の防空識別圏","韓国のマチュピチュ",
                  "韓国防空識別圏","韓国旅客船沈没事故","韓中FTA","韓中日新冷戦","カラーギャング","借り株残","カリコム","仮払い法案","カリビアンコミュニティ","カリフォルニア州公務員退職年金基金","カリフォルニア州職員退職年金基金",
                  "カリブ共同体","仮屋根","かりやね","かりゆしウェア","かりゆし姿","カルシウムイメージング法","カルシウム画像化法","カルシウム蛍光指示薬","カタルーニャ国際賞","カルバペネム耐性菌","カルバペネム耐性腸内細菌",
                  "カルパース","加齢黄斑変性","加齢性筋肉減弱症","カレンダーベース市中発行額","過労死防止基本法","カワイイ区","川上統合","川崎病","川下統合","為替介入","為替介入枠","為替差損","為替調整金",
                  "為替睨み","為替変動調整金","為替誘導","蝙蝠外交","かわり雛","変わり雛","完オフ","菅おろし","感音障害","観音寺所蔵観世音菩薩坐像","感音性障害","感音性難聴","感音難聴","カンガルーケア",
                  "カンガルー債","柑橘系魚","柑橘系養殖魚","肝吸虫症","環境株","環境関連株","環境関連銘柄","環境権","環境自動車税","環境センサーネットワーク","環境対応車普及促進対策費補助金","環境物品",
                  "かん口令","カンクン合意","関係会社","完結出生児数","観光キャンペーン","観光特使","観光特別大使","観光特区","漢江の奇跡","鉗口令","箝口令","韓国・インド包括的経済連携協定","韓国キムチの検疫免除",
                  "韓国軍の3軸体制","勧告権","韓国高速鉄道","韓国産キムチの検疫免除","韓国製キムチの検疫免除","韓国7大宗教","看護師等修学資金","関西経済3団体","関西広域機構","関西広域連合","関西州","閑散相場",
                  "乾式キャスク","乾式キャスク貯蔵","乾式金属キャスク","乾式再処理","乾式再処理技術","乾式貯蔵","乾式容器","間質性肺炎","肝ジストマ","肝ジストマ症","勘定科目法","環状交差点","寛仁さま",
                  "環水平アーク","官製談合防止法","官製談合防止法違反","間接強制","間接控除","間接控除法","間接償却","間接水","間接法","感染症集団発生","感染症の集団発生","感染性大腸炎","甘川洞文化村",
                  "完全オフレコ","完全前受制度","完全民営化","簡素な給付措置","肝臓ジストマ"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/ka/10
        
        wordArray = ["環太平洋経済協定",]
        
        ReturnWordArray += wordArray
        
        
        
        return ReturnWordArray

    }
}
