//
//  JijiWord.swift
//  Hassouseisei_ver_2_0
//
//  Created by 岡大輔 on 2015/03/16.
//  Copyright (c) 2015年 岡大輔. All rights reserved.
//

import Foundation

class JijiWordStore: WordStore{
    func returnCaption() -> String{
        return "時事用語"
    }
    
    func ReturningWordArray() -> Array<String>{
        var ReturnWordArray:[String] = []
        
        //http://www.weblio.jp/category/business/sngjy
        
        var wordArray = ["アイアムケンジ","ISD条項","ＩＸＶ","IFO注文","ILOグローバルリポート","アイオリス山","アイサイト","アイサイトカメラ","アイザーウェイ","アイシル","ICT維新ビジョン","ICT教育","アイスカップヌードル",
             "アイスクエイク","アイスバケットチャレンジ","アイスバケツチャレンジ","アイスバーグ・スケーティング・パレス","アイスル","ISIL","アイセック","アイソトープ電池","アイソン彗星","Iターン就農","IWG報告書","IT関連銘柄",
             "アイヌ象徴空間","アイヌ文化象徴空間","アイヌ民族象徴空間","アイヌ民族党","アイヌ民族の共生の象徴となる空間","相乗り衛星","あい乗り衛星","相乗り候補","相乗り小型衛星","相乗り小型副衛星","アイピーシーシー",
             "IPCC","アイボール","i-Ball","アイミーブ","IUU","アイランドリバーサル","アイルワースのモナリザ","アイルワース版モナリザ","アウストラロピテクス・アファレンシス","アウストラロピテクス・セディバ",
             "アウターライズ","アウターライズ地震","アウトパフォーム","アウトブレイク","アウトライト","アウトライト取引","青い森信金","青色LED","青色発光ダイオード","青葉アルコール","青海・台場クロスウォーク",
             "赤色警報","赤警報","赤坂議員宿舎","赤坂衆議院議員宿舎","赤三兵","赤三兵先詰まり","赤三兵思案星","暴対法","暴追放センター","赤字国債","赤ちゃん工場","あかちゃんポスト"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/aa/2
        
        wordArray = ["アカデミー名誉賞","赤髭対象","赤ひげ大賞","赤水図","空き家対策の特別措置法","空き家等適正管理条例","空き家等の適正管理に関する条例","空き家の管理条例","秋学期入学","商い3年","商い三年","秋入学",
            "秋の5連休","秋の園遊会","秋の例大祭","秋葉原無差別殺傷事件","空き家管理条例","空き家対策法","空家等対策の推進に関する特別措置法","アクアトップディスプレイ","アクサ","アクシーズ・ジャパン証券株式会社",
            "アクシーズ・アメリカ","アクセプタンス","アクタ","芥川賞選考委員","アクティブラーニング","アク抜け感","あく抜け感","アクロ研究所","アグザム・インベストメント","アグゼス・アメリカ","アグニ5ミサイル",
            "アグニファイブミサイル","アグニ5","上げ足の差し込み線","上げ三法","上げ過ぎ感","上げ転換","上げトレンド","上げの2つ星","上げの3つ星","上げの二ツ星","上げの二つ星","上げの三ツ星","上げの三つ星",
            "上げ幅","上場投資証券","上場投信","上げ余地","アコード","朝霞公務員宿舎","浅川ダム","朝高","アサド政権","アサハンアルミニウム計画","アサハンアルミニウム事業","アサハン開発事業","アサハン計画",
            "アサハン事業","旭大","旭重","旭中","旭双","旭単","朝安","足場の壁つなぎ","足踏み状態","アジア安全保障会議","アジアカップ","アジア株","アジア株式","アジア競技大会"]
        
        //http://www.weblio.jp/category/business/sngjy/aa/3
        
        ReturnWordArray += wordArray
        
        wordArray = ["アジア競技大会","アジア時間","アジア時間帯","アジア太平洋自由貿易圏","アジア太平洋自由貿易地域","アジア大会","アジア中南米協力フォーラム","アジアビジネスサミット","アジア銘柄","アジアリバランス",
            "アジア・ゲートウェイ構想","アジア・ダウ","紫陽花革命","アジサイ革命","あじさい革命","アジュバントによる自己免疫・炎症性症候群","アジュバント病","アジュバント誘発性自己免疫・炎症性症候群","アスキアの墓",
            "アストゥリアス皇太子賞","アスベストはい","アスペルガー障害","アスペルガー症候群","アスペルガーシンドローム","預り保証金","アセアン株","アセアン株式","アセアン中国FTA","ASEAN+6","ASEAN+3","アセアン・韓国FTA",
            "アセタミプリド","アセットバック証券","アタカマ大型ミリ波サブミリ波干渉計","アタックス","ATACS","アタック・オン・タイタン","新しい人権","新しい政策研究会","新しい普通","新しい歴史教科書をつくる会",
            "アダプティブクルコン","アダプティブクルーズコントロール","アダプト制度","アチェ","アチェ州","圧縮空気機関","圧縮空気車","アッシーシ国防相","アッシーシ第1副首相","斡旋収賄罪","あっせん収賄罪","アップトレンド",
            "アップルウオッチ","アップル関連株","アップル関連銘柄","暑さ指数","圧力鍋爆弾","圧力抑制室","圧力抑制室用貯水タンク","圧力抑制プール","我的夢","あて首線","阿寺断層","アディズ","アディポソーム","アディポネクチン",
            "アディポロン","阿寺断層帯","アトキンソンサイクル","アトサイト","後方かかえ込み2回宙返り3回ひねり","アドバンストコンバインドサイクル発電","穴あきダム","アナカルジン酸","アナカルディック酸"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["アナカルド酸","アニマルロス","アニュアルリポート","アニュアルレポート","アノイリナーゼ","アノニマス・イベロアメリカ","アバスチン","アパルトヘイト","アパルトヘイト政策","アビガン","アビガン錠","アフガニ",
            "アフガニスタン侵攻","アフガニスタン銃乱射事件","アフガニー","アフガン銃乱射事件","アフガン紛争関連資料公開事件","アフガン乱射事件","アフターフォー","アフター4","アフラトキシン","アフリカ開発会議","アフリカ大旱魃",
            "アブソーバ","アブデラズィズ・ブーテフリカ","アブデルアジズ・ブーテフリカ","アブデル・ファタハ・シーシ","アブドルジャリル","アブドルファッターフ・アッ＝シーシー","油券","アブ・サリーム刑務所","アブ・バクル・アル・バグダディ",
            "アブ・バクル・バグダディ","アブー・サリーム刑務所","安倍色","安倍カラー","安倍外交","安倍晋三","安倍ドクトリン","あべのハルカス","アベノミクス","アベノミクス解散","アベノミクス三本の矢","アベノミクス3本の矢",
            "アベノミクス戦略特別区","アベノミクス戦略特区","アベノミクス第4の矢","アベノミクス疲れ","アベノミクス特区","アベノミックス","アベノリスク","アポカリプティックサウンド","アホロートル","アポロ宇宙船",
            "アポロ司令船・機械船","雨傘革命","尼崎JR脱線事故","天下り監視委員会","天下り監視委","天下り禁止","天国から帰った少年","あまサミット 別名：アマサミット","海女サミット","アマゾン税","アマゾン・プライム・エアー",
            "アミロイドβ","アミロイドβ蛋白","アミロイドβタンパク","アミロイドβ蛋白質","アミロイドベータ蛋白","アミロイドベータタンパク","アミロイドベータタンパク質","アミロイドβタンパク質"]
        
        ReturnWordArray += wordArray
        
        
        //http://www.weblio.jp/category/business/sngjy/aa/5
        wordArray = ["アミロイドベータ蛋白質","アミロイドベータプロテイン","アムダ","AMDA","アメイジア","アメイジア大陸","アメリカEU自由貿易協定","アメリカ軍軍属","アメリカ運輸省道路交通安全局","アメリカ欧州連合FTA",
            "アメリカ欧州連合自由貿易協定","アメリカ株","アメリカ株式","アメリカ外交公電Wikileaks流出事件","アメリカ合衆国運輸省道路交通安全局","アメリカ金塊先物相場","アメリカ金融規制改革法","アメリカ軍属","アメリカ鉤虫",
            "アメリカ黒人青年射殺事件","アメリカ国家安全保障局","アメリカ証券業協会","アメリカ時間","アメリカ時間帯","アメリカ同時多発テロ","アメリカナマズ","アメリカ白人警察官による黒人射殺事件","アメリカ銘柄",
            "アメリカライフル協会","アメリカ・韓国間FTA","アメリシウム","アメーバ経営","アユモドキ","新たな国土のグランドデザイン","新たな常態","新たな地域名表示ナンバープレート","新たな電波の活用ビジョンに関する検討チーム",
            "アラビア半島のアルカイダ","アラビア半島のアルカーイダ","アラファト","アラファト議長","粗付加価値","アラブ人街","アラブの春","アラブ街","粗利益率","粗利率","アラル海","露軍グルジア侵攻","アリアン5",
            "アリス・アン・マンロー","アリス・マンロー","アリピプラゾール","アリューシャン列島","アリラン3号","アルカンサ旅団","歩きスマホ専用歩道","歩きスマホ用歩道","アルクチゲニン","アルコール性肝障害",
            "アルコール専売事業","アルゴリズム取引","アルシャバブ","アルジャジーラ","アルストムグリッド","アルセニ・ヤツェニュク","アルセニー・ヤツェニュク","アルバート・ラスカー医学研究賞","アルビン・ロス",
            "アルファシヌクレイン","アルマ","ALMA","アルマ望遠鏡","アルメニア原発","アル・カンサ・ブリゲード","アル・ヌスラ戦線","アレヴァ","アレクサンドル・トゥルチノフ","アレッポ","アレバ"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/aa/6
        
        wordArray = ["アレルギー性肉芽腫性血管炎","アローヘッド","アローワンス","アンギオテンシン2受容体遮断薬","アングレーム国際漫画祭","暗黒エネルギー","暗黒物質","アンシステマティックリスク","安心子ども基金",
             "アンジオテンシンII受容体拮抗薬","アンジオテンシン2受容体拮抗薬","安重根記念館","安重根義士記念館","安重根","アンジュングン記念館","安全資産","安全通貨","安全の鐘","安全保障担当大臣","安全保障担当相",
             "安全保障ダイヤモンド","安全保障のダイアモンド","安全保障法制担当相","安全保障法制担当大臣","安全保障理事会決議1874","安息香酸ナトリウムカフェイン","アンタレスロケット","アンダーパフォーム","アンチGLBT",
             "アンチLGBT","アンチアマゾン法","アンチサテライトウェポン","アンチサテライトミサイル","アンチ菅","アンチバラカ","安哲秀","アンチョルス","アンチ・ダンピング関税","アンドラペセタ","アンドルー王子",
             "アンドロイドガラケー","Androidガラケー","アンナカ","アンネの日記","アンビシャス","アンビシャス市場","アンピンシャ","アンフィレギュリン","アンフィレグリン","アンブレラレボリューション","アンブロークン",
             "アンペア下げ","安保相","安保理改革","安保理決議","アンミス","UNMISS","UNMIS","アンメットメディカルニーズ","安龍福","アンレバードベータ","アンレバードβ","アンワインド","アン・ヨンポク","アークホーン",
             "アースアワー","アートメイク","アートメイク・タトゥー","アーニングサプライズ","アーリーハーベスト","アールオーシー","RO膜","Rce1タンパク質","RJCカーオブザイヤー","RCEP","RDF発電"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/ii
        
        wordArray = ["伊400型","伊400型潜水艦","委員長解任決議","言う吉くん","言うだけ番長","云南地震","イェタグンガス田","家電銘柄","イエメンリアル","イエメンリヤル","イエメンリヤール","家歴書","イエロールート",
              "硫黄島","魚の水域表示","イオン吸着型の鉱床","イオン吸着型のレアアース鉱床","イオン吸着型レアアース鉱床","イオン吸着型鉱床","伊方原子力発電所","伊方原発","伊方発電所","依願退職","行き詰まり線",
              "域内包括的経済連携","イギリスGCHQ","イギリス重大不正捜査局","イギリス政府通信本部","イギリスの政府通信本部","育英資金","いくさの子","いくさの子－織田三郎信長伝－","イクジイ","育児休業基本給付金",
              "育児休業給付金","育児休業者職場復帰給付金","育児用粉ミルク","育鵬社版教科書","育メン","イクメン","イクメンの素","イクランドラコ・アバタル","イクランドラコ・アバター","遺訓統治","イグナリナヴィサギナス原発",
              "イグナリナ原子力発電所","イグニッションスイッチ","イグノーベル賞","イグノーベルプライズ","犠牲祭","イコモス","伊號第四百型潜水艦","鯨資源","諫早湾干拓開門請求訴訟","諫早湾干拓事業訴訟","諫早湾干拓訴訟",
              "イサンドゥク","李相得","イサンドク","石井部隊","石撃ち","石打ち","石撃ち刑","石打ち刑","石撃ちの刑","イシスクソコラグランプリ","石投げの刑","石原グランドチルドレン"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/ii/2
        
        wordArray = ["石原グランドチルドレン","石原グループ","石原慎太郎新党","石原新党","石破茂","異種トレ","異種トレード","石綿肺","維新8策","維新政治塾","維新の会分党","維新の党","維新八策","維新版船中八策","維新分党",
              "異次元金融緩和","維持保証金","イスカンダル作戦","イスカンダルプロジェクト","イスカンダル・バイオプロジェクト","イスカンデル","イスダ","ISDA","イスラミックステート","イスラム学者委員会","イスラム国",
              "イスラム聖戦士血盟団","イスラム・マグレブ諸国のアルカイダ組織","イスラム街","イスラム・マグリブ諸国のアルカイダ組織","イスラム・マグレブ諸国のアルカイダ","イスラム・マグレブ諸国のアルカイダ機構",
              "イスラーム国","イスラーム・マグリブ諸国のアルカイダ組織","イスラーム・マグレブ諸国のアルカイダ組織","出雲氏","出雲国造家","伊勢原断層","伊勢二見メガソーラー光の街","磯焼け","イソリクイリチゲニン",
              "遺族生活資金","板","イタイイタイ病","委託介入","委託仕入れ","委託仕入","委託物流","痛四股名","板状況","痛スイカ","痛Suica","板寄せ方式","イタリア危機","イタリア債務危機","イタリア財政危機",
              "一院制","一月効果","1月効果","1月バロメーター","1区間割引","一国家二制度","一次卸","一次卸業者","一時帰宅同意書"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/ii/3
        
        wordArray = ["一時国有化","一時貯蔵プール","一事不再議","一時亡命","一人別枠方式","一日契約","1年間4学期制","一部執行猶予","一覧払輸出手形買相場","一覧払輸入手形決済相場","一類感染症","一個中國","一個中國原則",
            "一括交付金","一国两制","一国二制度","一国両制","一式双発高等練習機","一式双発高練","1者応札","一斉帰宅","一斉帰宅抑制の基本方針","イッセン・ハブレ","一致DI","一致指数","一致指標","一兆ドル貨幣","一兆ドル硬貨",
            "1兆ドル硬貨","一店一帳合制","イットガール","一般会計総額","一般化社会拠出金","一般勘定","一般教書","一般教書演説","一般気配","一般財団法人","一般社会税","一般社団法人","一般信用取引","一般世帯",
            "一般特恵関税制度","一般特恵制度","一般の地下利用に対し十分に余裕を持った深度への埋設","一般廃棄物処理手数料減免申請書","一般廃棄物処理手数料減免等申請書","一般廃棄物搬入申請書","一般用医薬品",
            "一票の重みの不平等","一票の格差","1票の格差","一本値","遺伝学的検査事業","遺伝学的検査ビジネス","遺伝子組み換え細菌","遺伝子組み換え添加物","遺伝子組み換え微生物","遺伝子検査事業","遺伝子検査ビジネス",
            "遺伝子診断ビジネス","遺伝子治療薬"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/ii/4
        
        wordArray = ["移動式新型ミサイル","移動平均乖離率","移動平均収束拡散指標","移動平均収束拡散法","井戸沢断層","イナビル","委任状争奪戦","委任状闘争","犬肉祭","イヌ肉祭り","犬ジステンパー","いぬジステンパー","犬肉の祭",
            "犬肉の祭り","犬肉祭り","イネ稲熱病菌","イネいもち病菌","居眠り運転防止グッズ","居眠り運転防止装置","居眠り運転防止用品","茨城沖","茨城県沿岸沖合","茨城県沖","茨城県沖合の海域","茨城県の沖合","IFD注文",
            "イブニングセッション","イプシロン","イプシロンロケット","イベントリスク","違法漁業国","違法操業国","違法ドラッグ","違法・無報告・無規制","李明博","イミョンバク","イムノクロマト","イムノクロマトグラフィー",
             "イムノクロマトグラフィー法","イムノクロマト法","イムノトキシン","夢洲大規模太陽光発電所","稲熱病菌","イモチ病菌","イモビカッター","イモビライザーカッター","医薬前駆体","医薬品のインターネット通信販売",
             "医薬品の通信販売","医薬品のネット販売","嫌気売り","イ病","伊四〇〇型","伊四〇〇型潜水艦","イラク戦争の米軍機密文書公開事件","イラク通貨詐欺事件","イラク通貨事件","イラクディナール詐欺事件","イラクとシャームのイスラーム国",
             "イラクとシリアのイスラーム国","イラクとレバントのイスラム国","イラクとレバントのイスラーム国","イラク･シャーム･イスラム国","イラク･シャーム･イスラーム国","イラク･シリア･イスラーム国","イラク・レバントのイスラム国",
             "イラク・レバント・イスラーム国","イラン核開発問題","イラン核問題","イラン経済制裁","イランのウラン濃縮施設","イランの核開発問題","イランの核問題","入り首線","イリューシン78","医療格差","医療観光",
             "医療機関債"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["医療ツーリズム","医療費2025年問題","医療費の2025年問題","医療費の自己負担","医療用に準じたカテゴリーの医薬品","威力業務妨害","威力業務妨害罪","イルカ追込み猟","イルカ追い込み猟","イルカ追込み漁",
             "イルカ追い込み漁","イルワン","入替売買","入れ墨メイク","イレッサ","イレッサ訴訟","磐余池","飲食物摂取制限","飲食物摂取制限に関する指標","インジェクション牛肉","インジェクション肉","インジェクションビーフ",
             "隕石と彗星の違い","インセル型タッチパネル","インタゲ政策","インターナショナルエイズワクチンイニシアチブ","インターナショナルスワップデリバティブ協会","インターナショナル・スワップ・アンド・デリバティブ・アソシエーション",
             "インターナルポンプ","インターネット売上税","インターネット売上げ税","インターネット売り上げ税","インターネット監視法","インターネット関連株","インターネット関連銘柄","インターネット選挙運動解禁法案",
             "インターネット選挙解禁","インターネットセールス税","インターネットセールスタックス","インターネット等の適正利用に係る指導事例・活用手引","インターネット銘柄","インターネット予備校",
            "インターネットを利用した選挙運動を解禁する公職選挙法改正案","インターバンク直結方式","インターポールノーティス","インターロイキン33","インテリグリッド","インテリジェントグリッド","インテリジェント電源",
            "インテリジェントビル","インテンス・パルス・ライト脱毛","インテークマニホールド","インディ","インディ紙","インディー","インディー紙","インデペンデント","インデペンデント紙","インド高速鉄道",
            "インド人民党","インドの高速鉄道","インドの常任理事国入り","インド洋大津波","陰の陰はらみ","陰の大引け坊主","陰のコマ","陰の丸坊主","陰の陽はらみ","陰の寄り付き坊主","インパクトファクター",
            "インビザライン","インビザライン矯正","インフラバッテリー"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/ii/6
        
        wordArray = ["インフルエンザA型ウィルス","インフルエンザAウィルス","インフルエンザ菌b型ワクチン","インフルエンザ警報","インフルエンザ注意報","インフルエンザの流行発生警報","インフル警報","インフレ圧力","インフレ高進",
              "インフレ指数連動債","インフレターゲット政策","インフレ率","インフレ率目標政策","インフレ連動債","インフレーション宇宙論","インフレーション率","インフレーション理論","インホイールモーター","インマニ",
              "隠密介入","インレットマニホールド","陰連","イ・ジェソク","イ・スンマンライン","イーエフウィング","efWING","EMDR","ELSI","E型肝炎","EGF受容体","イースター航空","イースタージェット",
              "ETN","ETF","EVネオ","EU韓FTA","EU大統領","イールドレシオ"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["ウィメノミクス","ウィリアム・モーナー","ウィルス供用","ウィルス性食中毒","ウィルチェアーラグビー","ウィンドパーク","ウィンドファーム","ウィンドレンズ風車","ウィークオーダー","We the People",
               "ウイグル人労働者襲撃事件","ウイルス性食中毒","微山鉱床","ウェイシャン鉱床","ウェスチングハウス","ウェスティングハウス","ウェスティングハウス・エレクトリック","ウェストナイル熱","ウェリントン市場",
               "ウェルシュ菌","ウェルスマネジメント商品","ウェルドニッヒ・ホフマン病","ウェーバー・コケイン症候群","ウェーブライダー","上野東京ライン","上ヒゲ","植物石","植物新品種保護国際同盟条約","ウォッチコン",
               "ウォッチコンディション","ウォルソン原子力発電所","月城原発","ウォルソン原発","ウォルフソン経済学賞","ウォルフソン賞","ウォン高","ウォン安","ウォーターゲート事件","ウォーターゲート・スキャンダル",
               "ウォームビズ","ウォール街デモ","ウォール・ストリート・ジャーナル","ウォール・ストリート・ジャーナル紙","迂回寄付","迂回献金","う回献金","うかい献金","ウクライナグリヴナ","ウクライナグリブナ",
               "ウクライナ暫定政権","ウクライナ祖国党","ウクライナフリヴナ","ウクライナフリヴニャ","ウクライナフリブナ","ウクライナフリブニャ","ウクライナ民主化革命","ウクライナ連合野党・祖国","受取手付金",
               "于山島","牛トレーサビリティ法","失われた世代","牛のオーナー制度","牛の個体識別のための情報の管理及び伝達に関する特別措置法","蛆虫療法","ウジ虫療法","うじ虫療法","羅老","歌会始","うたかいはじめ",
               "歌会始の儀","歌御会始","宇宙活動行動規範","宇宙クラブ","宇宙ゴミ","宇宙ごみ","宇宙ごみ掃除衛星","宇宙ごみ掃除機","宇宙ジェット","宇宙船ドラゴン"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["宇宙太陽光発電","宇宙発射システム","宇宙帆","宇宙マウス","ウップス","鬱陵島","台日漁業委員会","台日漁業協定","台日民間投資協議","海上データセンター","海上土木工事業者","海上配備型迎撃ミサイルSM3",
                "海上立地原子力発電所","海上連合2012","ウナギ完全養殖","ウナギの完全養殖","頷き症候群","頷き病","うなずき病","海底ごみ","海底に沈んだゴミ","海底のゴミ","右尿管結石","うねり取り","右派セクター",
                "産活法","産革機構","うまい米","甘川洞","甘川文化村","海ゴミ","海ごみ","海の汚染水","海の聖域","海の聖域構想","梅北","浦底断層","裏帳簿","心リハ","ウラン燃料","ウラン濃縮施設","売上原価率",
                "売上債権回転率","売上高営業利益率","売上高経常利益率","売上高広告費比率","売上高総利益率","売上高当期純利益率","売上高連単倍率","売り圧力","売り一巡","売り一服","売り埋め","売りオペ","売りオペレーション",
                 "売り買い拮抗","売り買い交錯","売り買いまちまち","売りサイン"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["売り下がり","売り材料","売り残","売りシグナル","売り先行","売出し","売出し3年","売り出し3年","売出株","売出株式","売出し三年","売り出し三年","売り手掛り","売り手掛かり","売り手がかり",
                "売りトレンド","売り長","売りバイアス","売り本尊","売り戻し","売物一巡","売り物一巡","売り優勢","売呼値","売り呼値","閏秒","乙支フリーダムガーディアン","ウルチフリーダムガーディアン",
                "乙支フリーダムガーディアン演習","ウルトラクールビズ","ウルバッハ・ビーテ病","ウルバッハ・ヴィーテ病","ウルフ賞","ウルルン島","ウルルンド","売れないリスク","上影陰線","上影陽線","上書権",
                "上書き権","上抜け","上値遊び","上値固め","上値切下げ","上値切下","上値切り下げ","上値限定","上値めど","上値模索","上値揉み合い","上値もみ合い","上値余地","上放れ陰線","上放れタスキ",
                "上ひげ","上振れ要因","上寄り陽引け","ウンウントリウム","運賃改定","運動器症候群","運動誘発性肺出血","雲南・四川省の境の地震","雲南省地震","雲南省地震 別名：中国雲南省地震"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["雲南省と四川省の境の地震","雲南地震","雲南・四川省境の地震","雲母橄欖岩","運用レポート","ヴァリャーグ","ヴァン","ヴァーチャルウォーター","ヴィクトル・ヤヌコヴィッチ","ヴィクトル・ヤヌコーヴィチ",
                 "ヴィクラント","ヴィサギナス原子力発電所","ヴィサギナス原発","ヴィシェグラード4ヵ国","ヴィシェグラードグループ","ヴィシェグラードフォー","ヴィシェグラード4","ヴィークトル・フェードロヴィチ・ヤヌコーヴィチ",
                 "ヴィークトル・ヤヌコヴィッチ","ヴィークトル・ヤヌコビッチ","ヴィークトル・ヤヌコーヴィチ","ヴィースキャン","Vscan","ヴィーダ湖","ウーパールーパー","ウーマノミクス"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["エアアジア","エアアジア・ジャパン","エアカウンター","エアコンマット","エア断震","エアバスA380","エアバスA380機","エア免震","エア・シーバトル","永久メイク","営業外損益","営業外利益","営業損益",
                 "営業利益率","英国GCHQ","英国歳入税関庁","英国人女性殺害事件","英国政府通信本部","英国の政府通信本部","英重大不正捜査局","エイジングストレス","エイズ予防ワクチン","エイズワクチン","衛星打ち上げビジネス",
                 "衛星攻撃兵器","HSBC資金洗浄問題","H3ロケット","H断層系","H2B","H1N1亜型ウィルス","営農型発電設備","APEC閣僚会議","APEC首脳会議","江衛II型フリゲート","江衛II型フリゲート艦","液化天然ガスプラント",
                 "液状化危険度マップ","液状化マップ","液状化予測図","エキゾチック通貨","エキゾーストマニホールド","益出し","益だし","益出し一巡","益出し売却","エキマニ","エクイティリスクプレミアム","エクオール",
                 "エクササイズ・マラバール","EX-IC","エクスプレスIC","エクソフィアラ","エコウィル","エコカー補助金","エコ玩具","エコキュート","エコジョーズ","エコセメント","エコテロリズム","エコノミスト","エコノミスト紙",
                 "エコノミック・アウトルック","エコノモ脳炎","エコピア","ECOPIA","エコプロダクツ展","エコポイント","エコポイント事業","エコポイント事務局"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["エコポイントの活用によるグリーン家電普及促進事業","エコルミ","エコーネット","エシカルファンド","エジプトCASE30","エジプトCASE30指数","エジプトEGX30","エジプトEGX30種指数","エジプトEGX30指数",
                  "エジプトEGX30種","エジプト新憲法案","S&P 500種株価指数","SNH48","SFTSウィルス","SM-3","Sチップ","ST倍率","エチゼンクラゲ","越境汚染","越境大気汚染","エックス線自由電子レーザー","エックスバンドレーダー",
            "Xバンドレーダー","越波","越流浸食","エトナ火山","エトナ山","江戸っ子1号","エドワード・ジョセフ・スノーデン","エドワード・スノーデン","エナジードリンク","N95微粒子マスク","NTT分社化","NT倍率",
            "NDD","N700A","エネファーム","エネブライト","エネルギー基本計画","エネルギー収支比","エネルギー消費機器","エネルギー政策","エネルギー地産地消","エネルギーの地産地消","エネルギーペイバックタイム",
            "エネルギー・スマートコミュニティ・イニシアティブ","エヒメアイト","愛媛閃石","エビリファイ","エピオルニス","FX取引規制","エプスタインバーウイルス感染症","エプスタインバールウィルス","エプスタインバールウイルス感染症",
            "エボラウィルス","エボラウィルス感染症","エボラウィルス疾患","エボラウィルス病気","エボラウイルス","エボラウイルス感染症","エボラウイルス疾患","エボラウイルス病","エボラ出血熱","エボラ出血熱と闘う人たち",
            "エボラと闘う人たち","エボラ熱","エボラファイター","エボラファイターズ","MNPインセンティブ"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["MFグローバルFXA証券","MFグローバル・ホールディングス","MQ-4Cトライトン","M細胞","エメラルドエース","えらぼーと","エリア社員","エリザベスタワー","エリザベス塔","エリック・ベッチグ","エリベルト・ラスカノ",
             "LNG船","エルシニア","エルシニア菌","エルシニア細菌","エルシニア属菌","エルシー","エルジシュ","エルジュジュ","LGBT","Ｌ0系","LT貿易","エルトゥルル号","エルトゥールル号","エルドアン","エルドアン首相",
             "エルニーニョ","エルニーニョ現象","LPG車","エルベグドルジ","エルベグドルジ氏","エルベグドルジ大統領","エルラッド","エルラッド","エレファントバード","エロモナス・ハイドロフィラ","円売り介入",
             "円売り協調介入","円売り地合い","円売りトレンド","円売りドル買い","円売り・ドル買い介入","円売り・ドル買い協調介入","円貨建外債","塩化ビニルモノマー","塩化ビニールモノマー","猿害","円買い地合い",
             "円買いトレンド","円キャリー取引","円キャリートレード","円急騰","円急落","遠距離大量送水システム","円債","円サイド","塩酸ラクトパミン","円借款","円ショート","遠日点","煙草相談員","円相場",
             "円建資産","エンタメ流行語","円高圧力","円高介入","円高株安"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["円高為替介入","円高関連倒産","円高基調","円高地合い","円高総合対策","円高相場","円高対応緊急ファシリティ","円高対策","円高倒産","円高ドル安","円高ファシリティ","円高ユーロ安","円建て外債","円建て資産",
             "円建て借款","遠地地震","エンテロウイルス","エンテロウイルス71","エンテロウイルス71型","エンディングノート","円投/ドル転","エントモファジー","円独歩高","円独歩安","円売介入","円売・ドル買介入","塩ビモノマー",
             "延坪島","延坪島事件","煙霧","円安圧力","円安介入","円安株高","円安為替介入","円安基調","円安地合い","円安相場","円安ドル高","円安ユーロ高","円ロング","ARF","ASIA症候群","ALSマウス","AAA",
             "Aa3","AAプラス","エース級種牛","Aトレイン"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["小1問題","追込み猟","追い込み猟","追い込み漁","美味しんぼ","「美味しんぼ」鼻血問題","オイルフェンス","オイルボール","王位継承権","応援警察官","応援融通","応急仮設住宅","応急危険度判定","応急危険度判定士",
              "応急組立橋","応急組み立て橋","扇島太陽光発電所","黄金の3年","黄金の72時間","黄金の三年","黄金の三年間","黄金の3年間","特買い","特商","特商法","欧州安全保障協力機構","欧州安定メカニズム","欧州安保協力会議",
              "欧州ウナギ","欧州うなぎ","欧州加圧水型原子炉","欧州株","欧州株式","欧州韓国FTA","欧州共同債券","欧州金融安定化基金","欧州金融安定化債","欧州金融安定基金","欧州金融安定基金債","欧州金融安定ファシリティ",
              "欧州金融安定ファシリティ債","欧州金融安定ファシリティー","欧州金融危機","欧州原子力共同体","欧州債券機関","欧州債務危機","欧州債務危機問題","欧州時間","欧州時間帯","欧州ソブリン危機","欧州ダウ","欧州中核国",
              "欧州馬肉問題","欧州広場","欧州ミサイル防衛","欧州銘柄","欧州理事会議長","欧州連合大統領","欧州連合統計局","欧州連合理事会議長","黄綬褒章","往復外交","欧米株","欧米株式","欧米銘柄","オウム真理教",
              "王立軍米総領事館駆け込み事件","王立軍亡命未遂事件","王立軍事件","大飯原発再稼働","大飯原発再稼働問題"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["狼男ゲーム","大川小津波訴訟","大川小学校訴訟","大川小訴訟","大型台風","大型ハドロンコライダ","大型ハドロン衝突型加速器","大型浮体式構造物","大型放射光施設","大型リチウムイオン蓄電池","大型リチウムイオン電池",
               "大型リチウムイオン二次電池","大口取り引き","大蔵省担当者","大口売り","大口買い","大口取引","大口取引き","大阪W選","大阪W選挙","オオサカアイト","大阪維新の会","大阪駅北地区","大阪広域水道企業団",
               "大阪市客引き行為適正化条例","大阪市客引き行為等の適正化に関する条例","大阪市客引き行為の適正化条例","大阪市客引き条例","大阪市職員の入れ墨問題","大阪消防庁","大阪石","大阪ダブル選","大阪ダブル選挙",
               "大阪都","大阪都構想","大阪版学力テスト","大阪版広域連合構想","大阪府職員基本条例","大隅海峡","大隅良典","大つけ麺博","大手銀","大手銀行","大手町温泉","大花水金梅","大媽","大幅続伸","大幅続落",
               "大幅反発","大幅揉合い","大幅揉合","大幅揉み合い","大幅もみ合い","大反魂草","大間原子力発電所","大間原発","大室ダシ","大飯F-6断層","大飯原発F-6断層","大飯発電所敷地内F-6断層","大飯発電所敷地内F-6破砕帯",
               "大谷石","公の秩序又は善良の風俗に反する事項を目的とする法律行為","大揺れ度","岡山石","オカヤマライト","オガララ帯水層","沖縄キズナ宣言","沖縄基地負担軽減策","沖縄密約","オクサンドル・トゥルチノフ",
               "屋内退避圏","オクラホマ竜巻","オクラホマトルネード","送り付け詐欺","送りつけ詐欺","送り付け商法","送りつけ商法","お化粧買い","お米の放射性物質検査","オサート","オサート・オルソケラトロジー","小沢ガールズ",
               "小澤の不等式","押し上げ介入","押し買い規制","押し買い","押し付け販売","押しのけ効果","押しは空まで","押し目買い","押目待ちに押目なし","押し目待ちに押し目なし","押目待ちの押目なし","押し目待ちの押し目なし",
               "汚職指数","オシレーター系","オシレーター系指標","オスグッド病","オスグッド・シュラッター症候群","オスグッド・シュラッター病","オスグッド・シュラッテル病","オスプレイ","オスプレイ搬入計画","オスプレイ横田基地配備",
               "オスプレイ横田配備","オスロ事件","オセアニア株","オセアニア株式","オセアニア市場","オセアニア通貨","オセアニア銘柄","おせち問題","汚染石","汚染疑い牛","汚染疑い牛肉","汚染疑いの牛肉","汚染がれき",
               "汚染砕石","汚染樹皮","汚染水","汚染水の海への放出","汚染水の海洋への放出","汚染水の海洋放出","汚染水の浄化システム","汚染米水田","汚染マップ","遅行指数","オゾン層破壊"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["オゾン層の破壊","オゾン層破壊","お台場株","お台場関連株","お台場関連銘柄","お台場中央連絡橋","お台場銘柄","汚濁防止膜","オットー・ハーン平和賞","オットー・ハーン平和メダル","オットー・ハーン・プライズ",
               "御手盛り","御手盛","お手盛り","汚泥処理施設","オデッセイの夜明け","オデッセイの夜明け作戦","音カメラ","大人の発達障害","お泊りデイ","お泊まりデイ","お泊りデイサービス","お泊まりデイサービス","お友達代行",
               "少女兵","女子受刑者収容施設","女子中高生ケータイ流行語大賞","女子中高生理系進路選択支援事業","オニカマス","オバマケア","オバマドン","オバマノミクス","オバマノミックス","首うきわ","首掛式浮き輪","首掛式乳幼児用浮き輪",
               "首に巻くタイプの浮き輪","オピステル","オフィスアワー","オフィステル","オフィスニート","オフサイトセンター","オフショア市場","お風呂ディスプレイ","オブリーン","オプション価格","オプション料",
               "オヘルネ事件","オペレーションツイスト","オペレーション・ジャパン","オマル･ボルカン･アルガラ","オマール･アルガラ","オマール･ボルカン･アルガラ","面合わせ","面合せ","以経促統","親会社等状況報告書",
               "親子上場","親投資信託","親ファンド","親指の狭窄性腱鞘炎","オランダギルダー","オランド氏","織込み済み","織り込み済み","オリンピック招致","オリンピック招致レース","オリンピック専用レーン",
               "オリンピック追加競技投票","オリンピックレーン","オルキルオト","オルキルオト原子力発電所","オルソ","オルソケラトロジー","オルタナティブ投資","俺俺詐欺","オレオレ詐欺","オレンジ革命","オレンジ警報",
               "オレンジルート","卸売業販売額"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["卸売団地","卸売り団地","卸供給事業者","卸団地","卸配送センター","卸物流センター","卸流通センター","終値","終値関与","終値ベース","オンカロ","オンカロ最終処分場","音楽政治","御嶽山","音波浮揚",
                "オンライン海賊行為阻止法案","O抗原","オーシャンローズ","OCO注文","オーストラリア証券取引所","オータムジャンボ","オータムジャンボ宝くじ","オートドアゼロ","オートパイロット","オートパイロットシステム",
                "オートファジー","オートプシー・イメージング","オーナーキリング","オーファンデバイス","オーファンドラッグ","オーファン・ワークス","オープンES","オープンエントリーシート","オープンガバメント","オープンスカイ",
                "オープンスカイ協定","オープンポジション","オープンリークス","OpenLeaks","オーランチオキトリウム","オール与党","オール与党体質"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["サイアミナーゼ","再エネ","サイエンス","西海フェリー号沈没事故","西海ペリー号沈没事故","災害関係特約","災害関連死","災害救助法","災害公営住宅","災害死亡給付特約","災害障害見舞金","災害弱者","災害時要援護者",
                 "災害弔慰金","災害特約","災害廃棄物","災害派遣医療チーム","災害見舞金","災害見舞い金","災害用伝言ダイヤル","災害リスク","災害割増特約","サイクルシェアリング","再クローニング","債権残高","債券市場",
                 "債権超過国","債権放棄","債券リパーチェス市場","債券レポ市場","債券レポ取引市場","歳月号","再興型インフルエンザ","サイコトキシシティ","最後の抱き線","採算点","最終赤字","最終気配値段",
                 "最終高級実務者会合","再就職監視委","再就職等監視委員会","済州島","最終売買日","最終利益","再生医療安全性確保法","再生医療等安全性確保法","再生医療等の安全性の確保等に関する法律","再生医療法",
                 "再生エネ","再生エネルギー","再生エネルギー特別措置法","再生エネルギー法","再生エネルギー法案","再生可能エネルギー","再生可能エネルギー買い取り法","再生可能エネルギー全量買い取り制度",
                 "再生可能エネルギー特別措置法","再生可能エネルギー特別措置法案","再生可能エネルギーの固定価格買取制度","再生可能エネルギーの固定価格買取り制度","再生可能エネルギーの固定価格買い取り制度",
                 "再生可能エネルギーの全量買取制度"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/ka
        //http://www.weblio.jp/category/business/sngjy/ka/3
        
        wordArray = ["母さん助けて詐欺","母さん助けてサギ","買い上がり","買い圧力","買い一巡","買い一服","飼い犬税","買い埋め","買いオペ","買いオペレーション","買方金利","買い方金利","買方日歩","買い方日歩","開花ホルモン",
                  "海監","海監8002","海外筋","海外市場","海外勢","海外投資家","海外における消費","海外水インフラPPP協議会","海外要因","会計操作","壊憲記念日","改憲手続法","改憲要件","海溝型地震","海溝軸外側",
                  "海溝軸の海側","解雇規制緩和","解雇規制の緩和","開国フォーラム","介護休業給付金","介護休業制度","介護者へのケア","介護認定","介護福祉士・社会福祉士修学資金","介護報酬","介護保険被保険者証",
                  "介護保障保険","介護予防訪問介護","介護予防訪問看護","介護予防訪問入浴介護","介護療養型医療施設","買いサイン","買い下がり","解散総選挙","買い材料","買いシグナル","海嘯罹災地","海嘯罹災地建築取締規則",
                  "海巡01","海上警察権","海上原子力発電所","海上原発","開城工団","開城史跡群","海上予報","介助犬","解除ルール","海神神社の銅造如来立像","海水中の放射性物質","海水中の放射性物質濃度",
                  "海水の放射性物質","海水の放射性物質濃度","海水の放射性物質の濃度","海水の放射性物質量","海水ポンプ電動機","改正温暖化対策法","改製原戸籍抄本","改製原戸籍謄本","改正高年齢者雇用安定法",
                  "改正地球温暖化対策推進法","改正地球温暖化対策法","改正日本輿地路程全図","改正東日本大震災復興特別区域法","改正復興特区法","改正郵政民営化法","改選議席","買い先行","海賊行為の処罰及び海賊行為への対処に関する法律",
                  "海賊行為への対処に関する法律","海賊対処法","買付代金即日徴収","海底ゴミ","海底断層","海底熱水鉱床","買い手掛り","買い手掛かり","買い手がかり","買取仕入れ","買取請求","買いトレンド",
                  "買い長","介入警戒","介入警戒感","介入出尽くし感","解任決議","解任決議案","買い残","下位の化け線","下位のバケ線","下位の陽線五本","開発協力大綱","会派みどりの風","会派離脱","会派離脱願",
                  "会派離脱届","会派離脱問題","買いバイアス","怪物銀河","買いぶら下がり","開放特許","買い持ち","買い戻し","買い物一巡","買物一巡","買い物弱者","買い物難民","買い優勢","海洋温度差発電",
                  "海洋基本計画","海洋警察庁","海洋建設業者","海洋国土","海洋ゴミ","海洋ごみ","海洋酸性化","海洋土木工事業者","買呼値","買い呼値","カイラシュ・サティヤルティ","カイラシュ・サティーヤルティ",
                  "改良型BWR","改良型コンバインドサイクル発電","改良型沸騰軽水冷却水炉","改良型沸騰水型軽水炉","改良型沸騰水型原子炉","改良型沸騰水型炉","楓ちゃん事件","買えないリスク","火炎茸","顔合せ","花王デモ",
                  "花王本社平日デモ","顔見せ外交","価格感度測定法","化学科","化学科部隊","科学技術研究調査","科学捜査研究所","化学・生物兵器事態対応部隊","輝く女性","かがやく女性","夏季賞与",
                  "下気道炎","夏季の軽装運動","夏季ボーナス","家禽ペスト","格上げ","架空計上","架空循環取引","架空循環取り引き","架空循環取引き","架空請求詐欺仲間割れ事件","架空請求詐欺仲間割れリンチ殺人事件",
                  "核拡散防止条約","閣議決定","閣議決定書","閣議における決定","格下げ","格差是正デモ","格差反対デモ","各省庁作業班議会報告書","各省庁作業班報告書","各省版事業仕分け","核心的利益","核セキュリティ",
                  "核セキュリティ・サミット","核セキュリティー","核セキュリティーサミット","客船コスタ・コンコルディア","格付け格上げ","格付け格下げ","格付見通し","格付け見通し","核テロ対策","各党・政府震災対策合同会議",
                  "核ドミノ","閣内不一致","核燃料税","核燃料物質等取扱税","核のない世界","核の闇市場","核廃絶決議案","核反応生成物","核不拡散条約","各府省庁版事業仕分け","核物質","核物質防護","核兵器拡散防止条約",
                  "核兵器不拡散条約","核暴走","革命組織","核問題めぐる6カ国協議","核焼け","格安航空会社","核抑止力","閣僚級","閣僚懇談会","閣僚人事","閣僚懇","閣僚レベル","掛け子","駆け込み天下り","駆け付け警護",
                  "駆けつけ警護","過激派組織IS","影の銀行","影の銀行業務","陰の寄付き坊主","下限価格","下限値段","火口周辺規制","火口立入規制","火口立ち入り規制","下降トレンド","下降率","過酷事故","過去最高値",
                  "過去最安値","鹿児島七ツ島メガソーラー発電","鹿児島メガソーラー発電","葛西臨海公園マグロ大量死","葛西臨海水族園におけるマグロの大量死","葛西臨海水族園のマグロ大量死","葛西臨海水族園マグロ大量死",
                  "葛西臨海水族園マグロ・カツオ大量死","葛西臨海水族館マグロ大量死","傘革命","傘デモ","傘の革命","カザトムプロム","火山性地震","貸株市場","貸株料","樫ガス田","貸出金利","貸出債権","貸出平均残高",
                  "貸出平残","貸出・資金吸収動向","貸出・資金吸収動向等","華春瑩","カジノ株","カジノ関連株","カジノ関連銘柄","カジノ構想","カジノ合法化","カジノ合法化構想","カジノ銘柄","加重議決権制度","加重逃走",
                  "加重逃走罪","加重投票制","加重投票制度","加重表決制","加重票決制","過剰内部被曝","過剰内部被ばく","過剰被曝","過剰流動性相場","加水分解コムギ末グルパール19S","カスカディア地震","春日山原始林",
                  "カスケード地震","粕発電","カス発電","かす発電","霞が関埋蔵金","被仕向け","被仕向","被仕向け銀行","花斉会","花成ホルモン","化石賞","仮設汚染水タンク","仮設集落","仮設住宅","河川法","課税証明書",
                  "風邪症候群","かぜ症候群","風頼みの政党","風レンズ風車","仮装隠蔽行為","科捜研","仮想水","仮想的な地理的境界線","仮想の地理的境界線","加速器駆動未臨界炉","加速償却","加速度償却","家族葬",
                  "過怠金","硬着陸","家宅捜索","肩叩き","カタール液化ガス","課題先進国","カダフィ","カダフィ政権","カダフィ大佐","カダフィ・ムアンマル・ムハンマド・アブミンヤール","カダフィ派","家畜伝染病",
                  "課徴金減免制度","課徴金制度"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["課徴金納付命令","カッザーフィー","勝手TLD","勝手トップレベルドメイン","勝手ドメイン名","カップヌードルおにぎり","カップルカフェ","カップル喫茶","鰹のぼり","滑膜肉腫","家庭内エネルギー管理システム",
                  "家庭の節電対策メニュー","家庭福祉員","家庭用蓄電池","糧券","家電エコポイント","家電エコポイント事務局","家電エコポイント制度","家電エコポイント制度の見直し","家電株","カトリーヌ・サンバパンザ",
                  "可動防波堤","要決定","要指導薬","かに座55e","かに座55番星e","蟹座55番星e","蟹座55e","金余り","金余り相場","金先物","金先物取り引き","カネミ油症","カネミ油症事件","化膿性リンパ節炎",
                  "夏の軽装運動","下ヒゲ","カフェイン汚染","カフェインによる汚染","寡婦控除","寡夫控除","花粉飛散予測","花粉飛散予報","株売り債券買い","株価位置","株価売上高倍率","株価釘付け","株価固定",
                  "株価騰落率","株券不発行制度","株式会社NMKV","株式会社産業革新機構","株式数比例配分方式","株式の相互保有","株式の持合い","株式の持ち合い","株式払込剰余金","株式売買委託手数料","株式売買手数料",
                  "株式報酬型ストックオプション","株式持合い","株式持ち合い","かぶせ線","かぶせ線の上抜き","被せ線の上抜き","カブセ線の上抜き","株高","株高基調","株高連鎖","カブトム","KABUTOM","株睨み",
                  "株主資本コスト","株主総会特別警戒本部","株主損害賠償請求","株主代表訴訟","株主特約店契約","株主特約店制度","神舟九号","株安","株安基調","株安連鎖","カプロシン","可変抗体","壁繋ぎ","壁つなぎ",
                  "下方修正","蒲田第一踏切","蒲田第1踏切","カマッテ","Camatte","カミカゼ・パイロット","上期決算","カミツキガメ","過密なき過疎","雷ナウキャスト","神縄・国府津-松田断層","神縄・国府津-松田断層帯",
                  "神の御教え","神の銀行","上関原子力発電所","上関原発","神誡","カミンズレンジ鉱山","カミンズレンジ鉱床","カミンズレンジレアアース鉱山","カムチョンドンムナマウル","カムランド","亀井新党・反TPP",
                  "仮名取引","亀尾市フッ酸ガス漏れ事故","亀尾フッ化水素酸漏出事故","亀尾フッ酸ガス漏れ事故","亀尾フッ酸漏出事故","貨物検査特措法","貨物検査特別措置法","カラアザール","カラアザール病","韓印CEPA",
                  "カラギャン","韓国軍弾道ミサイル射程距離制限","韓国軍の三軸体制","韓国軍の弾道ミサイルの射程距離制限","韓国海軍次期護衛艦","韓国キムチ検疫免除","韓国キムチの衛生検査免除","韓国コーストガード",
                  "韓国七大宗教","韓国哨戒艦撃沈事件","韓国哨戒艦沈没事件","韓国哨戒艇沈没事件","韓国次期護衛艦","韓国次期フリゲート","韓国弾道ミサイル射程距離制限","韓国弾道ミサイル射程制限","韓国と北朝鮮との銃撃戦",
                  "韓国の旭日旗禁止法案","韓国の旭日旗掲揚禁止法案","韓国の旭日旗使用禁止法案","韓国のサントリーニ","韓国の弾道ミサイル射程距離の制限","韓国の防空識別区域","韓国の防空識別圏","韓国のマチュピチュ",
                  "韓国防空識別圏","韓国旅客船沈没事故","韓中FTA","韓中日新冷戦","カラーギャング","借り株残","カリコム","仮払い法案","カリビアンコミュニティ","カリフォルニア州公務員退職年金基金","カリフォルニア州職員退職年金基金",
                  "カリブ共同体","仮屋根","かりやね","かりゆしウェア","かりゆし姿","カルシウムイメージング法","カルシウム画像化法","カルシウム蛍光指示薬","カタルーニャ国際賞","カルバペネム耐性菌","カルバペネム耐性腸内細菌",
                  "カルパース","加齢黄斑変性","加齢性筋肉減弱症","カレンダーベース市中発行額","過労死防止基本法","カワイイ区","川上統合","川崎病","川下統合","為替介入","為替介入枠","為替差損","為替調整金",
                  "為替睨み","為替変動調整金","為替誘導","蝙蝠外交","かわり雛","変わり雛","完オフ","菅おろし","感音障害","観音寺所蔵観世音菩薩坐像","感音性障害","感音性難聴","感音難聴","カンガルーケア",
                  "カンガルー債","柑橘系魚","柑橘系養殖魚","肝吸虫症","環境株","環境関連株","環境関連銘柄","環境権","環境自動車税","環境センサーネットワーク","環境対応車普及促進対策費補助金","環境物品",
                  "かん口令","カンクン合意","関係会社","完結出生児数","観光キャンペーン","観光特使","観光特別大使","観光特区","漢江の奇跡","鉗口令","箝口令","韓国・インド包括的経済連携協定","韓国キムチの検疫免除",
                  "韓国軍の3軸体制","勧告権","韓国高速鉄道","韓国産キムチの検疫免除","韓国製キムチの検疫免除","韓国7大宗教","看護師等修学資金","関西経済3団体","関西広域機構","関西広域連合","関西州","閑散相場",
                  "乾式キャスク","乾式キャスク貯蔵","乾式金属キャスク","乾式再処理","乾式再処理技術","乾式貯蔵","乾式容器","間質性肺炎","肝ジストマ","肝ジストマ症","勘定科目法","環状交差点","寛仁さま",
                  "環水平アーク","官製談合防止法","官製談合防止法違反","間接強制","間接控除","間接控除法","間接償却","間接水","間接法","感染症集団発生","感染症の集団発生","感染性大腸炎","甘川洞文化村",
                  "完全オフレコ","完全前受制度","完全民営化","簡素な給付措置","肝臓ジストマ"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/ka/10
        
        wordArray = ["環太平洋経済協定","環太平洋経済連携協定","環太平洋合同演習","環太平洋戦略的経済連携協定","環太平洋パートナーシップ","環太平洋パートナーシップ協定","環太平洋連携協定","カンタベリー地震","缶詰バー",
                   "缶詰めバー","缶づめバー","官邸筋","関東軍防疫給水部本部","関東自動車","関東自動車株式会社","カントリーシーリング","カントリーシーリング制","管内金融経済概況","江南スタイル","カンナムスタイル",
                   "韓日スワップ協定","観音寺の観世音菩薩坐像","乾杯条例","カンパニー制","カンピロバクター","カンピロバクター菌","還付金詐欺","還付金残高確認証","韓米原子力協力","韓米ミサイル指針","カンボジア証券取引所",
                   "陥没穴","関門海峡道路","関門新ルート","間葉系幹細胞","管理フロート","管理フロート制","管理変動相場制","監理ポスト","監理銘柄","官僚主導","官僚答弁の禁止","関連会社等報告書","緩和医療",
                   "緩和ケア","緩和マネー","カン・ジュヒ","カード合わせ","カード現金化","カード現金化業者","カード式線量計","カードショッピング枠現金化","カードショッピング枠現金化業者","カーボンクレジット",
                   "カーボンサイクル","カーボンニュートラル","カーボンネガティブ","カーボンポジティブ"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/ki
        
        wordArray = ["紀伊半島大水害","キウォーニー原子力発電所","キウォーニー原発","消えた年金","消えた年金記録","記憶遺産","機械遺産","機会コスト","機械受注","機械受注統計","機械受注統計調査","機械除却損","機会費用",
                    "軌間可変電車","器官原基法","基幹税","基幹電源","危害射撃","危機遺産","危機言語","気球基地局","企業が反社会的勢力による被害を防止するための指針","企業献金","企業道具説","企業内保育所","企業版特区",
                    "企業物価指数","企業用具説","危険業務および有害業務","危険資産","危険ドラッグ","危険ドラッグ規制条例","危険な業務および有害な業務","危険な都市ランキング","危険又は有害な業務","危険または有害な業務",
                    "危険有害業務","気候観測衛星","機構債","気候変動観測衛星","気候変動に関する政府間パネル","気候変動枠組条約締約国会議","気候変動枠組み条約締約国会議","国連気候変動枠組み条約締約国会議",
                    "機構法案","キシパミド","希少医薬品","希少金属","希少金属代替材料開発プロジェクト","希少疾患","希少疾病","希少疾病用医療用具","希少疾病用医薬品","期日前投票","期日前投票所","期日前投票制度",
                    "基準外生肉","基準財政収入額","基準財政需要額","基準日","絆消費","規制仕分け","奇跡の一本松","季節株","季節調整値","キセノン135","キセノン133","気絶遊び","気絶あそび","起訴議決","起訴議決に至らなかった旨の議決",
                    "起訴すべき旨の議決","起訴相当","起訴猶予","既存店売上高","北アナトリア断層","期待インフレ率","北伊豆断層帯","期待雛","期待びな","今年の期待びな","北関東磐越五県知事会議","北関東磐越5県知事会議",
                    "帰宅困難区域","帰宅同意書","北知床岬","北大西洋条約機構","北朝鮮貨物検査法","北朝鮮情報監視態勢","汚い爆弾","北本新駅","基地村","基調判断","期近物国債","キッズタクシー","キッチンキャビネット",
                    "キツキャラ","基底負荷電源","機動戦闘車","希土類元素","希土類鉱床","記念スイカ騒動","記念Suica騒動","機能性インナー","機能性下着","機能性素材","機能性肌着","機能的核磁気共鳴画像法",
                    "機能的磁気共鳴断層撮影","菌敵","菌敵清","気乗り場","希薄化率","器物損壊罪","器物損壊等罪","キプロス金融危機","キプロス財政危機","キプロスの金融問題","キプロスの財政危機","キプロスの財政問題",
                    "基本政策INDEX","基本リベート","希望の灯り","キマイラ動物","期末要因","君が代訴訟","君が代日の丸問題","君が代問題","木密地域不燃化10年プロジェクト","機密費","金氏朝鮮","キム氏朝鮮","金正恩",
                    "キメラ動物","キメラマウス","キャスク","キャッシュアウト","キャッシュイン","キャピタル・フライト","キャベツ戦略","CAPEX","キャロライン・ケネディ","キャロライン・ブーヴィエ・ケネディ","キャロライン・ブービエ・ケネディ",
                    "木痩せ","救急医療の東京ルール","救急搬送人員","救急搬送人員数","救急搬送人数","旧国際テロ緊急展開チーム","吸湿発熱ウェア","吸収オペ","吸収剤","休日振替","休日振り替え","96条議連","救助義務",
                    "吸水性樹脂","急性呼吸窮迫症候群","急性上気道炎","急性虫垂炎穿孔限局性腹膜炎","急性放射線症","急性放射線障害","旧ソ連圏","旧ソ連圏諸国","旧耐震基準","吸着装置","吸着塔","宮中歌会始","宮中晩さん",
                    "宮中晩餐","宮中晩餐会","9.11追悼博物館","吸入ステロイド","吸入ステロイド剤","吸入ステロイド薬","休廃業","給付付き税額控除","給付つき税額控除","休眠火力","休眠火力発電所","休眠口座","休眠特許",
                    "休眠預金","給油難民","給与関係閣僚会議","給与削減法案","給与所得控除","キュリウム","キュリウム242","キュリウム244","キュリオン","キューイーツー","キューイーワン","キューディーアール",
                    "QDR","凶悪犯","教育訓練休暇","教育訓練休職","教育雇用省","教育資金","教育資金贈与信託","教育信託","教育長","教員の駆込み退職","教員の駆け込み退職","教員免許更新制","教員免許更新制度","教皇",
                    "教皇専用車","教皇ヨハネ・パウロ2世像","境界型地震","境界型パーソナリティ障害","協会けんぽ","境界性人格障害","境界性パーソナリティ障害","教科書採択","教科書採択地区","教科書の採択","教科書の採択地区",
                    "教科書無償措置法","教科書無償給与制度","供給オペ","供給側統計","供給予備率","供給予備力","強行規範","共済年金","狭窄性腱鞘炎","共産主義青年団","強震モニタ","強磁性窒化鉄","強制管轄権",
                    "強制起訴","強制起訴制度","強制捜査","共青団","強制両替制度","京大ポポロ","京大ポポロ事件","協調介入","胸椎骨折","共通ES","共通エントリーシート","共通担保オペ","共通だが差異ある責任",
                    "共通だが差異ある責任原則","共通番号関連法案","共通番号制度","共通番号法案","京都オパール","京都議定書","京都議定書延長","共同軍事演習","共同親権","共同正犯","共同持ち株会社","強毒型鳥インフルエンザウィルス",
                    "強毒性トリインフルエンザウィルス","強毒性鳥インフルエンザウイルス","強毒性鳥インフルエンザウィルス","強毒タイプ鳥インフルエンザウィルス","強風域","恐怖指数","狂奔遊泳","共謀罪","共有型経済",
                    "協力融通","虚偽申告罪","虚偽申告の罪","虚偽の申告の罪","極渦","局激","局所的な臨界","旭日小綬章","旭日重光章","旭日双光章","旭日単光章","旭日大綬章","旭日中綬章","極端気象","極端気象現象",
                    "極端現象","極端な気象","極端な気象・気候現象","局地激甚災害","極超音速機","虚構新聞騒動","虚構の申告の罪","挙国一致内閣","挙国内閣","巨大ガス天体・ヒミコ","巨大人工浮島","巨大地球型惑星",
                    "巨大津波観測計","巨大天体ヒミコ","巨大な津波","挙党一致","拒否権","許容スリッページ","稀用薬","キラキラ四股名","きらきら四股名","キラーパルス","キリス","起立斉唱","切り貼り新党","キロベクレル",
                    "キロボ","筋萎縮性側索硬化症マウス","筋萎縮性側索硬化症を発症させたマウス","筋萎縮性側索硬化症を発症したマウス","禁煙電話相談","金価格","緊急事態応急対策拠点施設","緊急時対策支援システム","緊急事態条項",
                    "緊急事態対処条項","緊急時における食品の放射能測定マニュアル","緊急時避難準備区域","緊急時防護措置準備区域","緊急上程","緊急逮捕","緊急避妊ピル","緊急避妊薬","緊急被曝医療","緊急被ばく医療","緊急防護措置計画範囲",
                    "緊急炉心冷却装置","筋減弱症肥満","近現代史","金先物市場","金先物取引","金先物取引き","金商法","金商法違反","金商法会計","近日点","近赤外光","近赤外線","金属貨幣","均霑化","均沾化","均てん化",
                    "均等割","キンバリー岩","キンバーライト","近傍派遣","金融安定監督協議会","金融安定監督評議会","金融緩和マネー","金融規制改革法","金融経済概況","金融経済月報","金融経済動向","金融検査","金融先物",
                     "金融サービス","金融資産効果","金融商品取引法","金融商品取引法違反","金融商品取引法会計","金融政策決定会合","金融庁検査","金融取引業規制機構","金融ブローカー","近隣窮乏化政策","キーストーンXL",
                     "キーストーンXL石油パイプライン","キーストーンXLパイプラインシステム","キーストーンXLパイプライン","キーストーンパイプラインXL","キースリー・キャニオン","キーリゾルブ","キーンソード"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/ku/3
        
        wordArray = ["クイットライン","食物依存性運動誘発性アナフィラキシー","クインス","クイーンズヘッド","空海作戦","空海戦闘","空間除菌","空間分煙","空間用虫よけ","空間用虫除け剤","空間用虫よけ剤","空気エンジン","空気エンジン車",
        "空気モーター","空港着陸料","空振","空中鬼","空中給油訓練","空中警戒管制機","空中警戒管制指揮機","空中警戒管制システム","空中権","空中早期警戒システム","空白域","ククルビタシン","ククルビタシン類","クシクラゲ類",
        "クジラ資源","くじらの博物館","孔子和平奨","薬ネット販売","薬のネット販売","九頭竜湖殺人遺体遺棄事件","九頭竜湖殺人死体遺棄事件","九頭竜湖殺人事件","九頭竜湖死体遺棄事件","九頭竜湖冷凍庫殺人事件","口止め条項",
        "屈折放水塔車","クッポン","靴強盗","靴投げ抗議","クドア","クドア・セプテンプンクタータ","国後島","クナシル島","国循","国民健康・栄養調査","国民総幸福","国の借金","国鱒","クニマス","国丸ごと仕分け","国まるごと仕分け",
        "クネノミクス","首浮き輪","首長連合","首吊線","首吊り線","首つり線","熊猫外交","クマラスワミ報告","亀尾フッ酸ガス漏出事故","組戻","組戻し","クムメラ","クライストチャーチ地震","クライネ・レヴィン症候群",
        "クラインフェルター症候群","クライン・レビン症候群","クラウディングアウト効果","クラウド型電子図書館システム","クラウド型電子図書館サービス","クラウド推測変換","クラウド入力","クラウド変換","クラスター爆弾",
        "クラスターヘッドエイク","クラスターボム","クラスナ・ホルカ","クラスナ・ホルカ城","クラタス","クラッシュ症候群","クラッシュシンドローム","クラフトビール","クラブハーモニー","クラブハーモニー号","クリエイティブインダストリー",
        "クリエイティブ産業","クリクリ","繰越利益剰余金","クリコート","クリコートC-720グリーン","クリスマス相場","クリックホイール技術に関する特許訴訟","クリックホイール特許訴訟","繰延税金資産","繰り延べ税金資産",
        "クリミア共和国独立宣言","クリミア・コンゴ出血熱","クリミア自治共和国","クリミア・タタール人","クリミア独立宣言","クリミア半島問題","クリミア問題","クリム戦争","クリム半島問題","クリミア戦争","クリル諸島",
        "クリル列島","くりん草","九輪草","クリンソウ","クリール諸島","クリール列島","クリーン開発メカニズム","クリーンコール","クリーンコール技術","クリーンコールテクノロジ","クリーンコールテクノロジー","クリーンディーゼル",
        "クリーンディーゼル自動車","車椅子ラグビー","車いすラグビー","車突っ込み事故","車爆弾","クルーズトリパノゾーマ","クルーズトレインななつ星in九州","クルーゾン氏症候群","クルーゾン症候群","クレジットイベント",
        "クレジットカード現金化","クレジットカード現金化業者","クレジットカードショッピング枠現金化","クレジットカードショッピング枠現金化業者","クレジット市場","クレジット・ウォッチ・ネガティブ","クレジット・ウォッチ・ポジティブ",
        "クレジット・デフォルト・スワップ","クレスフォンテスタスキアゲハ","クレベリン","鉄証如山","鉄証山の如し","鉄マン鉱床","黒子","黒三兵","黒田日銀の異次元金融緩和","黒田日銀の次元の異なる金融緩和","黒ビール",
        "クロマグロの完全養殖","クロームOS","クロームブック","クローン技術規制法","クワイエット・ピリオド","勲章親授式","訓示規定","クンブメーラ","槿恵ノミクス","クンヘノミクス","クンミン駅","クンメラ","クーポン共同購入サイト",
        "クールシェア","クールシェアリング","クールジャパン","クールジャパン戦略","クールビズ","クール便常温仕分け問題","日CARICOM首脳会合","景表法違反","警戒区域","計画的避難区域","系外惑星","景気ウォッチャー調査",
        "景気回復宣言","景気拡大","景気後退","景気条項","景気先行指標","景気弾力条項","景気動向指数","軽希土類元素","景気の基調判断","景気の谷","景気の山","景気敏感株","京急蒲田（空）第１踏切道","景況感",
        "景況判断","景況判断BSI","景況判断指数","軽空母","軽減税率","蛍光イムノクロマト","蛍光イムノクロマトグラフィー","蛍光イムノクロマトグラフィー法","蛍光イムノクロマト法","傾向性爆薬","警告射撃","警察解体",
        "警察組織解体","警察組織の解体","警察庁指定被疑者特別指名手配","警察の解体","警察版ハイパーレスキュー","警察版ハイパーレスキュー隊","経産牛","経産省前テント","計算書類等","経済閣僚","経済関係4閣僚","経済危機対策",
        "経済三団体","経済3団体","経済財政白書","経済指標","経済上の連携に関する日本国とタイ王国との間の協定","経済センサス","経済団体連合会","経済白書","経済融通電力","経済4閣僚","経済連携協定","経済連携PT",
        "経済連携プロジェクトチーム","経済・物価情勢の展望（展望レポート）","経済・物価情勢の展望","警視庁重大事件100","警視庁特命捜査対策室","刑事補償金","経常移転収支","経常黒字","経常利益率","軽装運動","軽率な一般化",
        "継続価値","継続企業の前提","継続降下到着方式","継続的取引基本契約書","継続的取引の基本となる契約書","継続予算決議","携帯電話遠投","携帯電話投げ","携帯電話の遠投","経団連","頸椎症性神経根症","ケイナインジステンパー",
        "珪肺","珪肺症","競馬脱税事件","景品法","景品表示法","景品表示法違反","京ベクレル","刑法犯","刑法犯認知件数","警報レベル","刑務作業","契約アンペア","契約アンペア数","経理操作","軽レアアース","日漫独",
        "ケスラーシンドローム","開城工業団地","日タイEPA","日タイ経済連携協定","ケタミン","血管新生阻害剤","血管新生阻害薬","結婚契約書","決済経路","決済チャネル","決済リベート","決済ルート","ケツ入れ","決議1874 (2009)",
        "日トルコ間の科学技術大学","ケニア大干ばつ","気配呼値","軽犯罪法違反","ケプラー186f","日ベトナム原子力協定","ケモリ海岸砲基地","ケラトプス科","ケラトプス類","ケルバン腱鞘炎","ケワニー原子力発電所","ケワニー原発",
        "県営浅川ダム","検挙件数","嫌疑なし","嫌疑不十分","健康志向","検査計画、出荷制限等の品目・区域の設定・解除の考え方","検察官役指定弁護士","検察官送致","検察官特別考試","検察官への送致","検察官役となる指定弁護士",
        "検察官役の指定弁護士","検察審査会","検察審査会法","検察の実務","懸賞による景品類の提供に関する事項の制限","検事2級","建設技能労働者過不足率","建設国債","建設小町","建設労働需給調査","検定済教科書","検定済み教科書",
        "県内金融経済概況","憲法96条","憲法96条改正","憲法96条改正議員連盟","憲法96条改正議連","憲法96条改正超党派議連","憲法96条改正反対議連","憲法9条にノーベル平和賞","憲法9条をノーベル平和賞に",
        "憲法9条を保持している日本国民にノーベル平和賞を","憲法五十九条","憲法九条にノーベル平和賞を","憲法第18条","憲法第59条","憲法第9条にノーベル平和賞を","憲法第九十六条","憲法第五十九条","憲法第十八条",
        "憲法改正国民投票法","憲法改正の3つの宿題","憲法改正の三つの宿題","憲法改正反対議連","憲法改正要件","憲法9条にノーベル平和賞を","憲法59条","憲法審査会","憲法18条","憲法第96条","賢友会","権利落ち日",
        "権利落日","権利確定日","権利付最終売買日","権利付き最終売買日","権利付最終日","権利の所在が不明な著作物","日・欧州原子力共同体原子力協定","日・オーストラリア経済連携協定","ケーストリート","Kストリート",
        "ケータイ流行語大賞","ケープカナベラル空軍基地","ケープカナベラル空軍ステーション"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["コアインフレ","コアインフレ率","コアインフレーション","コアインフレーション率","コアコアCPI","コア指数","コアCPI","小泉談話","小泉内閣総理大臣談話","小一プロブレム","小一問題","降圧剤データ操作問題",
        "高圧放水車","広域卸売業","広域海上監視","広域型国家戦略特区","広域型特区","広域相互協力融通電力","広域都市型国家戦略特区","広域都市型特区","広域特区","広域連合","皇位継承権","公益財団法人","公益社団法人",
        "公益事業費","公益認定","公益法人制度改革","公益目的事業費","高温ガス原子炉","高温ガス冷却炉","高温ガス炉","高温再処理技術","高温注意情報","公開串","公開市場操作","鴻海精密工業股份有限公司","黄海フェリー沈没事故",
        "公開プロキシ","公開プロクシ","交換ストーカー","光学衛星","高額所得者控除","高額所得者の給与所得控除","高額療養費","高額療養費制度","黄岩島","高規格堤防","後期高齢者医療被保険者","後期高齢者医療被保険者証",
        "高級紙","高級実務者会合","公共クラウド","公共工事関連株","公共サービスの民間開放","公共と民間のパートナーシップ","高金利通貨","抗議の靴投げ","工行","抗凝固薬","航空自由化","航空情報区","高経年化"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["抗血液凝固薬","貢献利益","鉱工業出荷指数","高高度防衛ミサイル","高校の無償化","高校無償化","高校野球連盟","高効率二重管式薄肉エキゾーストマニホールド","小動き","耕作放棄地","口座清算価値","口座番号","孔子学院",
           "公式試合安定開催基金","皇室政治利用","皇室チャンネル","皇室典範","皇室の政治的利用","皇室の政治利用","孔子平和賞","甲州ワイン","公職選挙法","公職選挙法違反","高所得者控除","講書始","講書始の儀","更新値幅",
           "高次脳機能障害","紅綬褒章","甲状腺癌","甲状腺ガン","甲状腺がん","甲状腺検査","公序良俗違反","降水ナウキャスト","公正証書原本不実記載","公正証書原本不実記載等罪","抗生物質耐性菌","鉱石の品位","公選法",
           "公選法違反","拘束介護","高速増殖炉","控訴審判決","公訴時効撤廃","公訴時効の廃止","公訴時効廃止","酵素阻害剤","構造改革特別区域","構造改革特区","航続距離延長装置","抗体医薬","抗体医薬品","降誕教会",
           "公団住宅","交通系ICカード","国府津-松田断層帯","国府津松田断層","口蹄疫復興宝くじ","公定為替相場","公定為替レート","公定相場","校庭の表土除去","公定レート","公的介護保険","好適環境水","公的債務","高電界殺菌技術",
           "叩頭外交","高等技能訓練促進費","高度外国人材ポイント制度","高度人材ポイント制度","抗日記念館","抗日戦争記念館","公認市場レート","公認両替商レート","公認レート","高年齢者雇用安定法","高年齢者等の雇用の安定等に関する法律",
           "高濃度汚染水","高濃度汚泥","高濃度被曝エリア","高濃度被ばくエリア","河野官房長官談話","河野談話","河野内閣官房長官談話","河野洋平官房長官（当時）談話","河野洋平官房長官談話","後発医薬品","高病原性鳥インフルエンザ",
           "幸福度指標","交付国債","交付税の法定率","鉱物資源","高分子吸水材","高分子系吸水材","高分子ポリマー","公文書管理に関する法律","公文書管理法","公文書等の管理に関する法律","神戸牛","神戸肉","神戸ビーフ",
           "公募・売出価格","公募・売出し価格","光明星3号","公民権停止","公務員給与削減法案","公務員給与臨時特例法案","公務災害","公務執行妨害","コウモリ外交","絞扼性神経障害","高野連","公用文書等毀棄罪",
           "高寄り","小売業販売額","小売配送センター","小売り配送センター","小売物流センター","小売り物流センター","蛟竜号"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/ko/6
        
        wordArray = ["効力規定","小売流通センター","小売り流通センター","高齢者間の世代内格差","高齢者の世代内格差","高レベル汚染水","高レベル放射性廃棄物","氷バケツ","氷バケツチャレンジ","小型家電リサイクル法","小型ミューオンソレノイド",
           "木枯らし一号","木枯らし1号","小切手外交","黒鉛減速沸騰軽水圧力管型原子炉","黒鉛減速炉","国外退去","国語に関する世論調査","国際iPS細胞バンク計画","国際iPSバンク","国際iPSバンク計画","国際iPS細胞バンク",
           "国債依存度","国債売現先オペ","国際エイズワクチン推進構想","国債ロールオーバー","国債買入オペ","国債買入れオペ","国債買い入れオペ","国債買現先オペ","国際海事機関","国際海事機構","国債格上げ","国債格下げ",
           "国債格付け","国債格付け引上げ","国債格付け引き上げ","国債格付け引下げ","国債格付け引き下げ","国際記念物遺跡会議","国際基督教大学","国際技術革新ランキング","国際原子力事象評価尺度","国際原子力事故評価尺度",
           "国際原子力事象評価尺度レベル5","国際原子力事象評価尺度レベル7","国際原子力事象評価尺度レベル8","国際原子力事象評価尺度レベル6","国債交換","国際公約","国際交流基金賞","国債先物相場","国際司法裁判所","国際収支状況",
           "国際収支統計","国際人権規約","国際スワップデリバティブ協会","国際スワップデリバティブズ協会","国際戦略総合特区","国際的公衆衛生上の緊急事態宣言","国際的な緊急事態宣言","国際的な公衆衛生上の緊急事態宣言",
           "国際的な子の奪取の民事上の面に関する条約","国際的に懸念される公衆衛生上の緊急事態宣言","国際的に懸念される公衆の保健上の緊急事態","国際手配","国際テロ緊急展開チーム","国際テロ組織財産凍結法",
           "国際テロリスト財産凍結法","国際テロリストの財産凍結法案","国際テロリズム緊急展開班","国際兵器展示会","国債補完供給","国際防災の十年","国際防災の10年","国際リニアコライダー計画","国債利回り","国際連合安全保障理事会改革",
           "国際連合安全保障理事会決議","国際連合安全保障理事会決議第1874号","国際連合国際防災戦略","国際連合コンゴ民主共和国安定化ミッション","国際連合シリア監視団","国際連合事務総長","国際連合人権委員会",
           "国際連合人権理事会","国際連合スーダン共和国ミッション","国際連合総会第一委員会","国際連合総会第五委員会","国際連合総会第三委員会","国際連合総会第四委員会","国際連合総会第二委員会","国際連合総会第六委員会",
           "国際連合南スーダン・ミッション","国産型テロ","国産型テロリスト","国産テロ","国産テロリスト","国産テロリズム","黒死病","黒石寺蘇民祭","告訴状の不受理","告訴状不受理問題","告訴不受理","告訴不受理問題",
           "国対","国対政治","国内筋","国土強靭化基本計画","国土強靱化基本法案","国土強靱化計画","国内株式型ファンド","国内市場","国内勢","国内投資促進円卓会議","国内要因","黒熱病","国分松本遺跡","国民栄誉賞",
           "国民総幸福量","国民総幸福量統計","国民投票制度","国民投票法","国民投票法の3つの宿題","国民投票法の三つの宿題","国民年金第3号被保険者","国民の生活が第一","国民保険番号","国有財産レポート",
           "国立高度専門医療研究センター","国立循環器病研究センター","国連安全保障理事会決議","国連安保理改革","国連安保理決議","国連安保理制裁決議","国連気候変動枠組条約第19回締約国会議","国連国際防災戦略",
           "国連コンゴ安定化ミッション","国連シリア監視団","国連シリア停戦監視団","国連持続可能な開発会議","国連事務総長","国連スーダン・ミッション","国連総会行政予算委員会","国連総会軍縮・国際安全保障委員会",
           "国連総会経済財政委員会","国連総会社会・人道・文化委員会","国連総会第1委員会","国連総会第2委員会","国連総会第3委員会","国連総会第4委員会","国連総会第5委員会","国連総会第6委員会","国連総会第一委員会",
           "国連総会第五委員会","国連総会第三委員会","国連総会第二委員会","国連総会第四委員会","国連総会第六委員会","国連総会特別政治・非植民地化委員会","国連総会法律委員会","国連武器禁輸国","国連武器禁輸国・地域",
           "国連南スーダン共和国ミッション","小口取引","小口取り引き","小口取引き","小口の継続的長期投資非課税制度","コケイン症候群","コケインシンドローム","ココエ","COCOE","于山","心の定年","ココロの定年",
           "心の復興","ココロボ","ココロボ妹Ver.","ココロボ妹バージョン","コサック島","古式捕鯨","コシテル","こしもざらめ雪","孤児作品","孤児著作物","小じっかり","故人献金","個人債務者の私的整理に関するガイドライン",
           "個人消費","個人事項証明","個人事項証明書","個人住民税","個人請求権","個人版私的整理ガイドライン運営委員会","個人向け国債","個人向け復興国債","個人向け文具","個人向け文房具","個人向け利付国庫債券",
           "個人用ガラス線量計","湖水爆発","コスタコンコルディア号","コスタ・アレグラ","コスタ・コンコルディア","コストプラス法","コストプラスプライシング","コスメティックタトゥー","コズミックジェット","戸籍個人事項証明",
           "戸籍個人事項証明書","戸籍抄本","戸籍全部事項証明","戸籍全部事項証明書","戸籍外の子供","戸籍謄本","戸籍登録外の子供","子育て応援券","子育て世帯臨時特例給付","子育て世帯臨時特例給付金","個体識別番号",
           "固体燃料ロケット","コチニール色素","国家安全保障会議","国会議員歳費","国会議員歳費削減","国会原発事故調","国会招致","国会対策委員会","国会提出前合意","国会 東京電力福島原子力発電所事故調査委員会",
           "国会同意人事","国会同意人事の事前報道ルール","国家開発銀行","国家緊急権","国家公務員給与臨時特例法案","国家公務員の給与の臨時特例に関する法律案","国家ジオパーク","国家戦略会議","国家戦略局","国家戦略室",
           "国家戦略特区","国家電網","国家電網公司","国家非常事態対処条項","国歌不起立","国旗国歌訴訟","国旗国歌通達","国旗国歌問題","国境を超える取引","国庫委託金","国庫短期証券売買オペ","国庫負担金","国庫返納",
           "国庫補助金","コップエイティーン","COP17","COP18","COP19","骨形成不全症","骨盤腹膜炎","固定価格買取制","固定価格買取制度","固定価格買取り制度","固定価格買い取り制度","固定金利方式・共通担保資金供給オペレーション",
           "固定5年","固定3年","固定式自立型","固定式自立型シルトフェンス","固定式垂下型","固定式垂下型汚濁防止膜","固定式垂下型シルトフェンス","固定資産除却損","固定費率","古典型ツツガムシ病","古典型恙虫病",
           "古典型つつが虫病","古典の日","古典の日に関する法律","今年の顔","今年の漢字","今年の人","子ども医療費受給者証","子ども医療費助成","子ども医療費助成制度","こども園","子ども家庭省","子どもが第一",
           "子ども・子育て支援新制度","子ども国会","子ども全国ネット","子どもたちを放射能から守る全国ネットワーク","子ども第一","子供兵","子ども手当","子ども手当て","子供の安楽死","子どもの安楽死","子どものいじめ防止条例",
           "子どもの行動チェックリスト","子供の幸福度調査","子どもの幸福度","子どもの幸福度調査","子供の尊厳死","子どもの尊厳死","子どものための手当","子ども版NISA","こども版NISA","子供ハーネス",
           "子供版NISA","子供兵士","子供用ハーネス","小中一貫教育校","小中連携校","小幅上放れ黒線","小幅往来","小幅続伸","小幅続落","小幅高","小幅反発","小幅揉合い","小幅揉合","小幅揉み合い","小幅もみ合い",
           "小幅安","小林薫事件","コバルト58","コバルト56","コピノ","コピーライトトロール","コブラ・ゴールド","コプト教会","コプト教徒","コプト正教会","個別決算","戸別所得補償制度","個別注記表",
           "個別的自衛権","戸別発電","個別物色","戸別補償","コミュニティエネルギーマネジメントシステム","コミュニティ開発炭素基金","コミュニティサイクル","コムス","米運輸省道路交通安全局","米金融規制改革法",
           "米比合同軍事演習","米債務上限引き上げ問題","米先物取引","コメ先物取引","コメ作況","コメ作況指数","米印共同演習","米印共同訓練","米耐久財新規受注統計","米トレーサビリティ法","米の債務上限問題",
           "米の食味ランキング","米の全袋検査","コメの全袋検査","米の放射性セシウム濃度の検査","米の放射性物質検査","コメの放射性物質検査","米の放射性物質調査","米の放射線検査","米プロテクティブ生命保険",
           "米量的緩和第3弾","コモディティ株","コモディティカレンシー","コモディティ関連株","コモディティ関連銘柄","コモディティ通貨","コモディティ銘柄","コモディティー株","コモディティーカレンシー",
           "コモディティー関連株","コモディティー関連銘柄","コモディティー通貨","コモディティー銘柄","小戻す","コモンメタル","雇用者報酬","雇用助成金","雇用保蔵","懲免","コラテジェン","古里原子力発電所",
           "コリ原子力発電所","コリ原発","孤立死","孤立無業","孤立無業者","コリネバクテリウム","コリネバクテリウム・ウルセランス","コルベット","コルベット艦","コルレス銀行","コルレス契約","コルレスバンク",
           "コルレス先","コレスポンデンス分析","比亜迪","比亜迪汽車","転がり免震","自食","コロッサルスクイッド","コロナウィルス","コロハ","婚姻登記処","婚姻登記管理処","婚姻登録所","婚活詐欺","婚外子相続",
           "婚外子への相続","コンクラーヴェ","コンクラーベ","コンクリポンプ車","コンクリートポンプ車","コンクリート用ポンプ車","混合診療","コンサルティング会社","コンサルティング企業","コンサルティングファーム",
           "紺綬褒章","昏睡強盗","昆虫サイボーグ","昆虫食","コンバインドサイクル発電","コンバージェンス","コンパクト・ミューオン・ソレノイド","コンビニコーヒー","コンビニ強盗","コンピュータウィルス供用",
           "コンピューター監視法案","コンフェデ","コンフェデ杯","コンフェデレーションズカップ","コンフリクトミネラル","コンプガチャショック","コンプガチャ問題","コンプサット3","コンプレックス商法","コンプロミソ",
           "コンボコネクタ","コンボコネクタ方式","コンボ方式","昆明駅","昆明站","昆明南駅","コースの定理","コーホート要因法"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/sa
        
        wordArray = ["サイアミナーゼ","再エネ","サイエンス","西海フェリー号沈没事故","西海ペリー号沈没事故","災害関係特約","災害関連死","災害救助法","災害公営住宅","災害死亡給付特約","災害障害見舞金","災害弱者",
            "災害時要援護者","災害弔慰金","災害特約","災害廃棄物","災害派遣医療チーム","災害見舞金","災害見舞い金","災害用伝言ダイヤル","災害リスク","災害割増特約","サイクルシェアリング","再クローニング",
            "債権残高","債券市場","債権超過国","債権放棄","債券リパーチェス市場","債券レポ市場","債券レポ取引市場","歳月号","再興型インフルエンザ","サイコトキシシティ","最後の抱き線","採算点","最終赤字",
            "最終気配値段","最終高級実務者会合","再就職監視委","再就職等監視委員会","済州島","最終売買日","最終利益","再生医療安全性確保法","再生医療等安全性確保法","再生医療等の安全性の確保等に関する法律",
            "再生医療法","再生エネ","再生エネルギー","再生エネルギー特別措置法","再生エネルギー法","再生エネルギー法案","再生可能エネルギー","再生可能エネルギー買い取り法","再生可能エネルギー全量買い取り制度",
            "再生可能エネルギー特別措置法","再生可能エネルギー特別措置法案","再生可能エネルギーの固定価格買取制度","再生可能エネルギーの固定価格買取り制度","再生可能エネルギーの固定価格買い取り制度",
            "再生可能エネルギーの全量買取制度","再生可能エネルギーの全量買い取り制度","再生可能エネルギー法","再生可能エネルギー法案","再生可能なエネルギー","再生費用法","砕石層","採択地区",
            "最大放射線量","最大野党","最大余震","最低購入金額","最低購入代金","最低制限価格","最低制限価格制度","最低売買金額","最低売買代金","最低売買単位","最低保障年金","再入閣","歳入庁",
            "再任用制度","裁判員裁判","裁判員メンタルヘルスサポート窓口","裁判員メンタルヘルスサポート窓口制度","裁判外紛争解決手続","裁判外紛争解決手続認証制度","サイバー空間","サイバースペース",
            "サイバー戦争","サイバーテロ","サイバーテロ攻撃","サイバーテロリズム","サイバーナイフ","サイバーマンデー","歳費","歳費削減","サイフ・アルイスラム","サイフ・イスラム","再保険会社","サイボス",
            "サイボーグ昆虫","サイマルラジオ","債務残高","債務整理","債務超過国","債務免除","債務輸出比率","採用内定取消し","再来間隔","再臨界","再臨界阻止","再臨界防止","サイレントお祈り","サインレスシステム",
            "沙洞港","サオラ","堺都市州構想","前兆すべり","サガハイマット","サガミオリジナルゼロゼロワン","サガミオリジナル001","相模トラフ","相模トラフ沿地震","相模トラフ沿い地震","相良層","先行きDI",
            "先高観","先高感","先高期待","先取り売り","先取り買い","先物主導","先物先行","先物ゾーン","先安観","先安感","詐欺的な利殖商法","作為的相場形成","昨年来高値","昨年来安値","さくらリポート",
            "さくらレポート","下げ足のカブセ","下げ足の差し込み線","下げ三法","下げ過ぎ感","下げ転換","下げトレンド","下げ幅","下げ余地","笹井芳樹","笹井芳樹氏","笹井芳樹副センター長","サザエさん通り",
            "サザエさんどおり","刺亀","サシガメ科","差込み線","差し込み線","差戻審","差戻し審","差し戻し審","サッカーコンフェデレーションズカップ","サッカー日本女子代表","作況指数","札証アンビシャス",
            "殺人豪雨","札談合等関与行為防止法違反","サティアン","サテライト方式","里親制度","里帰り出産","サトシ・ナカモト","さとり世代","佐渡蛙","サドガエル","佐渡金銀山","佐渡金銀山遺跡","左尿管結石",
            "さぬきうどん駅","サハロフ賞","サハロフ・プライズ","サブサハラ","サブサハラアフリカ","サブドレン","サブドレーン","サブドレーンピット","サブハ","サブプライム住宅ローン危機","サブプライム住宅ローン問題",
            "サブプライムローン問題","三六協定","サプレッションチェンバー","サプレッションプール","サポウィルス","サマージャンボ","サマージャンボ宝くじ","サマーラリー","サムスンショック","サムスン帝国",
            "サムスン電子ショック","サムライ債","サム・サイモン号","サライェヴォ事件","サラェボ事件","サラエヴォ","サラエボ事件","新常態","新短期・新長期排出ガス規制","新短期・長期排出ガス規制",
            "新短プラ","サラフ主義","新武器輸出3原則","新武器輸出三原則","サリー原子力発電所","サリー原発","サルコイドーシス","サルコファガス","サルコファーク","サルコペニア肥満","猿セレモニー",
            "サルベージ屋","障防法","障防法違反","参院選","サンオノフレ原子力発電所","サンオノフレ原発","産科医療補償制度","三角保ち合い","参加差押","三階建","参議院議員選挙","参議院議員通常選挙",
            "参議院選挙","産業革新機構","産業活力再生特別措置法","産業活力再生特別措置法所定の特定認証紛争解決手続","産業活力の再生及び産業活動の革新に関する特別措置法","三空叩き込み","三空踏み上げ",
            "サンクコスト","三包","三包制度","三権の長","参考人招致","参考人聴取","3号被保険者","三山","三市場","産出量ギャップ","三次卸","三次卸業者","三次喫煙","惨事ストレス","35人学級","三重水素",
            "三条委員会","3条委員会","三世代世襲","三川","三尊底","山体崩壊","サンタクロースラリー","サンタマリア","サンタマリア号","三党協議","三党実務者協議","三大格付け会社","3大格付け会社",
            "三大証券取引所","三代世襲","3代世襲","三大取引所","三手打ち","三手大赤線","三手大黒線","三手放れ寄せ線","三手待ち","サンディフック小学校銃乱射事件","サンディーフック小学校銃乱射事件",
            "サンデーフック小学校銃乱射事件","三胴船","3・2・8号線","三番底","三番天井","三一重工","三一重工業集団有限公司","三一八公民運動","三分の二押し","3分の2押し","三分の二戻し","3分の2戻し",
            "サンプリング建屋","三兵","三本の矢","三包規定","サンライズ計画","三陸沖地震","三陸ワカメ","三類感染症","SARSウィルス","サーチュイン","サーチュイン遺伝子","サーチュインファミリー","サードハンドスモーク",
            "サービス収支","サービス付き高齢者向け住宅","サービス貿易協定","サーマルリカバリー","サーマルリサイクル","サーモウール","サーモエレクトリック効果","サーモゲニン"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/shi/5
        
        wordArray = ["仕入控除税額制度","仕入れ控除税額制度","仕入債務回転率","シウス","CIWS","シェア乗り場","シェアハウス","シェアリングエコノミー","シェイク・シャック","シェンゲン協定","シェンチョウ9号",
            "シェーク・シャック","シェール革命","シェールガス革命","シェールガスブーム","シエラネヴァダコーポレーション","シエラネバダ","シエラネバダコーポレーション","シエラネバダ社","シエラマドレ号",
            "支援材料","シカゴ宣言","シカゴ連銀景気指数","シカゴ連銀景気指数3ヶ月移動平均","シカゴ連銀景気動向指数","シカゴ連銀景気動向指数3ヶ月移動平均","シカゴ・マーカンタイル取引所","シガアイト",
            "滋賀石","シガレットライター安全基準","始期付解約権留保付労働契約","始期付労働契約","式年遷宮","式年造替","子宮頸がんワクチン","子宮頸ガンワクチン","子宮頸がんワクチン",
            "資金吸収オペ","資金吸収オペレーション","資金供給オペ","資金供給オペレーション","資金洗浄","資金調達通貨","市議会議員政治倫理条例","仕組債","仕組み債","シグナス","死刑執行猶予",
            "死刑適用基準","試験焼却","刺激惹起性多能性獲得細胞","資源開発株","資源株","資源国","資源国通貨","始原生殖細胞","資源ナショナリズム","指向性爆薬","資産運用会社","資産運用型会社",
            "資産買入基金","資産買入れ基金","資産買い入れ基金","資産買入等の基金","資産管理会社","資産効果","資産項目","資産等報告書","資産等補充報告書","資産の部","資産・負債の総合管理",
            "資産保有会社","資産保有型会社","シシ国防相","シシ第1副首相","脂質滴","私事性的画像記録の提供被害防止法","紫綬褒章","市場関係者","史上最高値","史上最安値","市場参加者","市場センチメント",
            "指数寄与度","指数連動型上場投資信託","指数連動証券","システマティックリスク","システミックリスク","システム障害","システム販売","两種制度","市政倫条例","市政治倫理条例","四川省地震",
            "四川地震","私戦予備・陰謀罪","私戦予備・陰謀容疑","私戦予備及び陰謀罪","私戦予備及び陰謀の罪","私戦予備および陰謀の罪","私戦予備及び陰謀の容疑","私戦予備および陰謀の容疑","私戦予備及び陰謀容疑",
            "私戦予備罪及び私戦陰謀罪","私戦予備罪および私戦陰謀罪","私戦予備罪及び私戦陰謀容疑","私戦予備罪および私戦陰謀容疑","私戦予備・隠謀罪","私戦予備・陰謀の罪","私戦予備・陰謀の容疑","私戦予備・隠謀容疑",
            "自然エネルギー","自然災害リスクが高い都市ランキング","自然災害リスクの高い都市ランキング","自然人の移動によるサービス提供","自然被曝","自然被ばく","自然冷媒ヒートポンプ給湯機","思想の自由のためのサハロフ賞",
            "下請代金支払遅延等防止法","下請代金支払遅延等防止法違反","下請法","下請法違反","下押し","下押し要因","下影陰線","下影陽線","下抜け","下値遊び","下値固め","下値切上げ","下値切り上げ",
            "下値限定","下値切上","下値拾い","下値めど","下値模索","下値揉み合い","下値もみ合い","下値余地","下放れタスキ","下放れ二本黒","下放れ二本白黒","下ひげ","下振れ懸念","下振れ要因","下振れリスク",
            "下寄り陰引け","四大国有銀行","シダトレン","シダトレン®スギ花粉舌下液","七十七銀行女川支店訴訟","七十七銀行訴訟","七十七銀行津波訴訟","七十七銀訴訟","七十二時間の壁","七面鳥恩赦","七面鳥特赦",
            "七面鳥への恩赦","七面鳥への特赦","市町村障害者虐待防止センター","シッキム州","湿球黒球温度","執行猶予付き死刑判決","執行猶予つき死刑判決","湿式キャスク","失神ゲーム","シッターズネット","失敗学",
            "失独老人","失念株","失念株式","失望売り","指定管理者","指定廃","指定廃棄物","指定弁護士","指定暴力団","私的違法ダウンロード","私的制裁","私的整理","シドニー市場","シナモンチャレンジ",
            "支那リスク","シナロア・カルテル","シネコン","シネマコンプレックス","シノップ","シノップ原子力発電所","シノップ原発","シノフォビア","シノペ","シノペ原発","支払い線","支払手付金","支払物流",
            "四半期配当","指標連動証券","シビアアクシデント","鮪法","シビリアンコントロール","渋谷Hikarie","渋谷ヒカリエ","シブヤン海","司法取引","司法取り引き","司法取引き","司法取引制度","資本財",
            "資本財出荷","資本財出荷指数","資本準備金","資本的関係会社","資本的支出","資本逃避","死亡消費税","死亡時画像診断","死亡時画像病理診断","脂肪税","脂肪注入加工肉","脂肪注入成形肉","脂肪滴","死亡認定",
            "島市原爆死没者慰霊式並びに平和祈念式","島サミット","島根女子大生死体遺棄事件","嗜眠性脳炎","仕向け","仕向","仕向銀行","仕向け銀行","指名スト","指名ストライキ","下期決算","霜降り加工肉",
            "下山敏郎","シモーヌ・ド・ボーヴォワール賞","シモーヌ・ド・ボーヴォワール・プライズ","シモーヌ・ド・ボーボワール賞","社会起業家","社会的起業","社会的諸問題","社会保険番号","社会保障関連諸税",
            "社会保障制度改革国民会議","社会保障・税に関わる番号制度","社会保障と税の一体改革","社会保障と税の共通番号","社会保障・税一体改革","社会保障・税番号制度","借名取引","夕やけだんだんの大島桜",
            "射撃用レーダー","射撃レーダー","写真爆弾","遮水壁","車線維持支援システム","車線維持支援装置","車線逸脱警報システム","車線逸脱警報装置","車線逸脱防止支援システム","社団法人ニューメディアリスク協会",
            "車中泊","社長が選ぶ今年の社長","シャッビーハ","シャトル外交","シャドーバンキング","シャドーバンキングシステム","社内金利","社内ニート","車内泊","シャビーハ","社保国民会議","シャモット",
            "社用族","シャリア委員会","シャリア・ボード","射流","車両除却損","シャリーア委員会","シャリーア・ボード","シャルリエブド","シャルリエブド銃撃事件","シャルリエブド銃撃テロ","シャルリエブド銃撃テロ事件",
            "シャルリエブド本社銃撃テロ事件","シャルリエーブド銃撃事件","シャルリー","シャルリーエブド","シャルリーエブド銃撃事件","シャングリラ会合","シャングリラ対話","シャングリラ・ダイアローグ","上海CHAORI SOLAR",
            "上海株","上海総合指数","上海超日太阳能科技股份有限公司","上海超日太陽能科技股份有限公司","上海ディズニーランド","シャンハイディズニーランド","上海福喜食品","上海福喜食品有限公司","上海福喜",
            "シャーガス病","シャーグ・ストラウス症候群","シャープ山","衆院選挙制度改革","収益項目","収益の部","集塊性珪肺","集塊性珪肺症","就活4月開始","就活4月スタート","就活ウツ","就活うつ",
            "就活応援グッズ","就活苦自殺","就活グッズ","就活4月解禁","就活自殺","就活生のための22ヶ月手帳","就活専用手帳","就活手帳","就活便利グッズ","就活用手帳","臭化トリオキソトリアンギュレン",
            "週間騰落幅","週間騰落率","就学援助","就学援助制度","臭気コード","周期性傾眠症","秋季入学","宗教事業協会","周極渦","秋季例大祭","習近平","衆議院議員選挙制度改革","衆議院の再可決",
            "衆議院の再議決","衆議院の優越規定","衆議院比例代表制選挙区","衆議院・参議院同日選挙","集光型太陽光発電","集光型太陽熱発電","衆参W選","周産期医療","衆参ダブル選","衆参ダブル選挙","衆参同日選挙",
            "衆参同日選","衆参ねじれ国会","就職活動4月解禁","就職活動4月開始","就職活動4月スタート","就職活動グッズ","就職活動専用手帳","就職活動用手帳","収束三角形","終息宣言","収束宣言","集束爆弾",
            "修造チャレンジ","集団安全保障","集団的自衛権","集団登校事故","集中審議","集中廃棄物処理施設","集中復旧復興期間","集中復興期間","収入証紙","就農","周辺事態","終末期緩和ケアのグローバルアトラス",
            "終末期緩和ケアの世界地図","終末の音","週末要因","終夜バス","就労継続支援（雇用型）","就労継続支援（非雇用型）","就労継続支援A型事務所","就労継続支援B型","就労継続支援B型事務所","就労継続支援A型事業所",
            "就労継続支援A・B型事業所","就労継続支援B型事業所","就労支援A型・B型事務所","就労始期付解約権留保付労働契約","就労始期付労働契約","就労収入積立制度","主幹事","主幹事会社","縮小都市","縮退都市",
            "宿泊デイ","宿泊デイサービス","主権侵害事案","主権侵害事件","主権侵害事態","珠江三角洲","珠江デルタ","珠江デルタ地域","珠江デルタ地帯","手根管症候群","主市場","輸出令別表第3の地域","首相指名選挙",
            "首相談話","取水量","出庫仕分","出庫仕分け","出産工場","出産農場","出生前診断","出張授業","出願審査請求","出入国管理法","シュテファン・ヘル","首都圏直下型地震","首都高構造物の大規模更新",
            "首都高速道路構造物の大規模更新","首都高の大規模更新","首都中枢機能維持基盤整備地区","首都中枢機能維持基盤整備等地区","首都直下型地震","首都直下地震緊急対策区域","種の保存法","首班指名選挙",
            "主婦年金救済法案","主要20ヶ国・地域","主要6中央銀行","主要各国格付け","主要各国金利","主要各国政策金利","主要株価指数","主要国格付け","主要国金利","主要国政策金利","主要3指数","主要準備通貨",
            "主要政策金利","主要通貨","主要都市の高度利用地地価動向報告","腫瘍マーカー検査","主要6中銀","シュラウド","主力株","種類株","種類株式","春季例大祭","春暁ガス田","旬効果","春秋航空","春秋航空公司",
            "衆・参捩じれ国会","小1プロブレム","省エネ関連株","省エネ関連銘柄","省エネ大賞","哨戒艦撃沈事件","哨戒艦事件","消火器詐欺","消化仕入れ","消化仕入","消化方式別発行額","障害者虐待の防止","障害者虐待防止センター",
            "障害者虐待防止法","障害者権利擁護センター","障害者団体向け割引郵便制度悪用事件","障害者手帳","障害者の養護者に対する支援等に関する法律","生涯未婚率","小学館DIMEトレンド大賞","少額減価償却資産",
            "少額短期保険","少額投資非課税制度","小学校英語の必修化","小学校英語必修化","小学校の英語教育の必修化","正月用寄植盆栽","小規模保育","商業不動産担保証券","商業捕鯨","商業捕鯨モラトリアム","商業用不動産担保証券",
            "昭憲皇太后","証券仲介業","証券取引所取引","証券取引法","証券取引法会計","証券優遇税制","証拠金使用率","証拠請求","少子化危機突破タスクフォース","商社株","照射線量率","召集時解散","小水力発電",
            "小選挙区制","小選挙区比例代表併用制","小選挙区比例代表並立制","小選挙区比例代表連用制","昇地三郎","小中一貫校","省庁間作業班議会報告書","省庁間作業班報告書","所得補償制度","証取法会計","省庁間作業班議会報告書",
            "省庁間作業班報告書","所得補償制度","証取法会計","小児医療費助成","小児医療費助成制度","小児急性熱性皮膚粘膜リンパ節症候群","小児甲状腺癌","小児甲状腺がん","小児の甲状腺癌","小児の甲状腺がん",
            "証人喚問","少年兵","消費支出","消費者意識指標","消費者金融株","消費者金融銘柄","消費者態度指数","消費者庁","消費者直結型遺伝子検査","消費者物価指数","消費者物価上昇率","消費者物流","消費者マインド",
            "消費税11パーセント案","消費税還元セール","消費税11%案","消費税増税","消費税転嫁対策特別措置法","消費税転嫁対策法","消費税転嫁法","消費税に関する経過措置","消費税の経過措置","消費税の不正還付",
            "消費税不正還付","消費税法違反","消費税法の仕入税額控除制度","消費税率に関する経過措置","消費税率の経過措置","消費税率引上げに伴う経過措置","消費総合指数","消費増税","消費動向調査","証憑",
            "将来推計人口","昭和三陸地震","昭和天皇実録","職域加算","職域加算額","職域加算部分","職員基本条例","食事宅配サービス","食の架け橋賞","食の砂漠","食の砂漠問題","食品インフレ率","食品衛生法",
            "食品衛生法上の暫定規制値","食品衛生法の暫定基準値","食品衛生法の暫定規制値","食品衛生法の暫定的規制値","食品中の放射性物質に係る規格基準","食品中の放射性物質の規格基準","食品に含まれる放射性セシウムの基準",
            "食品防御","植物の新品種の保護に関する国際条約","食味評価試験","職務給制度","食物依存性運動誘発アナフィラキシー","食用廃油","食料供給力","食糧証券","食料自給力","職権斡旋","所得収支",
            "所得証明書","所得制限","所得等報告書","処分売り圧力","処分保留","書類送検","ショーグン債","ショートカバー","ショート筋","ショートセール","ショートレビュー","使用済み核燃料","使用ずみ核燃料",
            "使用済み核燃料一時貯蔵プール","使用済核燃料税","使用済み核燃料プール","使用済み核燃料棒","使用済み燃料","使用済燃料乾式貯蔵容器","使用済み燃料貯蔵プール","使用済み燃料ピット","使用済燃料プール",
            "使用済み燃料プール","私用文書等毀棄罪","白樺ガス田","白衫軍","白衫軍運動","白翎島","シリア軍事介入","シリア攻撃","シリア人権監視団","シリア騒乱","シリア停戦監視団","シリア内戦","シリコシス",
            "私立学校等授業料軽減助成","私立学校等授業料軽減助成制度","私立学校等授業料軽減補助","私立学校等入学支度金貸付","私立学校等入学支度金貸付制度","私立高等学校等授業料軽減助成","私立高等学校等授業料軽減助成制度",
            "私立高等学校等授業料軽減補助","私立高等学校等授業料軽減補助制度","私立高等学校等入学支度金貸付","私立高等学校等入学支度金貸付制度","知る沖縄戦","シルクロードエコノミックベルト","シルクロード経済帯",
            "シルクロード経済ベルト","シルクワーム地対艦ミサイル","シルクワームミサイル","シルト","シルトフェンス","シルトプロテクター","シルバーデモクラシー","シルバー民主主義","シルプロ","汁ONEカップ2012",
            "白い軍隊","白い粉","白馬事件","白シャツ軍","白シャツ運動","白シャツ軍運動","白ナイル","白ナイル川","白バス営業","白味才西古墳","白物家電","白物家電出荷額","師走相場","新安全閉じ込め設備",
            "新一般用医薬品","新エネ車","新エネ法","新エネルギー","新エネルギー車","新エネルギー政策","深海12000号","新会派","新株予約権無償割当て","新株予約権無償割当","新株予約権無償割り当て",
            "新関西国際空港","新関西国際空港会社","新関西国際空港株式会社","新幹線W7系電車","新幹線「さくら」","新幹線「はやて」","新幹線「みずほ」","新関西国際空港株式会社","新幹線W7系電車",
            "新幹線「さくら」","新幹線「はやて」","新幹線「みずほ」","新幹線E7系電車","新感染症","新幹線用電気・軌道総合試験車","新幹線リレー号","新型インフルエンザ対策特別措置法","新型インフルエンザ等感染症",
            "新型インフルエンザ等対策特別措置法","新型インフルエンザ特措法","新型インフルエンザ法案","新型インフル特措法","新型鬱","新型うつ","新型うつ病","新型栄養失調","新型オペ","新型オペレーション",
            "新型観光特急しまかぜ","新型国際放送","新型コロナウィルス","新型コロナウイルス","新型出生前診断","新型白癬","新型恙虫病","新型ツツガムシ病","新型つつが虫病","新型電子式メーター",
            "新型特急しまかぜ","新型の出生前診断","シンガポール国際エネルギー週間","シンガポール・インターナショナル・エナジー・ウィーク","新規学卒者の離職率","新規学卒者離職率","新規公開","新規参入の脅威",
            "新規上場","新規卒業者の離職率","新規卒業者離職率","真空チューブ鉄道","真空チューブトレイン","真空チューブリニア","真空チューブ列車","シンクス","ShinQs","シンクホール","真蜱","神経栄養因子",
            "新経済サミット","神経性難聴","神権政治","親権喪失","親権停止","進撃の巨人","新興株","新興国通貨","新興衰退国","進行性骨化性線維異形成症","新国立競技場","新古里原発","新古里原子力発電所",
            "新語・流行語大賞","震災遺構","震災遺児","震災関連死","震災関連離職者","震災瓦礫","震災ガレキ","震災がれき","震災がれき火災","震災救援隊","震災義援金","震災義捐金","震災供養法要","震災結婚",
            "震災孤児","震災後出生","震災失業者","震災障害者","震災自殺","震災助成金","震災追悼法要","震災特需","震災特別選抜","震災特別入学者選抜","震災特別入学選抜","震災同居","震災ドロ","震災泥棒",
            "震災内定取り消し","震災に対する助成金","震災に対する補助金","震災蠅","震災バエ","震災被害額","震災不安","震災復興","震災復興くじ","震災復興国債","震災復興助成金","震災復興税","震災復興宝くじ",
            "震災復興庁","震災復興補助金","震災法要","震災補助金","震災ボランティア連携室","震災ユニオン","震災離婚","震災離職者","震災枠入試","新司法試験","新車販売台数","神舟9号","新出生前診断",
            "身障者手帳","心神","シンジケートカバー","シンジケートカバー取引","新ジャンルビール","真珠の首飾り作戦","真珠の首飾り戦略","新常用漢字","神政","新成長戦略実現会議","新関空会社"]
        
        ReturnWordArray += wordArray
        //http://www.weblio.jp/category/business/sngjy/shi/13
        wordArray = ["新設住宅着工戸数","深セン株","深層崩壊","新卒の離職率","新卒離職率","心臓移植した マウスにオペラを聴かせると生存期間が延びる","心臓移植を受けたマウスにオペラを聴かせると長生きする",
               "心臓移植をされたマウスにオペラ椿姫を聴かせると免疫制御細胞が誘導される","心臓震盪","心臓震とう","心臓振盪","心臓振とう","心臓しんとう","心臓リハビリ","心臓リハビリテーション","新待機児童ゼロ作戦",
               "身体障害者手帳","新耐震基準","新短期プライムレート","新竹車站","新竹駅","深地層処分","シンチュー駅","シンチューステーション","新長短期排出ガス規制","シンチレックス","シンチレーションカウンタ",
               "シンチレーション検出器","シンチレータ","心的外傷後ストレス障害","神殿の丘","新党きづな","新東京駅","新東名","新東名高速道","新東名高速道路","シンドゥラクシャク","震度速報","シンドラーエレベータ事故",
               "シンドラーエレベーター事故","シンドラー社エレベーター事故","シンドラー社製エレベーター事故","シンドラー事故","新中戦車チト","新日鉄住金","新日鉄住金株式会社","侵入種","侵入窃盗","侵入盗",
               "新値追い","新年度相場","心肺停止","心肺停止状態","心肺停止の状態","新発国債","審判不開始","シンフェロポリ","シンフェローポリ","親米経済圏","新南群島","信用売り残","信用売残","信用買い残",
               "信用買残","信用緩和","信用毀損及び業務妨害","信用三階建て","信用事由","信用二階建て","信用倍率","信用問題","信頼できる渡航者制度","侵略的外来種","新緑風会","CEPA","CME225先物",
               "CLO","CAR細胞","CO2見える化","C型小惑星","シーシェパード","シーシー国防相","シーシー第1副首相","CBIRF","CBCL","CP等買現先オペ","シーメンス法","シールド削進機","シールドマシン",
               "シーレーン"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["スィノプ","水圧破砕","水圧破砕法","水域表示","水棺","水棺計画","水観測衛星","水銀条約","水銀に関する水俣条約","水銀水俣条約","水源地域保全条例","水源地買収問題","水産業復興特区","水産特区",
                "水質汚濁防止膜","水晶島","水蒸気爆発","水蒸気噴火","スイスショック","スイスフランショック","水素スタンド","水素ステーション","水中カーテン","水中文化遺産","スイッチOTC薬","スイッチOTC",
                "スイッチ直後品","膵島β細胞","水稲作況指数","膵島ベータ細胞","水ビジネス","水平環","水平多関節ロボット","水没冷却","睡眠薬強盗","睡眠預金","水面倉庫","水理破砕","スイングトレード",
                "スイング・ステート","数次ビザ","スカイパワー合同会社","スカイマーク","スカイマークエアライン","スカイマークエアラインズ","スカボロ礁","スカボロー礁","スカラロボット","菅降ろし","菅義偉",
                "菅原ビランジ","スガワラビランジ","スキミングプライシング","スキュー","SKU","杉原千畝","スクレイピー","スクート","スクールランチ","スクール・ニューディール","スクール・ニューディール政策",
                "為券","スコットランド国民党","スコットランド独立","スコットランド独立運動","スコットランド独立問題","スコットランドの独立","スコットランドの分離独立","スコットランド民族党","巣篭もり消費",
                "巣ごもり消費","すし外交","寿司外交","スシ外交","スシ債","STAP細胞論文問題","スタンダードミサイル3","スタンドアップミーティング","スチバーガ","スチバーガ錠","スチバーガ®錠","スティーブンス・ジョンソン症候群",
                "スティーブンス・ジョンソン・シンドローム","スティープ化","捨子線","捨て子線","ステファン・ヘル","ステーション・ブラックアウト","ステープ・トゥアクスパン","スデイリ7","スデイリセブン","ストップ&フリスク",
                "ストップ高張付き","ストップ高買い気配","ストップ高崩れ","ストップ高張り付き","ストップ高比例配分","ストップ安売り気配","ストップ安崩れ","ストップ安張付き","ストップ安張り付き","ストップ安比例配分",
                "ストップロス売り","ストップロス買い","ストップロス注文","ストップ・アンド・フリスク","ストップ・オンライン・パイラシー・アクト","ストラテジック・フォーカスティング","ストラトフォー",
                "ストレンジレイク鉱床","ストロングスマートグリッド","ストロングゼロ","ストロンチウム","ストロンチウム91","ストロンチウム90","ストーカー規制法","ストーカー禁止命令","ストーカー行為禁止命令",
                "ストーカー行為等の規制等に関する法律","ストーンヘンジ","ストーンヘンジ巨石遺跡","ストーンヘンジ巨石群","砂川事件","砂川紛争","砂時計経済","スネップ","SNEP","スノウマゲドン","スノーマゲドン",
                "スパルティナ・アルテルニフロラ","スパン証拠金","スピントロニクス","スピンドクター","スピーチ・ジャマー","SPEEDI問題","スプラトリー諸島","スプリングエイト","SPring-8","スプリント",
                "スプリントA","スプリントエー","SPRINT-A","スプリント・ネクステル","スプリント・ネクステル・コーポレーション","スプリント・ネクステル・コーポレーション","スプレー強盗","天皇の政治的利用",
                "天皇の政治利用","スペイン南部大地震","スペイン列車脱線事故","スペシャル301条","スペースX社","スペースX","スペースクラブ","スペースシップ2","スペースシップツー","スペースデブリ","スペースデブリ掃除衛星",
                "スペースブランケット","スペースポート","スペースポート・アメリカ","スペースローンチシステム","スポットスキャニング","スポットスキャニング照射法","スポーツ基本法","スポーツ基本法案",
                "スポーツ権","スポーツ庁","スポーツ立国戦略","スマ","すまい給付金","スマガツオ","スマトラ島沖地震","スマフォ関連株","スマフォ関連銘柄","スマフォ銘柄","スマホ歩き専用歩道","スマホ歩き用歩道",
                "スマホ関連株","スマホ関連銘柄","スマホ税","スマホ銘柄","スマホ・タブレット税","スマラン事件","スマートアプライアンス","スマート家電","スマート化","スマートグリッド","スマートグリッド展",
                "スマートコミュニティ","スマートコミュニティ・アライアンス","スマートコンセント","スマートシティ","スマートディフェンス","スマート電力網","スマートハウス","スマートハウス実証プロジェクト",
                "スマートビル","スマートフォン関連株","スマートフォン関連銘柄","スマートフォン銘柄","スマートプラグ","スマート変電所","スマート防衛","スマートメーター","スマート輸送","スマート・ネットワークプロジェクト",
                "スモッグ","李顯龍","李ライン","スュンフェロポリ","スラッジプラント","スラップ","スリオン","スリーティージー","3TG","3D写真館","スリープテキスティング","スリープテキスト",
                "スリーマイルアイランド原発事故","スリーマイルアイランド事故","スリーマイル原発","スリーマイル島原子力発電所","スリーマイル島原発","スリーマイル島原発事故","スリーマイル島原子力発電所事故"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/se/4
        
        wordArray = ["スレブレニツァの虐殺","スレブレニツァの悲劇","スロー地震","スロースリップ","スロースリップ現象","スローライフ","スワップ協定","酢排骨","スーパーアース","スーパーイソフラボン","スーパーイングリッシュティーチャー",
                 "スーパークールビズ","スーパーグッピー","スーパーグローバル大学","スーパーグローバルハイスクール","スーパーコロニー","スーパーストーム","スーパーストーム・サンディ","スーパーセル","スーパーゼネコン",
                 "スーパー耐性菌","スーパー台風","スーパータイフーン","スーパーチューズデー","スーパー堤防","スーパー能","スーパーバグ","スーパーフレア","スーパー噴火","スーパーボルケイノ","スーパーボルケーノ",
                 "スーパーポンパー","スーパームーン","スーパーメガホームセンター","スーパー薬剤耐性菌","背赤後家蜘蛛","セアカゴケグモ","西海フェリー沈没事故","生活意識に関するアンケート調査","生活家電",
                 "生活の党","生活費インデックス","生活費指数","生活不活発病","生活保護","生活保護法改正案","生活保護法改正法案","生活用水","青瓦台","請願法","正規社員の解雇規制緩和","性急な一般化",
                 "請求放棄","成型炸薬","成型肉","成形爆薬","政見放送","政権与党","制裁課税","制裁金","制裁決議","政策会議","政策協定","政策銀行","政策コンテスト","政策仕分け","政策性銀行","政策税制",
                 "政策税制措置","政策調査会","西沙諸島","清算価値","清算機関","生産者配送センター","生産者物流センター","生産者流通センター","製紙株","政資法","製紙銘柄","正社員の解雇規制緩和","生殖補助医療",
                 "生食用牛肉","生食用牛肉の表面加熱処理","生食用食肉","生食用食肉等の安全性確保について","生食用食肉の衛生基準","青書と白書の違い","精神科デイケア","精神毒性","政治資金規正法",
                 "政治主導","政治倫理綱領","政治倫理審査会","政治倫理条例","成人年齢","成人年齢下げ","成人年齢の引下げ","成人年齢の引き下げ","成人年齢引き下げ","成人発達障害","聖戦士ラッパー","生前退位",
                 "青草臭","製造間接費","製造直接費","生存への72時間の壁","生存率が急激に低下するといわれる72時間の壁","生体規範技術","生体規範工学","声帯結節","生体腎移植","生体模倣","生体模倣技術",
                 "生体模倣工学","聖誕教会","生誕教会","政調会長","成長痛","正庁の間","政党交付金","制動装置不良","成年後見選挙権訴訟","製品評価技術基盤機構","整備新幹線","政府関係機関債",
                 "政府高官","政府債務","政府首脳","政府筋","政府声明","政府専用機","政府税制調査会","政府税調","政府調達","政府調達協定","政府調達に関する協定","政府通信本部","政府のオープン化",
                 "政府保有株","政府保有株式","政府・民主三役会議","セイフ・イスラム","生物学的半減期","生物規範技術","生物規範工学","生物模倣","生物模倣技術","生物模倣工学","性分化疾患","政務3役",
                 "政務三役","政務三役会議","政務調査費","生命維持における72時間の壁","生命居住可能領域","生命之環","生命の環","西洋のイスラム化に反対する愛国的欧州人","西洋のイスラム化に反対する愛国的な欧州人",
                 "西洋のイスラム化に反対する愛国的ヨーロッパ人","西洋のイスラム化に反対する愛国的ヨーロッパ人","西洋のイスラム化に反対する欧州の愛国者","整理銘柄","勢力線","政倫審","政倫条例",
                 "セウォル号","セウォル号沈没事故","セヴァストポリ","セヴァストポリ市","セヴァストポリ特別市","セヴァストーポリ","セヴァストーポリ市","セヴァストーポリ特別市","世界3大研究不正",
                 "世界6中央銀行","世界6中銀","世界ウイグル会議","世界影響力番付","世界影響力ランキング","世界エネルギーアウトルック","世界エネルギー展望","世界汚職国家ランキング","世界革新企業100",
                 "世界革新企業100社","世界株安","世界株安連鎖","世界緩和ケア連合","世界記憶遺産","世界危機遺産","世界経済フォーラム年次総会","世界最悪のCEO","世界最悪の経営者","世界最悪のボス",
                 "世界災害報告","世界三大研究不正","世界三大不正","世界3大不正","世界ジオパーク","世界地震ハザード評価プログラム","世界10大ニュース","世界大学ランキング","世界潮流2030","世界で最も影響力のある100人のリスト",
                 "世界で最も影響力のある人物","世界でもっとも影響力のある人物","世界で最も影響力のある人物ランキング","世界で最も影響力のある100人","世界で最も影響力のある有名人","世界で最も危険な都市ランキング",
                 "世界統一賃金","世界統一賃金制度","世界同時株安","世界の3大不正","世界の3大研究不正","世界の動き社","世界の技術革新力ランキング","世界の工場","世界の三大研究不正","世界の三大不正",
                 "世界の腐敗認識指数","世界ファッション都市ランキング","世界腐敗認識インデックス","世界腐敗認識指数","世界文明フォーラム","世界平和度指数","世界報道自由度ランキング","世界報道自由ランキング",
                 "世界水フォーラム","世界連鎖株安","セカンダリーマーケット","咳エチケット","積算線量","積算線量の推定値","積算放射線量","赤十字社","石炭ガス化コンバインドサイクル発電","石炭ガス化複合発電",
                 "堰止湖","せき止め湖","堰き止め湖","セキュリティダイアモンド","セキュリティダイヤモンド","セキュリティダイヤモンド構想","石油証券","石油列車","セクスティング","セグウェイ","セグウェイ・パーソナルトランスポーター",
                 "セシウム134","セシウム137","セシウム汚染疑い牛肉","セシウム汚染牛","セシウム汚染肉","セシウム汚染米","セシウム吸着装置","セシウム吸着塔","セシウム米","セシウム焼却灰","セシウム腐葉土",
                 "世襲議員","世相ブラ","世俗派","セタス","セタス・カルテル","セチリスタット","積極的平和主義","摂取制限","窃盗犯","切迫早産","節電啓発担当大臣","節電啓発担当相","節電シフト","節電商戦",
                 "節電熱中症","節電ビズ","節電メニュー","節分天井","セディバ猿人","瀬戸際戦術","瀬戸際戦略","セバストポリ","セバストポリ市","セバストポリ特別市","セバストーポリ","セバストーポリ市",
                 "セバストーポリ特別市","セブン-イレブンの四国進出","セブン-イレブンの四国出店","セブンスポット","政務活動費","政務活動費用","セリウム","セリウム143","セリウム144","セリウム放射性同位体",
                 "セルインメイ","セルオンラリー","セルロースナノファイバ","セルロースナノファイバ素材","セルロースナノファイバー","セルロースナノファイバーはなぜ透明か","セレカ","繊維筋痛症","線維筋痛症","線維素",
                 "繊維素原","千円貨幣","千円銀貨幣","千円銀硬貨","千円硬貨","潜特型","浅海域","浅海域","尖閣寄附金","尖閣国有化","尖閣諸島","尖閣諸島寄附金","尖閣諸島購入構想","尖閣棚上げ論","選挙7つ道具",
                 "選挙運動に関する収入及び支出の報告書","選挙運動費用収支報告書","選挙互助会","選挙支援物資","選挙制度改革","選挙七つ道具","選挙の自由妨害罪","選挙の七つ道具","遷御の儀","先駆導入加算",
                 "千家国麿","先行景気動向指数","先行指数","先行指標","先行DI","戦後50周年の終戦記念日にあたって","戦後50周年の終戦記念日にあたっての村山首相談話","戦後最高値","戦後最安値","戦後体制",
                 "戦後レジーム","殲-31","潜在成長率","先進7ヵ国蔵相会議","先進7ヵ国財務相中央銀行総裁会議","先進技術実証機","先進国における子供の幸福度調査","先進国における子供の幸福度","戦時作戦統制権",
                 "戦術核","戦術核兵器","戦術行動線","戦術措置線","潜水艦発射弾道ミサイル","戦争や武力行使をしない日本に生存する権利","選択的債務不履行","選択的デフォルト","選択的不履行","仙台ウィルス",
                 "仙台中央食肉卸売市場","浅地中処分","浅地中トレンチ処分","浅地中ピット処分","セントレックス","先導株","先導銘柄","殲-20","専任閣僚","船舶貨物検査法","船舶のバラスト水および沈殿物の規制および管理のための国際条約",
                 "船舶バラスト水及び沈殿物の制御及び管理に関する国際条約","センポ・スギハラ","選民思想","占有離脱物横領罪","占有率リベート","戦略核","戦略核兵器","戦略的互恵関係","線量計","線量限度","線量当量率"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/so/2
        
        wordArray = ["ソイレント","創エネ","創エネルギー","総括原価方式","総額表示","総額表示方式","総額方式","早期勧奨退職","早期警戒管制機","早期採決","早期採取","葬儀ビジネス","創業板","創業支援推進機構","総合こども園",
                 "総合取引所構想","相互保有株式","草志会","総資本増加率","総辞職","総総分離","創造学園大学","創造産業","創造的文化産業","相対的政治犯","相対的貧困","相対的貧困率","総代分離","送致件数","想定買付金額",
                 "想定為替レート","想定津波高","送電受託","孀婦岩","総報酬割","総報酬割り","創薬支援ネットワーク","総与党","総量規制","藻類バイオ燃料","藻類バイオフューエル","藻類バイオマス燃料","早老症","早老症候群",
                 "租特","租特透明化法","疎開企業","組閣本部","蘇岩礁","即発超臨界","即発臨界","即発臨界状態","底打ち","ソコトラ岩","底値固め","底値圏","ソシアルビル","組織対策費","組織的な犯罪の処罰及び犯罪収益の規制等に関する法律",
                 "組織的犯罪処罰法","組織犯罪処罰法","租税公課","租税特別措置","租税特別措置透明化法","租税特別措置透明化法","育爺","育ジイ","ソチオリンピック","ソチ五輪","ソチ五輪期間中の休戦","ソチ五輪期間中の停戦",
                 "ソチ五輪休戦","ソチ五輪停戦","措置命令","卒原発","その原因および結果に関する特別報告者","その他刑法犯","その年の顔","ソフトドリンク・ケトーシス","ソフトパッチ","ソフト闇金","ソブリンシーリング",
                 "ソブリンシーリング制","ソブリン・リスク","ソヘフェリー沈没事故","粗暴犯","ソマリア沖海賊対策","ソマリア沖海賊の対策部隊派遣","ソマリア大干ばつ","蘇民祭","ソユーズ","ソユーズ宇宙船","素粒子の標準理論",
                 "ソレノドン","ソロスチャート","損益分岐点","損益分岐点売上高","損益分岐点販売数量","損害賠償命令","損切り","損失計上先送り","損傷貨幣","損傷銀行券","損傷紙幣","樽爆弾","徐敬徳","ソ・ギョンドク",
                 "ソー活","ソーカツ","ソーサートップ","ソーサーボトム","ソーシャルアントレプレナー","ソーシャルビル","ソーシャルベンチャー","ソーシャルメディアリスニング","ソーシャルリスニング","ソーシャル・ビジネス",
                 "ソーホー","SOHO","ソーラーアレイ","ソーラーインパルス","ソーラーシェアリング","ソーラーセイル","ソーラーセル","ソーラーランタン"]
        
        ReturnWordArray += wordArray
        
        
        //http://www.weblio.jp/category/business/sngjy/ta/2
        wordArray = ["耐圧強化ベント","体育家庭教師","対イラン経済制裁","対イラン制裁","対衛星攻撃ミサイル","対衛星兵器","対衛星ミサイル","対円","対円レート","対大蔵省折衝担当者","大韓航空ナッツ騒動","大韓航空ナッツリターン騒動",
                 "対外公約","対外債権国通貨","対外債権超過国","対外債務国通貨","対外債務残高","対外債務超過国","対外純債権国","対外純債務国","対外有償軍事援助","大気汚染指数","大気圏再突入","大気圏突入","大気圏内核実験",
                 "大気質指数","待機児童ゼロ特命チーム","待機児童","待機児童ゼロ作戦","待機児童ゼロ横浜方式","待機児童対策横浜方式","対北朝鮮制裁","耐久財","耐久財新規受注統計","耐久消費財","太極道マウル","太極道村",
                 "タイ洪水","対顧客電信売相場","対顧客電信買相場","対顧客電信相場","対顧客電信仲値相場","大使召還","大衆紙","大衆薬のネット販売","大正型関東地震","対称脅威","退職勧奨","対シリア軍事介入","耐震強化岸壁",
                 "耐震設計","耐震バース","耐震マーク","太地町","太地町立クジラの博物館","太地町立くじらの博物館","タイジホエールミュージアム","体重別航空運賃","体重別料金","体重別料金システム","体重別料金制",
                 "耐性ウィルス","耐性ウイルス","耐性菌","タイタニック2","タイタニック2号","タイタノサウルス","対地接近警報装置","対中ODA","対中国貿易協定問題","対中貿易協定問題","対ドル","対ドル相場","対ドルレート",
                 "対日作戦","台風15号","台風15号「ロウキー」","太平洋3カ国間経済緊密化パートナーシップ","太平洋間戦略経済連携協定","太平洋・島サミット","太平洋諸島フォーラム","太平洋リバランス","太平洋レアアース巨大鉱床",
                 "台北101","大麻合法化","タイム","TIME","タイム100","タイム誌","タイムホール","タイヤ株","タイヤ銘柄","太陽花学運","太陽極域磁場の反転","太陽極域磁場反転","太陽系外惑星","太陽光サーチャージ",
                 "太陽光発電株","太陽光発電の余剰電力買取制度","太陽光発電銘柄","太陽性網膜症","太陽節","太陽電池アレイ","太陽電池ストリング","太陽電池セル","太陽電池セル・モジュール","太陽電池搭載車","太陽電池モジュール",
                 "太陽熱温水器","太陽熱利用システム","太陽の磁極反転","太陽の党","太陽の船","太陽帆","太陽面通過","太陽網膜症","台湾糸巻鱏","台湾漁船銃撃事件","台湾国会議場占拠事件","台湾国会占拠事件",
                 "台湾ヒマワリ学運","台湾ひまわり学運","台湾立法院議場占拠事件","台湾立法院占拠事件","台湾立法府議場占拠事件","台湾立法府占拠事件","タウンミーティング","鷹返し","多核種除去設備アルプス","多核種除去設備ALPS",
                 "高潮堤","高台移転","タカナワアイト","高縄石","高値安定","高値覚え安値覚え","高値おぼえ安値おぼえ","高値固め","高値圏もみ合い","高値面合わせ","高値抜き","高値引け","高値もみ合い","高値もみあい",
                 "高値寄り","高円宮家典子様","高円宮典子","高円宮典子さま","高円宮妃久子","高円宮妃久子さま","高円宮妃久子殿下","高安まちまち","多器官障害","多器官不全","卓越した技能者","宅食","託送供給","たくり線",
                 "竹島問題","竹嶋一件","竹島一件","竹島共同管理案","竹島に関する動画","竹島の日","竹田城","竹田城跡","多国間EPA","多国間FTA","多国間経済連携協定","多国間自由貿易協定","蛸配","タコ配","蛸配当",
                 "タコ配当","多剤耐性菌","タジキスタンのWTO加盟国入り","タジキスタンの世界貿易機関への加盟","タジキスタンのWTO加盟","多重為替レート","多重事故","多重事故過失相殺率","多重事故過失割合","多重バリア",
                 "タスキジー研究","タスキジー実験","タスキーギ梅毒実験","助け合いジャパン","助けあいジャパン","多臓器不全","タタ自動車","タタメット","タタ・モーターズ","タタールの軛","立川断層帯","曻地三郎",
                 ]
        
        
        
        ReturnWordArray += wordArray
        
        
        return ReturnWordArray

    }
}
