//
//  JijiWord.swift
//  Hassouseisei_ver_2_0
//
//  Created by 岡大輔 on 2015/03/16.
//  Copyright (c) 2015年 岡大輔. All rights reserved.
//

import Foundation

class JijiWordStore: WordStore{
    class func returnCaption() -> String{
        return "時事用語"
    }
    
    class func ReturningWordArray() -> Array<String>{
        var ReturnWordArray:[String] = []
        
        //http://www.weblio.jp/category/business/sngjy
        
        var wordArray = ["アイアムケンジ","ISD条項","ＩＸＶ","IFO注文","ILOグローバルリポート","アイオリス山","アイサイト","アイサイトカメラ","アイザーウェイ","アイシル","ICT維新ビジョン","ICT教育","アイスカップヌードル",
             "アイスクエイク","アイスバケットチャレンジ","アイスバケツチャレンジ","アイスバーグ・スケーティング・パレス","アイスル","ISIL","アイセック","アイソトープ電池","アイソン彗星","Iターン就農","IWG報告書","IT関連銘柄",
             "アイヌ象徴空間","アイヌ文化象徴空間","アイヌ民族象徴空間","アイヌ民族党","アイヌ民族の共生の象徴となる空間","相乗り衛星","あい乗り衛星","相乗り候補","相乗り小型衛星","相乗り小型副衛星","アイピーシーシー",
             "IPCC","アイボール","i-Ball","アイミーブ","IUU","アイランドリバーサル","アイルワースのモナリザ","アイルワース版モナリザ","アウストラロピテクス・アファレンシス","アウストラロピテクス・セディバ",
             "アウターライズ","アウターライズ地震","アウトパフォーム","アウトブレイク","アウトライト","アウトライト取引","青い森信金","青色LED","青色発光ダイオード","青葉アルコール","青海・台場クロスウォーク",
             "赤色警報","赤警報","赤坂議員宿舎","赤坂衆議院議員宿舎","赤三兵","赤三兵先詰まり","赤三兵思案星","暴対法","暴追放センター","赤字国債","赤ちゃん工場","あかちゃんポスト"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/aa/2
        
        wordArray = ["アカデミー名誉賞","赤髭対象","赤ひげ大賞","赤水図","空き家対策の特別措置法","空き家等適正管理条例","空き家等の適正管理に関する条例","空き家の管理条例","秋学期入学","商い3年","商い三年","秋入学",
            "秋の5連休","秋の園遊会","秋の例大祭","秋葉原無差別殺傷事件","空き家管理条例","空き家対策法","空家等対策の推進に関する特別措置法","アクアトップディスプレイ","アクサ","アクシーズ・ジャパン証券株式会社",
            "アクシーズ・アメリカ","アクセプタンス","アクタ","芥川賞選考委員","アクティブラーニング","アク抜け感","あく抜け感","アクロ研究所","アグザム・インベストメント","アグゼス・アメリカ","アグニ5ミサイル",
            "アグニファイブミサイル","アグニ5","上げ足の差し込み線","上げ三法","上げ過ぎ感","上げ転換","上げトレンド","上げの2つ星","上げの3つ星","上げの二ツ星","上げの二つ星","上げの三ツ星","上げの三つ星",
            "上げ幅","上場投資証券","上場投信","上げ余地","アコード","朝霞公務員宿舎","浅川ダム","朝高","アサド政権","アサハンアルミニウム計画","アサハンアルミニウム事業","アサハン開発事業","アサハン計画",
            "アサハン事業","旭大","旭重","旭中","旭双","旭単","朝安","足場の壁つなぎ","足踏み状態","アジア安全保障会議","アジアカップ","アジア株","アジア株式","アジア競技大会"]
        
        //http://www.weblio.jp/category/business/sngjy/aa/3
        
        ReturnWordArray += wordArray
        
        wordArray = ["アジア競技大会","アジア時間","アジア時間帯","アジア太平洋自由貿易圏","アジア太平洋自由貿易地域","アジア大会","アジア中南米協力フォーラム","アジアビジネスサミット","アジア銘柄","アジアリバランス",
            "アジア・ゲートウェイ構想","アジア・ダウ","紫陽花革命","アジサイ革命","あじさい革命","アジュバントによる自己免疫・炎症性症候群","アジュバント病","アジュバント誘発性自己免疫・炎症性症候群","アスキアの墓",
            "アストゥリアス皇太子賞","アスベストはい","アスペルガー障害","アスペルガー症候群","アスペルガーシンドローム","預り保証金","アセアン株","アセアン株式","アセアン中国FTA","ASEAN+6","ASEAN+3","アセアン・韓国FTA",
            "アセタミプリド","アセットバック証券","アタカマ大型ミリ波サブミリ波干渉計","アタックス","ATACS","アタック・オン・タイタン","新しい人権","新しい政策研究会","新しい普通","新しい歴史教科書をつくる会",
            "アダプティブクルコン","アダプティブクルーズコントロール","アダプト制度","アチェ","アチェ州","圧縮空気機関","圧縮空気車","アッシーシ国防相","アッシーシ第1副首相","斡旋収賄罪","あっせん収賄罪","アップトレンド",
            "アップルウオッチ","アップル関連株","アップル関連銘柄","暑さ指数","圧力鍋爆弾","圧力抑制室","圧力抑制室用貯水タンク","圧力抑制プール","我的夢","あて首線","阿寺断層","アディズ","アディポソーム","アディポネクチン",
            "アディポロン","阿寺断層帯","アトキンソンサイクル","アトサイト","後方かかえ込み2回宙返り3回ひねり","アドバンストコンバインドサイクル発電","穴あきダム","アナカルジン酸","アナカルディック酸"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["アナカルド酸","アニマルロス","アニュアルリポート","アニュアルレポート","アノイリナーゼ","アノニマス・イベロアメリカ","アバスチン","アパルトヘイト","アパルトヘイト政策","アビガン","アビガン錠","アフガニ",
            "アフガニスタン侵攻","アフガニスタン銃乱射事件","アフガニー","アフガン銃乱射事件","アフガン紛争関連資料公開事件","アフガン乱射事件","アフターフォー","アフター4","アフラトキシン","アフリカ開発会議","アフリカ大旱魃",
            "アブソーバ","アブデラズィズ・ブーテフリカ","アブデルアジズ・ブーテフリカ","アブデル・ファタハ・シーシ","アブドルジャリル","アブドルファッターフ・アッ＝シーシー","油券","アブ・サリーム刑務所","アブ・バクル・アル・バグダディ",
            "アブ・バクル・バグダディ","アブー・サリーム刑務所","安倍色","安倍カラー","安倍外交","安倍晋三","安倍ドクトリン","あべのハルカス","アベノミクス","アベノミクス解散","アベノミクス三本の矢","アベノミクス3本の矢",
            "アベノミクス戦略特別区","アベノミクス戦略特区","アベノミクス第4の矢","アベノミクス疲れ","アベノミクス特区","アベノミックス","アベノリスク","アポカリプティックサウンド","アホロートル","アポロ宇宙船",
            "アポロ司令船・機械船","雨傘革命","尼崎JR脱線事故","天下り監視委員会","天下り監視委","天下り禁止","天国から帰った少年","あまサミット 別名：アマサミット","海女サミット","アマゾン税","アマゾン・プライム・エアー",
            "アミロイドβ","アミロイドβ蛋白","アミロイドβタンパク","アミロイドβ蛋白質","アミロイドベータ蛋白","アミロイドベータタンパク","アミロイドベータタンパク質","アミロイドβタンパク質"]
        
        ReturnWordArray += wordArray
        
        
        //http://www.weblio.jp/category/business/sngjy/aa/5
        wordArray = ["アミロイドベータ蛋白質","アミロイドベータプロテイン","アムダ","AMDA","アメイジア","アメイジア大陸","アメリカEU自由貿易協定","アメリカ軍軍属","アメリカ運輸省道路交通安全局","アメリカ欧州連合FTA",
            "アメリカ欧州連合自由貿易協定","アメリカ株","アメリカ株式","アメリカ外交公電Wikileaks流出事件","アメリカ合衆国運輸省道路交通安全局","アメリカ金塊先物相場","アメリカ金融規制改革法","アメリカ軍属","アメリカ鉤虫",
            "アメリカ黒人青年射殺事件","アメリカ国家安全保障局","アメリカ証券業協会","アメリカ時間","アメリカ時間帯","アメリカ同時多発テロ","アメリカナマズ","アメリカ白人警察官による黒人射殺事件","アメリカ銘柄",
            "アメリカライフル協会","アメリカ・韓国間FTA","アメリシウム","アメーバ経営","アユモドキ","新たな国土のグランドデザイン","新たな常態","新たな地域名表示ナンバープレート","新たな電波の活用ビジョンに関する検討チーム",
            "アラビア半島のアルカイダ","アラビア半島のアルカーイダ","アラファト","アラファト議長","粗付加価値","アラブ人街","アラブの春","アラブ街","粗利益率","粗利率","アラル海","露軍グルジア侵攻","アリアン5",
            "アリス・アン・マンロー","アリス・マンロー","アリピプラゾール","アリューシャン列島","アリラン3号","アルカンサ旅団","歩きスマホ専用歩道","歩きスマホ用歩道","アルクチゲニン","アルコール性肝障害",
            "アルコール専売事業","アルゴリズム取引","アルシャバブ","アルジャジーラ","アルストムグリッド","アルセニ・ヤツェニュク","アルセニー・ヤツェニュク","アルバート・ラスカー医学研究賞","アルビン・ロス",
            "アルファシヌクレイン","アルマ","ALMA","アルマ望遠鏡","アルメニア原発","アル・カンサ・ブリゲード","アル・ヌスラ戦線","アレヴァ","アレクサンドル・トゥルチノフ","アレッポ","アレバ"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/aa/6
        
        wordArray = ["アレルギー性肉芽腫性血管炎","アローヘッド","アローワンス","アンギオテンシン2受容体遮断薬","アングレーム国際漫画祭","暗黒エネルギー","暗黒物質","アンシステマティックリスク","安心子ども基金",
             "アンジオテンシンII受容体拮抗薬","アンジオテンシン2受容体拮抗薬","安重根記念館","安重根義士記念館","安重根","アンジュングン記念館","安全資産","安全通貨","安全の鐘","安全保障担当大臣","安全保障担当相",
             "安全保障ダイヤモンド","安全保障のダイアモンド","安全保障法制担当相","安全保障法制担当大臣","安全保障理事会決議1874","安息香酸ナトリウムカフェイン","アンタレスロケット","アンダーパフォーム","アンチGLBT",
             "アンチLGBT","アンチアマゾン法","アンチサテライトウェポン","アンチサテライトミサイル","アンチ菅","アンチバラカ","安哲秀","アンチョルス","アンチ・ダンピング関税","アンドラペセタ","アンドルー王子",
             "アンドロイドガラケー","Androidガラケー","アンナカ","アンネの日記","アンビシャス","アンビシャス市場","アンピンシャ","アンフィレギュリン","アンフィレグリン","アンブレラレボリューション","アンブロークン",
             "アンペア下げ","安保相","安保理改革","安保理決議","アンミス","UNMISS","UNMIS","アンメットメディカルニーズ","安龍福","アンレバードベータ","アンレバードβ","アンワインド","アン・ヨンポク","アークホーン",
             "アースアワー","アートメイク","アートメイク・タトゥー","アーニングサプライズ","アーリーハーベスト","アールオーシー","RO膜","Rce1タンパク質","RJCカーオブザイヤー","RCEP","RDF発電"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/ii
        
        wordArray = ["伊400型","伊400型潜水艦","委員長解任決議","言う吉くん","言うだけ番長","云南地震","イェタグンガス田","家電銘柄","イエメンリアル","イエメンリヤル","イエメンリヤール","家歴書","イエロールート",
              "硫黄島","魚の水域表示","イオン吸着型の鉱床","イオン吸着型のレアアース鉱床","イオン吸着型レアアース鉱床","イオン吸着型鉱床","伊方原子力発電所","伊方原発","伊方発電所","依願退職","行き詰まり線",
              "域内包括的経済連携","イギリスGCHQ","イギリス重大不正捜査局","イギリス政府通信本部","イギリスの政府通信本部","育英資金","いくさの子","いくさの子－織田三郎信長伝－","イクジイ","育児休業基本給付金",
              "育児休業給付金","育児休業者職場復帰給付金","育児用粉ミルク","育鵬社版教科書","育メン","イクメン","イクメンの素","イクランドラコ・アバタル","イクランドラコ・アバター","遺訓統治","イグナリナヴィサギナス原発",
              "イグナリナ原子力発電所","イグニッションスイッチ","イグノーベル賞","イグノーベルプライズ","犠牲祭","イコモス","伊號第四百型潜水艦","鯨資源","諫早湾干拓開門請求訴訟","諫早湾干拓事業訴訟","諫早湾干拓訴訟",
              "イサンドゥク","李相得","イサンドク","石井部隊","石撃ち","石打ち","石撃ち刑","石打ち刑","石撃ちの刑","イシスクソコラグランプリ","石投げの刑","石原グランドチルドレン"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/ii/2
        
        wordArray = ["石原グランドチルドレン","石原グループ","石原慎太郎新党","石原新党","石破茂","異種トレ","異種トレード","石綿肺","維新8策","維新政治塾","維新の会分党","維新の党","維新八策","維新版船中八策","維新分党",
              "異次元金融緩和","維持保証金","イスカンダル作戦","イスカンダルプロジェクト","イスカンダル・バイオプロジェクト","イスカンデル","イスダ","ISDA","イスラミックステート","イスラム学者委員会","イスラム国",
              "イスラム聖戦士血盟団","イスラム・マグレブ諸国のアルカイダ組織","イスラム街","イスラム・マグリブ諸国のアルカイダ組織","イスラム・マグレブ諸国のアルカイダ","イスラム・マグレブ諸国のアルカイダ機構",
              "イスラーム国","イスラーム・マグリブ諸国のアルカイダ組織","イスラーム・マグレブ諸国のアルカイダ組織","出雲氏","出雲国造家","伊勢原断層","伊勢二見メガソーラー光の街","磯焼け","イソリクイリチゲニン",
              "遺族生活資金","板","イタイイタイ病","委託介入","委託仕入れ","委託仕入","委託物流","痛四股名","板状況","痛スイカ","痛Suica","板寄せ方式","イタリア危機","イタリア債務危機","イタリア財政危機",
              "一院制","一月効果","1月効果","1月バロメーター","1区間割引","一国家二制度","一次卸","一次卸業者","一時帰宅同意書"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/ii/3
        
        wordArray = ["一時国有化","一時貯蔵プール","一事不再議","一時亡命","一人別枠方式","一日契約","1年間4学期制","一部執行猶予","一覧払輸出手形買相場","一覧払輸入手形決済相場","一類感染症","一個中國","一個中國原則",
            "一括交付金","一国两制","一国二制度","一国両制","一式双発高等練習機","一式双発高練","1者応札","一斉帰宅","一斉帰宅抑制の基本方針","イッセン・ハブレ","一致DI","一致指数","一致指標","一兆ドル貨幣","一兆ドル硬貨",
            "1兆ドル硬貨","一店一帳合制","イットガール","一般会計総額","一般化社会拠出金","一般勘定","一般教書","一般教書演説","一般気配","一般財団法人","一般社会税","一般社団法人","一般信用取引","一般世帯",
            "一般特恵関税制度","一般特恵制度","一般の地下利用に対し十分に余裕を持った深度への埋設","一般廃棄物処理手数料減免申請書","一般廃棄物処理手数料減免等申請書","一般廃棄物搬入申請書","一般用医薬品",
            "一票の重みの不平等","一票の格差","1票の格差","一本値","遺伝学的検査事業","遺伝学的検査ビジネス","遺伝子組み換え細菌","遺伝子組み換え添加物","遺伝子組み換え微生物","遺伝子検査事業","遺伝子検査ビジネス",
            "遺伝子診断ビジネス","遺伝子治療薬"]
        
        ReturnWordArray += wordArray
        
        //http://www.weblio.jp/category/business/sngjy/ii/4
        
        wordArray = ["移動式新型ミサイル","移動平均乖離率","移動平均収束拡散指標","移動平均収束拡散法","井戸沢断層","イナビル","委任状争奪戦","委任状闘争","犬肉祭","イヌ肉祭り","犬ジステンパー","いぬジステンパー","犬肉の祭",
            "犬肉の祭り","犬肉祭り","イネ稲熱病菌","イネいもち病菌","居眠り運転防止グッズ","居眠り運転防止装置","居眠り運転防止用品","茨城沖","茨城県沿岸沖合","茨城県沖","茨城県沖合の海域","茨城県の沖合","IFD注文",
            "イブニングセッション","イプシロン","イプシロンロケット","イベントリスク","違法漁業国","違法操業国","違法ドラッグ","違法・無報告・無規制","李明博","イミョンバク","イムノクロマト","イムノクロマトグラフィー",
             "イムノクロマトグラフィー法","イムノクロマト法","イムノトキシン","夢洲大規模太陽光発電所","稲熱病菌","イモチ病菌","イモビカッター","イモビライザーカッター","医薬前駆体","医薬品のインターネット通信販売",
             "医薬品の通信販売","医薬品のネット販売","嫌気売り","イ病","伊四〇〇型","伊四〇〇型潜水艦","イラク戦争の米軍機密文書公開事件","イラク通貨詐欺事件","イラク通貨事件","イラクディナール詐欺事件","イラクとシャームのイスラーム国",
             "イラクとシリアのイスラーム国","イラクとレバントのイスラム国","イラクとレバントのイスラーム国","イラク･シャーム･イスラム国","イラク･シャーム･イスラーム国","イラク･シリア･イスラーム国","イラク・レバントのイスラム国",
             "イラク・レバント・イスラーム国","イラン核開発問題","イラン核問題","イラン経済制裁","イランのウラン濃縮施設","イランの核開発問題","イランの核問題","入り首線","イリューシン78","医療格差","医療観光",
             "医療機関債"]
        
        ReturnWordArray += wordArray
        
        wordArray = ["医療ツーリズム","医療費2025年問題","医療費の2025年問題","医療費の自己負担","医療用に準じたカテゴリーの医薬品","威力業務妨害","威力業務妨害罪","イルカ追込み猟","イルカ追い込み猟","イルカ追込み漁",
             "イルカ追い込み漁","イルワン","入替売買","入れ墨メイク","イレッサ","イレッサ訴訟","磐余池","飲食物摂取制限","飲食物摂取制限に関する指標","インジェクション牛肉","インジェクション肉","インジェクションビーフ",
             "隕石と彗星の違い",]
        
        ReturnWordArray += wordArray
        
        return ReturnWordArray

    }
}
