//
//  PhysicalWordStore.swift
//  WordCollectionBySwift
//
//  Created by 岡大輔 on 2015/02/27.
//  Copyright (c) 2015年 岡大輔. All rights reserved.
//

import Foundation

class PhysicalWordStore:WordStore{

    func returnCaption() -> String{
        return "物理学用語"
    }

    func ReturningWordArray() -> Array<String>{
        var ReturnWordArray:[String] = []
        
        var wordArray = ["アーク","アーク光源","アークスペクトル","アーク灯","アーク放電","アーク炉","アース","アース電位","RI","RI実験室","RAM","RM電池","ROM","アーンショーの定理",
            "ISO","ISO規格","アイコナール","IC","ICI表色系","アイソスピン","アイソトープ","アイソバー","アイソマー","アイピース","IUPAC","IUPAP","アインシュタイン",
            "アインシュタインの関係式","アインシュタインの比熱式","アインスタイニウム","アウトプット","亜鉛","亜音速","アクセプター","アクチニウム","アクチニウム系列",
            "アクチノイド","アクチノウラン系列","アクチノメーター","アクティブ・ノイズ・コントロール","アクロマート","ASA感光度","アスタチン","アストン","アスピレーター",
            "アスベスト","アセンブラー","アセンブリー言語","アダムス","熱い電子","圧延磁気異方性","圧縮気体","圧縮因子","圧縮ガス","圧縮機","圧縮係数","圧縮性流体",
            "圧縮波","圧縮率","圧電気","圧電効果","圧電振動子","圧電性","圧電性物質","圧電素子","圧電率","アップクォーク","アップルトン","圧粉磁心","アッベ",
            "アッベ屈折計","アッベ数","アッベの条件","圧力","圧力計","圧力差計","圧力中心","圧力抵抗","圧力の等方性","アト","アドミッタンス","アナログ",
            "アナログ計算機","アナログ信号","アナログーディジタル変換","アナログ方式","アニオン","アニオン界面活性剤","アネロイド気圧計","アノード","アハロノフーボーム効果",
            "アプシス","油回転ポンプ","アプラナート","アブラハム","アボガドロ","アボガドロ数","アボガドロ定数","アボガドロの分子説","アボガドロの法則",
            "アポダイゼーション","アマガ圧力計","天の川銀河","アマルガム","アミチプリズム","アメダス","アメリシウム","アモルファス","アモルファス金属","アモルファスシリコン",
            "アシントンの法則","粗い面","アラゴーの回転盤","アリストテレス","有馬朗人","アルカリ乾電池","アルカリ電池","アルカリマンガン乾電池","アルキメデス",
            "アルキメデスの原理","アルコール温度計","アルゴリズム","アルゴン","α壊変","α線","α崩壊","α粒子","α粒子の散乱実験","アルベーン波","アルベド",
            "アルミニウム","アレニウス","泡","泡箱","アンサンブル","暗視野顕微鏡","暗線","暗騒音","アンダーソン","アンチモン","安定同位体","アンテナ","暗電流",
            "案内中心","アンペア","アンペア回数","アンペア時","アンペアの法則","アンペア毎メートル","アンペアメーター","アンペール","アンペールの法則",
            "アンペール・マクスウェルの法則","アンメーター"];
        ReturnWordArray += wordArray
        
        wordArray = ["EL","飯島澄男","E層","E波","イェンゼン","硫黄","イオニクス","イオン","イオン温度","イオン化","イオン化エネルギー","イオン化傾向","イオン化電位",
            "イオン化ポテンシャル","イオン化列","イオン結合","イオン結晶","イオン源","イオン顕微鏡","イオン交換樹脂","イオン鞘","イオン散乱分光",
            "イオンシース","イオン積","イオン対","イオン伝導","イオン半径","イオンポンプ","閾値","イグナイトロン","異常拡散","異常光線","異常磁気モーメント",
            "異常分散","石綿","石原純","異性核","異性体","ISO","位相","位相安定性","移相器","位相空間","位相差顕微鏡","位相速度","位相のずれ","位相変化",
            "位相変調","位置エネルギー","1原子分子","1次宇宙線","1次X線","１軸結晶","１次コイル","一時磁石","1次相転移","１次電子光学効果","１次電子",
            "位置ベクトル","イッテルビウム","イットリウム","一般化座標","一般化力","一般相対性理論","移動度","緯度変化","異方性","異方性液体",
            "イメージングプレート","イリジウム","色","色温度","色ガラス","色消し条件","色消しレンズ","色指数","色収差","色中心","色の純度","色立体",
            "陰イオン","陰イオン界面活性剤","陰イオン交換樹脂","陰画","引火点","因果律","陰極","陰極グロー","陰極降下","陰極線","陰極線オシロスコープ",
            "陰極線管","陰極線ルミネッセンス","陰極層","陰極電流","陰極ルミネッセンス","インコヒーレント","インジウム","インスタントフィルム","インターフェース",
            "インダクションコイル","インダクタンス","インバータ","インピーダンス","インピーダンス行列","インピーダンス整合","インピーダンスブリッジ",
            "引力"];
        ReturnWordArray += wordArray
        
        wordArray = ["ウィークボソン","ウィーデマン","ウィーデマン効果","ウィーデマンーフランツの効果","ウィーナー","ウィーンの変異法則","ウィーンブリッジ","ウィーン",
            "ウィグナー","ウィズムハースト誘導起電機","ウィリアム・トムソン","ウィルソンの霧箱","ウーレンベック","ウェーバー","ウェーバー毎平方メートル",
            "ウェーファー","ウェーブマシン","ウェストン電池","ウォーターゲージ","ウォーターハンマー","ウォーターボイラー型原子炉","ウォルトン","浮き秤",
            "渦","渦糸","渦管","渦線","渦電流","渦電流損","渦電流損","渦度","渦なし流れ","渦粘性","渦巻線","渦流量計","渦輪","右旋光",
            "宇宙化学","宇宙塵","宇宙線","宇宙線シャワー","宇宙速度","宇宙電波","宇宙背景放射","宇宙物理学","宇宙論","うなり","ウプシロン粒子",
            "ウラン","ウラン系列","ウラン原子炉","ウラン濃縮","ウランーラジウム系列","運動","運動エネルギー","運動学","運動の合成","運動の３法則","運動の第１法則",
            "運動の第３法則","運動の第２法則","運動の速さ","運動の分解","運動の法則","運動の向き","運動方程式","運動量","運動量の原理","運動量保存の法則",
            "運搬電流"];
        ReturnWordArray += wordArray
        
        wordArray = ["エアパック","永久機関","永久磁石","永久双極子","永久電流","永久歪み","衛星","衛星航法","映像インピーダンス","永年加速","永年摂動","永年方程式",
            "AM","AC","AGS","AGシンクロトロン","A/D変換","エーテル","X線回折計","X線回折顕微鏡","X線回折投影法","X線回折分析","X線管","X線干渉計",
            "X線吸収","X線吸収分光分析","X線吸収分析","X線強度","X線蛍光","X線蛍光体","X線計数","X線結晶解析","X線顕微鏡","X線光子","X線構造解析",
            "X線スペクトル","X線測角器","X線天文学","X線トポグラフィー","X線の異常分散","X線バースター","X線発光分光分析","X線発光分析","X線パルサー",
            "X線フィルター","X線フィルム","X線分析","X線粉末法","X線望遠鏡","X線マイクロアナライザー","X線ルミネッセンス","X線レーザー","HR図",
            "H型放電管","H波","エッティングスハウゼン","エディントン","NMR","ｎ型半導体","N極","N次元空間","npn型トランジスター","エネルギー",
            "エネルギーギャップ","エネルギー効率","エネルギー準位","エネルギー帯","エネルギー等分配の法則","エネルギーの単位","エネルギーバンド","エネルギー変換",
            "エネルギー保存則","エネルギー保存の法則","エネルギー量子","エネルギー量子仮説","エネルギーレベル","エネルギー論","エピタキシー","FET","FM変数",
            "F数","F層","F値","Fナンバー","エミッター","エミッタ電流","MR効果","ME効果","MHDシミュレーション","MHD発電","MS","MSI","MS",
            "MHD","MOS素子","MOX","MOディスク","MKSA単位系","MKS単位系","MK鋼","LET","LED","LSI","エルグ","エルステッド","エルビウム",
            "エレクトログラフ法","エレクトロニクス","エレクトロニクスセラミックス","エレクトロルミネッセンス","エレクトロン","エレクトロンボルト",
            "円運動","遠隔作用","塩基","円形加速器","円形コイル","円形電流","円形波","エンコーダー","演算子","演算増幅器","エンジニアリングセラミックス",
            "延伸","遠心機","遠心分離","遠心力","遠心力歪み","円錐振り子","延性","塩素","エンタルピー","円柱レンズ","鉛直線","鉛直投射","鉛直投げ上げ",
            "鉛直投げ下ろし","鉛直ばね振り子","鉛直方向","円筒レンズ","エントロピー","エントロピー増大の法則","エントロピー弾性","炎熱量計","円偏光",
            "沿面放電"];
        ReturnWordArray += wordArray
        
        wordArray = ["オイラー","オイラー角","オイラーの運動方程式","オイラーの定数","黄金則","黄金律","凹面回折格子","凹面鏡","凹面格子","応用物理学",
            "応用力学","応力","応力緩和","応力集中","応力ーひずみ曲線","大型ハドロン衝突型加速器","オージェ効果","オージェ電子","オージェ電子分光法",
            "オージェ分光法","オートクレープ","オートメーション","オートラジオグラフィー","オーバーハウザー効果","オーム","Ωの法則","オームの法則",
            "オームメートル","オーロラ","オクターブ","オシログラフ","オシロスコープ","オストワルドの色立法","オストワルド表色系","オスニウム",
            "オゾン系","オゾン層","オゾンホール","オットーサイクル","オッペンハイマー","音","音の大きさ","音の回折","音の干渉","音の吸収",
            "音の屈折","音の三要素","音の高さ","音の強さ","音の速さ","音の反射","音の分散","音ルミネッセンス","帯スペクトル","オブザーバブル",
            "オプティカルトゥイーザー","オプトエレクトロニクス","オフライン処理","オペアンプ","オペレーティングシステム","ω中間子","重い電子系",
            "重さ","音圧","音圧校正","音響インピーダンス","音響オーム","音響学","音響光学効果","音響スペクトル","音響測深","音響フィルター",
            "オングストレーム","オングストローム","オングストロームルーラー","音源","音叉","オンサガー","オンサガーの相反定理","音子","温室効果",
            "音場","オンス","音声周波数増幅","音声認識","音速（度）","温度","温度計","温度勾配","温度散乱","温度調節器","温度定点",
            "温度平衡","温度放射","温度目盛","オンネスの状態方程式","音場","音波","音波干渉管","音場校正","オンライン処理","音律"];
        ReturnWordArray += wordArray
        
        wordArray = ["カー","カー効果","カーセル","加圧釜","加圧水型原子炉","カーボンブラック","ガーマー","回映","ガイガー","ガイガーカウンター",
            "ガイガー計数管","ガイガー・ヌッタルの法則","ガイガー・ミュラー計数管","開管","外気圏","外圏","開口数","開口端補正","カイザー",
            "界磁","ガイスラー","ガイスラー管","ガイスラー放電","外積","解析力学","回折","回折角","回折格子","回折格子スペクトロメータ",
            "回折散乱","回折縞","回折波","解像力","回転","回転運動","回転エネルギー","回転鏡映","回転計","回転座標系","回転子",
            "回転軸","回転準位","回転振動スペクトル","回転スペクトル","回転速度計","回転対陰極","回転対称","回転対称軸","回転電極",
            "回転粘度計","回転半径","回転ヒステリシス","回転偏光","回転ポンプ","回転量子数","回転炉","外燃機関","回復性歪","外部光電効果",
            "外部線量","外部抵抗","外部電位","外部被ばく","壊変","壊変曲線","壊変系列","壊変図式","開放系","界面","界面エネルギー",
            "界面活性剤","界面電位","解離エネルギー","外力","回路","回路試験器","回路素子","回路遮断器","回路網","外気圏プラズマ",
            "ガウス","ガウス結像","ガウス単位系","ガウスの定理","ガウスの法則","ガウス分布","ガウス平面","カウンター","カオス",
            "画角","化学エネルギー","科学線量計","化学的エネルギー","化学電池","化学当量","化学発光","化学ポテンシャル","化学ルミネセンス",
            "化学レーザー","鏡","可逆過程","可逆機関","可逆現象","可逆サイクル","可逆性原理","可逆電池","可逆波","可逆振り子","可逆変化",
            "殻","角","角安定性","核異性体","角運動量","角運動量保存の法則","核エネルギー","楽音","核外電子","核化学","角加速度",
            "核結合エネルギー","核工学","拡散","拡散霧箱","拡散速度","拡散反射","拡散ポンプ","核子","核磁気","核磁気共鳴","核四極子",
            "核磁子","核種","角周波数","角振動数","角相関","角速度","確認限界","核燃料","核燃料サイクル","核燃料再処理","核爆発",
            "核半径","核反応","核反応式","核物質","核物理学","角分散","核分裂","核分裂生成物","核分裂年代測定法","核分裂片","核変換",
            "角変数","核ボーア磁子","核模型","核融合","核融合反応","核融合炉","確率","確率誤差","確率振幅","確率分布","確率変数",
            "核力","核連鎖反応","重ね合わせの原理","カ氏温度","可視光線","可視度","ガスクロマトグラフィー","カスケードシャワー","ガスケット",
            "ガス検知器","ガス定数","ガスレーザー","風","加成性","化石燃料","仮設","カセトメータ","仮想質料","カソード","カソード電流",
            "加速運動","加速器","加速度","加速度運動","加速度ベクトル","可塑性","ガソリンエンジン","硬いX線","硬さ","硬さ数","カチオン",
            "カチオン界面活性剤","可聴音","滑車","活性化エネルギー","滑動環","活動度","活量","荷電","過電圧","価電子","荷電粒子",
            "荷電粒子検出器","可動コイル型電流計","可動鉄片型電流計","渦動粘性","過渡現象","カドニウム","カドニウム標準電子","ガドリニウム",
            "カナル線","過熱","過熱減量","カノニカルアンサンブル","カピッツァ","可変コンデンサー","可変抵抗器","過飽和","カマリング・オネス",
            "カミオカンデ","雷放電","火面","ガモフ","茅誠司","カラー","から試験","カラット","カリウム","ガリウム","カリホルニウム",
            "火力発電","ガリレイ","ガリレイ式望遠鏡","ガリレイ変換","ガリレオ・ガリレイ","カルシウム","カルノー","カルノーークラウジウスの原理",
            "カルノーサイクル","カルノーの定理","ガルバーニ","ガルバニ電位","ガルバノメーター","カルベのミクロ熱量計","カルマン渦","過冷却",
            "カロリー","熱力学カロリー","カロリーメーター","ガロン","感光計","感光度","寒剤","換算質量","乾湿球湿度計","乾湿計",
            "干渉","干渉屈折計","干渉計","干渉顕微鏡","干渉縞","干渉色","干渉性","干渉性散乱","干渉性放射","干渉フィルター","干渉分光器",
            "慣性","慣性系","慣性航法","慣性座標系","慣性質量","慣性閉じ込め","慣性能率","慣性の法則","慣性モーメント","慣性力",
            "間接分析","間接力","完全気体","完全結晶","完全黒体","完全弾性衝突","完全弾性体","完全導体","完全非弾性衝突","完全偏光",
            "完全流体","乾燥摩擦","ガンダイオード","寒暖計","カンデラ","カンデラ毎平方メートル","乾電池","環電流","感度","感度曲線","感度係数",
            "感熱紙","感応コイル","ガンーピーターソン効果","γ壊変","γ線","γ検出器","γ線殺菌","γ線照射","γ線スペクトル","γ線バースト","γ崩壊",
            "感量","緩和過程","緩和現象","緩和時間","緩和発振"];
        ReturnWordArray += wordArray
        
        wordArray = ["気圧","気圧計","記憶装置","記憶素子","基音","気温","気体放電","気体力学","気体レーザー","擬弾性","気柱","気柱の共鳴",
            "気柱の固有振動","気柱の振動","基底状態","起電機","起電力","輝度","軌道","軌道関数","輝度温度","希土類元素","機能材料",
            "機能性高分子","希薄気体","希薄溶液","ギブス","ギブスの吸着式","ギブスの自由エネルギー","ギブスエネルギー","ギブスの相律",
            "擬ベクトル","基本音","基本振動","基本ソフト","基本単位ベクトル","基本物理量","基本ベクトル","基本粒子","キャヴェンディッシュ",
            "逆位相","逆関数","逆起電力","逆格子","逆耐電圧","逆２乗法則","逆分散能","逆方向","逆流","逆流検出計","キャッツアイ",
            "CAD","キャパシター","キャパスタンス","キャビテーション","キャピラリー","キャピラリー電気泳動","キャリア","キャリパー",
            "キャリブレーション","キャリヤー","QSO","吸音材","吸音率","吸光度","球座標","吸収係数","吸収指数","吸収スペクトル",
            "吸収線","吸収線量","吸収帯","吸収端","吸収能","吸収バンド","求心力","q数","吸蔵","Q値","吸着","吸着熱","吸熱反応",
            "Q波","キューブコーナー","球面鏡","球面収差","球面波","球面振り子","キュリー","キュリー温度","キュリー点","キュリーの法則",
            "キュリー−ワイスの法則","キュリウム","鏡映","鏡映核","境界層","仰角","凝結","凝結核","凝固","凝固点","凝固点降下",
            "凝固熱","強磁性","強磁性体","強磁性誘電体","強磁場","凝集","凝集エネルギー","凝集力","凝縮","凝縮熱","共振","共振回路",
            "共振器","共振光線束","共振器","共心光線束","共振子","共振周波数","強制振動","鏡像","鏡像異性","鏡像力","強弾性",
            "強弾性体","協同現象","共鳴","共鳴吸収","共鳴放射","共鳴ラマン散乱","共有結合","共有結合結晶","強誘電体","協力現象","行列力学",
            "協和音","極限強さ","極座標","極磁気嵐","極小曲面","極小磁場","極性分子","極低温","極板","局部電池","曲面","曲面積分",
            "曲率","曲率中心","巨視的","虚像","極光","虚物体","許容応力","許容線量","距離","霧箱","ギルバート","キルヒホッフ",
            "キルヒホッフの法則","キロ","キログラム","キログラム原器","キログラムメートル毎秒","キロメートル毎時","キロワット","キロワット時",
            "金","銀","銀河","銀河系","近軸光線","近似計算","禁止帯","禁制反射","近接効果","近接作用","金属","金属ガラス","金属間化合物"];
        ReturnWordArray += wordArray
        
        wordArray = ["クインケ管","クヴィンケ管","空間","空間格子","空間反転","空気","空気コンデンサー","空気シャワー","偶奇性","空気抵抗",
            "空気電池","空気力学","空気力学的音波","空孔","空格子点","空試験","グース","空地電流","空中線","空電","空洞共振器",
            "空洞現象","空乏層","空力音","クーリッジ","クーリッジ管","偶力","偶力のモーメント","クーロン","クーロン障壁","クーロンの法則",
            "クーロンポテンシャル","クーロンメーター","クーロン力","クェーサー","クエンチング効果","クォーク","クォーク理論","クォーツ時計",
            "クッシュ","屈折","屈折角","屈折計","屈折光","屈折の法則","屈折波","屈折望遠鏡","屈折率","クッタ・ジューコフスキーの定理",
            "クッタの条件","組み合わせ滑車","組合わせレンズ","組換え衝突","クラードニ","クライオスタット","クライスト","クライストロン",
            "クライン−仁科の公式","クラインの管","クラインのつぼ","クラウジウス","クラウジウス−クラペイロンの式","クラウジウス−モソッティの式",
            "クラスター","クラドニ図形","グラビトン","グラム","クリープ","くりこみ理論","クリノメーター","クリプトン","グルーオン",
            "グルオン","ウルチャトフ","クルックス","クルックス管","グレアムの法則","グレイ","グレーザー","グレーティング","グロー発光",
            "グロー放電","グローランプ","クロノグラフ","クロム","群速度","クント","クントの実験"];
        ReturnWordArray += wordArray
        
        wordArray = ["傾圧","KEK","KS鋼","軽金属","蛍光","蛍光X線","蛍光スペクトル","蛍光灯","蛍光分析","傾斜計","形状記憶合金",
            "形状記憶ポリマー","形状弾性","軽水炉","計数回路","計数管","ケイ素","携帯電流","K中間子","継電器","経度変化",
            "軽粒子","ゲイ・リュサック","ゲイリュサックの法則","経路差","ゲージ変換","ゲージ粒子","ゲージ理論","ケーターの可逆振り子",
            "ゲート回路","ゲーリケ","撃力","結合エネルギー","結合音","結合回路","月光協会","結合モーメント","結晶","結晶系",
            "結晶光学","結晶格子","結晶格子エネルギー","結晶構造","結晶軸","結晶点群","結晶場","結像","欠乏層","ケノトロン",
            "ケプラー","ケプラー運動","ケプラー式望遠鏡","ケプラーの第１法則","ケプラーの第２法則","ケプラーの第３法則","ケプラーの法則",
            "ケミカルレーザー","化学レーザー","ケミカルルミネッセンス","化学発光","ゲル","ケルヴィン卿","ゲルトラー渦","ケルビン","ケルビン温度",
            "ケルビン・ダブルブリッジ","ケルビン・ブリッジ","ゲルマニウム","ゲルマン","減圧乾燥","減圧沸騰","限外顕微鏡","限界振動数",
            "限界等級","限界波長","弦楽器","原器","減極作用","検光子","原子","原子エネルギー","原子価","原子核","原子核エネルギー",
            "原子核乾板","原子核工学","原子核合成","原子核燃料","原子核の結合エネルギー","原子核の質量と電荷","原子核の振動","原子核の半径",
            "原子核の崩壊","原子核反応","原子核物理学","原子核分裂","原子核模型","原子核融合","原子価電子","原子干渉計","原子吸光係数","原子吸光分析",
            "原子空孔","原子蛍光分析","原子形状因子","原子構造","原子散乱因子","原子時","原子質量単位","原子スペクトル","原始星","原子説",
            "原子線","原子体積","原子単位","原子時計","原子熱","原子爆弾","原子半径","原子番号","原子物理学","原子分極","原子模型",
            "検出限界","原子容","原子量","原子力","原子力エネルギー","原子力電池","原子力発電","原子炉","原子論","原振動","減衰器",
            "減衰指数","減衰振動","元素","減速材","元素合成","元素の周期律","元素の周期律表","減損ウラン","検定","限定因子","検電器",
            "弦の振動","検波","顕微鏡","顕微鏡の分解能","検流計"];
        ReturnWordArray += wordArray
        
        wordArray = ["コイル","コイルのリアクタンス","コイルリアクター","光圧","高圧送電線","硬X線","高エネルギー粒子","光円錐","高温計","高温超電導",
            "高温超伝導体","高温超伝導物質","光学","光学異性","光学ガラス","光学器械","光学距離","光学系","光学軸","工学単位","工学単位系",
            "光学濃度","光核反応","光学モード","広角レンズ","交換関係","光起電力効果","合金","合金鉄","口径比","光行差","公差","光散乱",
            "光子","格子","格子エネルギー","光軸","格子欠陥","格子散乱","格子振動","膠質","格子定数","格子面","格子面間隔","高周波",
            "高周波加熱","高周波増幅","高周波電場","高周波放電","公称応力","孔食","光心","向心力","校正","恒星","合成","合成速度","合成速度ベクトル",
            "合成抵抗","合成波","合成波形","合成有機金属","合成容量","剛性率","光線","光線逆光の原理","光線軸","光線束","構造色","光束","高速増殖炉",
            "高速中性子","高速中性子核分裂","高速中性子炉","高速炉","剛体","剛体の自由回転","剛体のつり合い","剛体振り子","剛体力学","光弾性","高弾性",
            "光端補正","抗張力","光電陰極","光電管","光電管温度計","光電高温計","光電効果","光電子","光電子倍増管","光電子放出","公転周期",
            "光伝導セル","光電変換素子","光電離","光電流","光度","硬度","高度","光度計","光年","勾配","降伏応力","降伏現象","降伏点","降伏電圧",
            "光分解","後方散乱","公理","交流","後流","交流回路","交流起電力","交流消磁","交流電圧","交流電圧計","交流電圧の実効値","交流電圧の瞬間値",
            "交流電動機","交流電流","交流電流計","交流電流の実効値","交流電流の瞬間値","交流の瞬時値","交流発電機","交流ブリッジ","交流モーター",
            "光量子","光量子仮説","光量子仮説","光量子説","抗力","合力","光励起","光路差","光路長","コージェネレーション","コーナーキューブ",
            "コールラウシュ・ブリッジ","五角プリズム","五極管","国際温度目盛","国際キログラム原器","国際原子量委員会","国際純粋応用物理学連合","国際純正応用化学連合",
            "国際単位","国際単位系","国際地球観測年","国際度量委員会","国際標準化機構","黒体","黒体放射","黒点","誤差","小林昌俊","固体",
            "固体イオニクス","固体電解質","固体メーザー","固体レーザー","コッククロフト","コッククロフト・ウォルトン加速器","コッセル","コッセル線",
            "コットン効果","固定端","固定端反射","古典電磁気学","古典電子論","古典統計力学","古典物理学","古典力学","古典量子論","孤度","弧度法",
            "ゴニオメーター","コノスコープ","５倍振動","琥珀","小林誠","小林・益川理論","コバルト","コヒーレンス","コヒーレンス関数","コヒーレント",
            "コヒーレント光","コペルニクス","コマ","コマ収差","ごみ発電","ゴム弾性","固有X線","固有周波数","固有振動","固有値","個溶体","コリオリの力",
            "コリオリ力","孤立波","孤立波","コリメーター","ゴルトシュタイン","コレクタ","コレクターエミッタ間電圧","コレクタ電流","コロイド","転がり摩擦",
            "転がり摩擦係数","コロナ","コロナ帯電","コロナ放電","混合気体の法則","混合伝導","混合熱","コンスタンタン","混成電圧","コンダクタンス",
            "混濁度","コンデンサー","コンデンサーのリアクタンス","コンデンサーレンズ","コントラスト","コンバーター","コンパレーター","コンピュータ",
            "コンピュータ援用設計","コンピュータプログラム","コンプトン","コンプトン効果","コンプトン散乱","コンプトン波長","コンプレッサー"];
        ReturnWordArray += wordArray
        
        wordArray = ["差圧計","サーミスター","サーミスター温度計","サーモカラー","サーモグラフィー","サーモスタット","サーモトロピック液晶","サーモパイル","最外殻",
            "サイクル","サイクロイド","サイクロイド振り子","サイクロトロン","サイクロトロン運動","サイクロン","再結合","再結晶","最高温度計","歳差",
            "歳差運動","最小可聴音","最小作用の原理","最小二乗法","最小偏角","最大許容線量","最大許容濃度","最大磁化率","最大仕事","最大蒸気圧",
            "最大静止摩擦力","最大摩擦力","最短波長","最低温度計","ザイデルの５収差","彩度","サイホン","サイラトロン","サイリスター","材料試験機",
            "サイレン","サインカーブ","サインバー","さお秤","坂田昌一","坂田模型","さざ波","差スペクトル","左旋光","雑音","撮像管","差動回転",
            "佐藤勝彦","差動変圧器","サニャック効果","サバール","座標","座標軸","座標変換","サマリウム","作用","作用線","作用点","作用電極",
            "作用量","作用・反作用の法則","酸","酸アルカリ電池","散逸過程","三角関数","三角測量","三角比","酸化水銀電池","残響","残響時間",
            "三極管","三原色","散光","残光","三重水素","三重線","三重点","参照電極","３色係数","酸水素電池","酸素","残像","三相交流",
            "酸素水素燃料電池","残存線","3体問題","散弾効果","３倍音","3倍振動","三辺測量","散漫散乱","散乱","散乱X線","散乱係数","散乱光","散乱振幅",
            "散乱断面積","散乱波","残留応力","残留磁化","残留磁気","残留線","残留帯","残留帯","残留歪み"];
        ReturnWordArray += wordArray
        
        wordArray = ["シアリング干渉計","磁位","Ci","CIE表色系","CIPM","g因子","CAD","CNOサイクル","C-Nサイクル","COBE","ジーグバーン","磁位差計","CGS-esu",
            "CGS-emu","CGS静電単位系","CGS単位系","CGS電磁単位系","CCD","c数","CT吸収","GPS","シーベルト","シーメンス","ジーメンス","シールド",
            "ジェット","ジェットエンジン","ジェットシャワー","ジオイド","ジオプトリー","示温塗料","磁化","磁荷","磁界","視界","紫外線","紫外線顕微鏡",
            "磁界に関する法則","磁界レンズ","磁化曲線","視角","磁角","磁化率","時間","磁気","磁気嵐","閾値","磁気異方性","磁気エネルギー","磁気回路",
            "磁気核融合","磁気感応","磁気共鳴","磁気効果","磁気光学効果","磁気コンデンサー","磁気コンパス","磁気遮蔽","磁気旋光","色相","色相環",
            "磁気双極子","磁気増幅器","磁気単極子","磁気抵抗","磁気抵抗効果","磁気ディスク","磁気テープ","磁気転移","磁気電気効果","磁気天秤",
            "色度","色度図","磁気ドラム","磁気二重層","磁気熱効果","磁気熱電効果","磁気熱量効果","磁気能率","磁気ヒステリシス","磁気歪み","色票系",
            "磁気浮上","磁気飽和","磁気ポテンシャル","磁気モーメント","磁気モノポール","磁気もれ","磁気漏れ変圧器","磁気誘導","磁極","四極管","四極子",
            "磁気余効","磁気力線","磁気量","磁気量子数","磁気力","磁気力線","磁気履歴","磁気冷却","磁気漏洩","磁気録音","磁区","時空","時空点","σ電子",
            "∑粒子","時空列","次元","次元解析","自己インダクタンス","思考実験","指向性","指向性アンテナ","自己エネルギー","時刻","子午線","仕事",
            "仕事関数","仕事当量","仕事の原理","仕事率","自己誘導","磁子","視軸","指示電極","指示電力計","磁石","磁石鋼","磁石合金","四重極",
            "四重極質量分析計","磁針","磁針電流計","地震波","JIS","死水","ジスプロシウム","磁性","示性X線","磁性温度計","磁性体","磁性超伝導体",
            "磁性半導体","自然光","自然単位系","自然長","自然哲学の数学的諸原理","自然の階層性","自然放射能","磁束","磁束計","磁束線","磁束密度",
            "磁束量子","四端子回路","実験計画","実験誤差","実験室系","実験物理学","実効質量","実効線量","実効値","実在気体","実像","失速","実体鏡",
            "実体顕微鏡","実体振り子","質点","質点系","質点力学","湿度","実用単位","質量","質量エネルギー保存の法則","質量欠損","質量光度関係",
            "質量数","質量スペクトル","質量単位","質量中心","質量中心系","質量とエネルギーの等価性","質量分析器","質量分析計","質量分析法",
            "質量保存の法則","時定数","磁鉄鉱","磁電管","自動計測","自動制御","死の灰","磁場","自発核分裂","自発磁化","自発的対称性の破れ",
            "自発分極","磁場に関するガウスの法則","磁壁","絞り","シミュレーション","視野","ジャイロコンパス","ジャイロスコープ","ジャイロスタビライザー",
            "視野角","弱磁性","射線","写像","遮蔽","斜方投射","シャルル","シャルルの法則","視野レンズ","シャワー","シャント","重イオン核反応",
            "重イオン加速器","シュウィンガー","自由エネルギー","自由エンタルピー","自由荷","自由回転","周期","周期運動","周期関数","周期表","自由境界層",
            "周期律","重金属","重クロム酸電池","自由経路","集合","集光器","自由行程","ジューコフスキーの仮定","収差","十字ニコル","重心","重心系",
            "自由振動","重心の運動エネルギー","重水","重水素","集積回路","臭素","集束","集束コイル","終速度","集束レンズ","自由端","終端速度",
            "自由端反射","充電","自由電荷","自由電子","充電電流","自由度","摺動抵抗器","十二平均律音階","周波数","周波数特性","周波数分析",
            "周波数変調","自由表面","自由膨張","充満帯","シューマン領域","重陽子","従来単位","自由落下","自由落下運動","重粒子","重量",
            "重量キログラム","重量グラム","重力","重力異常","重力加速度","重力キログラム","重力グラム","重力子","重力質量","重力相互作用",
            "重力単位","重力単位系","重力波","重力場","重力崩壊","重力落下運動","重力理論","重力レンズ効果","ジュール","ジュール効果","ジュール・トムソン効果",
            "ジュール熱","ジュールの実験","ジュールの法則","ジュール毎キログラム毎ケルビン","ジュール毎グラム毎ケルビン","ジュール毎ケルビン","ジュール毎秒",
            "主光線","シュタインメッツの実験式","シュタルク","シュタルク効果","出力","出力インピーダンス","ジュテファン","シュテファンーボルツマン定数",
            "シュテファンーボルツマンの法則","シュテルン","シュテルンーゲルラッハの実験","主点","シュトラスマン","主波長","主平面","シュミットカメラ",
            "シュリーレン法","主量子数","シュレーディンガー","シュレーディンガーの猫","シュレーディンガーの波動方程式","シュレーディンガー方程式","ジュワーびん",
            "受話器","順圧","準安定イオン","準安定原子","準安定状態","準位幅","純音","潤滑","潤滑剤","瞬間値","瞬間の加速度","瞬間の加速",
            "瞬間の速さ","循環炉","瞬時値","準星","準静的過程","純正律","準定常電流","純度","順変換回路","順方向","順方向電流","順流","準粒子",
            "上音","昇華","昇華曲線","照角","昇華熱","蒸気圧","蒸気圧曲線","蒸気圧降下","蒸気機関","小規模集積回路","SSI","消極","衝撃音",
            "衝撃検流計","衝撃試験","衝撃電流","衝撃波","衝撃力","常光線","照合電極","消磁","常磁性","常磁性共鳴","常磁性体","照射効果","照射食品",
            "照射線量","焼準","消衰距離","消衰係数","消衰効果","状態式","状態図","状態ベクトル","状態変化","状態変数","状態方程式","状態量",
            "焦点","焦点距離","焦点深度","焦点面","照度","照度計","衝突","衝突型加速器","衝突径数","衝突断面積","衝突パラメータ","蒸発","蒸発曲線",
            "蒸発熱","消費電力","焦平面","情報","情報処理","蒸溜","ショート","初期位相","初期条件","食品照射","ジョセフソン効果","初速度","ショックレー",
            "ショットキー効果","ショットキーダイオード","ショット効果","初透磁率","シリコーン","シリコン","シリコン制御整流器","シリコン光電池",
            "磁力","磁力計","磁力線","ジルコニウム","自励振動","磁歪","磁歪振動子","真応力","震音","蜃気楼","真空","真空管","真空乾燥","真空計",
            "真空蒸着","真空度","真空熱電対","真空の透磁率","真空の誘電率","真空分極","真空偏極","真空放電","真空ポンプ","シンクロサイクロトロン",
            "シンクロスコープ","シンクロトロン","シンクロトロン放射","新KS鋼","信号","人工衛星","人工衛星レーザー測距","人工核変換","人工降雨",
            "進行波","進行波管","人工放射線核種","人工放射線同位体","真磁荷","伸縮振動","深色効果","靱性","真性半導体","進相コンデンサー","深層水",
            "診断用トレーサー","伸長粘度","シンチレーション","シンチレーション計数管","シンチレーター","真電荷","振動","浸透圧","振動回転スペクトル",
            "振動回路","振動数","振動数条件","振動体","振動電流","振動量子数","振幅","振幅変調"];
        ReturnWordArray += wordArray
        
        wordArray = ["水圧","水圧機","水銀","水銀圧計","水銀温度計","水銀気圧計","水銀整流器","水銀電極","水銀電池","水銀灯","水撃作用","水準器",
            "水蒸気","水晶振動子","水晶体","水晶時計","水晶発信器","垂線速度","水素","水素イオン指数","水素イオン濃度指数","水素吸蔵合金",
            "水素結合","水素原子のエネルギー準位","水素原子のスペクトル","水素原子のボーア模型","水素電極","水素爆弾","水素メーザー","垂直抗力",
            "垂直磁化膜","垂直偏向板","スイッチ","水槌","スイッチ回路","スイッチング素子","水波","水平磁力","水平投射","水平ばね振り子",
            "水平振り子","水平分力","水平偏向板","水平方向","水平面","水面波","水流ポンプ","水力発電","推論","水和","水和エネルギー",
            "水和熱","スイングバイ","数値","数値制御","スーパーカミオカンデ","スーパーコイル","スーパーコンピュータ","スーパーヘテロダイン",
            "ズームレンズ","数理物理学","スカラー","スカラー積","スカラー場","スカラーポテンシャル","スカンジウム","スクイド","スターリングエンジン",
            "スタットクーロン","スチルブ","スティーブンソン","ステヴィン","ステファンーボルツマン定数","ステファンーボルツマンの法則","ステラジアン",
            "ステラレーター","ストークス","ストークス線","ストークスの近似","ストークスの抵抗法則","ストークスの定理","ストークスの法則","ストラスマン",
            "ストレンジクォーク","ストレンジネス","ストロボ写真","ストロボスコープ","ストロンチウム","スネル","スネルの法則","スパーク光源",
            "スパークスペクトル","スパッタリング","すばる望遠鏡","スピーカー","スピードメーター","スピン","スピン共鳴","スピン波","スペース望遠鏡",
            "スペクトル","スペクトル型","スペクトル系列","スペクトル項","スペクトル線","スペクトル多重項","スペクトル分析","スペクトロスコープ",
            "スペクトロメーター","滑り抵抗器","滑り摩擦","滑り摩擦係数","スライダック","スライド抵抗器","ずり層","スリット","スリップリング",
            "ずり流れ","ずれ","ずれ応力","ずれ層","ずれ弾性","ずれ弾性係数","ずれ弾性率","ずれ流れ","坐り"];
        ReturnWordArray += wordArray
        
        wordArray = ["静圧","正イオン","星間空間","星間物質","正規分布","制御因子","正極","制御棒","正結晶","正弦","正弦曲線","正弦条件","正弦電流計",
            "正弦波","正弦波の式","正孔","整合","正三角形プリズム","静止衛星","静磁界","静電気","静電力","静電遮蔽","静電単位","静電単位系","静電場",
            "静電偏向型ブラウン管","静電ポテンシャル","静電誘導","静電容量","静電レンズ","制動放射","静特性曲線","正反射","生物学的効果線量",
            "生物工学","生物磁石","生物電池","生物発光","生物物理学","生物ルミネッセンス","静力学","正立像","整流","整流回路","整流管",
            "整流器","整流作用","整流子","ゼーベック","ゼーベック係数","ゼーマン","ゼーマン効果","赤外吸収スペクトル","赤外顕微鏡","赤外線",
            "赤外線写真","赤外線スペクトル","赤外分光計","赤外分光光度計","積算電力量計","積層コンデンサー","積層電池","斥力","セグレ",
            "セシウム","セシウム原子時計","セシウム光電管","セ氏温度","セ氏温度目盛り","節","絶縁体","絶縁破壊","絶縁破壊電圧","接眼レンズ",
            "接合面","摂氏温度","接触角","接触抵抗","接触電位差","接触電気","節線","接戦","接線応力","接線加速度","絶対温度",
            "絶対温度目盛り","絶対空間","絶対屈折率","絶対誤差","絶対湿度","絶対単位系","絶対熱電能","絶対零度","接地","節点","摂動",
            "Zボソン","Ｚ粒子","接平面","SEM","セラミックコンデンサー","セリウム","セルシウス","セルシウス温度","ゼルニケ","CERN",
            "セレン","セレン整流器","零位法","全圧","遷移","遷移確率","遷移金属","遷移元素","線エネルギー付与","全音階","遷音速",
            "前期量子論","線形加速器","線形素子","線形粘弾性","旋光異常分散","旋光性","旋光分散","センサー","船首波","線スペクトル",
            "線積分","選択規則","選択吸収","選択則","選択反射","選択律","剪断","剪断応力","剪断層","剪断弾性係数","剪断弾性率","先端放電",
            "剪断乱流","剪断流","センチ","全地球測位システム","潜熱","全波整流回路","全反射","全反射プリズム","線膨張","線膨張率","ぜんまい秤",
            "線密度","鮮明度","線量","線量計","線量限度","線量当量","線量当量限度"];
        ReturnWordArray += wordArray
        
        wordArray = ["素因数分解","相","像","総圧","増圧器","騒音","騒音計","増感","双眼鏡","双眼顕微鏡","増感剤","双極子","双極子モーメント",
            "相互インダクタンス","相互コンダクタンス","相互作用","相互誘導","相互誘導係数","走査","走査型超音波顕微鏡","走査型電子顕微鏡",
            "走査型トンネル顕微鏡","双軸結晶","双晶","増殖率","増殖炉","送信器","相対運動","相対屈折率","相対原子質量","相対誤差",
            "相対湿度","相対性原理","相対性理論","相対速度","相対速度ベクトル","相対標準偏差","相対分子質量","相対論的力学","送電",
            "相転移","相当単振り子","総熱量保存の法則","像のゆがみ","像倍率","造波抵抗","相反定理","増幅","増幅作用","増幅率",
            "相変化","相変態","相補性","像面のまがり","相律","層流","送話器","ゾーン電気泳動","ゾーンプレート","ゾーンメルティング法",
            "ゾーン溶融法","側帯波","測定","速度","速度の合成","速度の分解","速度ベクトル","速度変調管","速度ポテンシャル","束縛運動",
            "束縛電子","束縛力","側波帯","即発中性子","素元波","素子","ソジウム","阻止電圧","阻止能","塑性","塑性歪み","素電荷",
            "素電池","ソナー","疎部","ソファー","ソフトウェア","ソフトフォノンモード","ソフトモード","疎密波","ソリトン","素粒子",
            "素粒子の相互作用","素粒子反応","素粒子物理学","素粒子崩壊","素粒子論","素量","ゾル","ソレノイド","ゾンマーフェルト"];
        ReturnWordArray += wordArray
        
        wordArray = ["ターゲット","ターボ分子ポンプ","ターレス","耐圧","耐圧釜","耐圧びん","第一イオン化エネルギー","第1宇宙速度","第一壁","第一炉壁",
            "第1種永久機関","第Ⅰ種超伝導","対応原理","ダイオード","体温計","ダイカスト","対眼レンズ","大気圧","大気汚染","大規模集積回路",
            "耐久限度","帯構造","第3宇宙速度","対称軸","対称心","帯状スペクトル","対称中心","対称面","帯磁率","体心立方格子","帯スペクトル",
            "体積弾性","体積弾性率","体積粘性","体積ホログラム","体積密度","体積力","帯電","耐電圧","帯電体","大統一理論","ダイナモ",
            "ダイナモ理論","第二イオン化エネルギー","第２宇宙速度","第２種永久機関","第２種超電導体","対物プリズム","対物レンズ","体膨張","体膨張率",
            "ダイヤモンド","ダイヤモンド格子","太陽エネルギー","太陽系","太陽光発電","太陽電池","太陽電波","太陽灯","太陽ニュートリノ","太陽炉",
            "対流","対流圏","対流電流","ダイン","タウオン","τ粒子","ダウンクォーク","タウンズ","タウ・ニュートリノ","楕円","楕円軌道",
            "楕円軌道の法則","楕円偏光","打楽器","タキオン","打撃の中心","多結晶","多原子分子","多光子解離","多光子励起","タコメーター",
            "多時間理論","多重項","多重散乱","多重線","多重度","多重発生","多重反響","多重反射","ダストコア","多相交流","多層膜コンデンサー",
            "多体問題","脱出速度","縦振動","縦波","ダニエル","ダニエル電池","ダビソン","WMAP","W値","Wボソン","W粒子","ダブルブリッジ",
            "多変量解析","タム","ダランベール","ダランベールの原理","タリウム","ダルソンバール検流計","ダレーン","たわみ","たわみ性","単位",
            "単位系","単位格子","単位電荷","単位胞","単核種元素","単極電位","単極誘導","タングステン","タングステンランプ","多結晶","多原子分子",
            "端子","単磁極","単軸結晶","端子電圧","単純音","単純格子","単純単位格子","単色計","単色収差","単振動","弾性","弾性エネルギー",
            "弾性緩和","弾性係数","弾性限界","弾性散乱","弾性衝突","弾性振動","弾性体","弾性定数","弾性波","弾性ヒステリシス","弾性疲労",
            "弾性余効","弾性率","弾性力","弾性履歴現象","炭素","炭素アーク灯","単相交流","炭素年代測定法","担体","タンタル","弾道曲線",
            "弾道検流計","断熱圧縮","断熱温度上昇","断熱過程","断熱近似","断熱消磁","断熱定理","断熱反応","断熱不変量","断熱変化",
            "断熱膨張","短波","短波障害","単巻可変変圧器","単巻変圧器","断面積","短絡"];
        ReturnWordArray += wordArray
        
        ReturnWordArray = ["チュレンコフ","チュレンコフ計数管","チュレンコフ放射","遅延回路","遅延中性子","チェンバレン","遅延ポテンシャル","地温勾配","地殻",
            "地殻熱流量","力","力の大きさ","力の合成","力の作用点","力の三角形","力の三要素","力の成分","力の多角形","力の単位","力のつり合い",
            "力の場","力の分解","力のベクトル","力の向き","力のモーメント","地球磁界","地球磁場","地球の質量","地球物理学","逐次近似法",
            "逐次処理","蓄電器","蓄電池","地衡流","地磁気","地磁気変動","地磁気脈動","チタン","縮まない流体","縮む流体","窒素",
            "地電流","地動説","地熱発電","遅発中性子","地平面","チャームクォーク","着氷","着力点","チャドウィック","中間子","中間子原子",
            "中間子論","中規模集積回路","中心力","中性子","中性子源","中性子散乱","中性子星","中性子回折","中性子線回折","中性子束",
            "中性子爆弾","中性子捕獲","中波","中立面","中和","超イオン導電体","超ウラン元素","超遠心機","超遠心分離","超音速流","超音波",
            "超音波干渉計","超音波顕微鏡","超音波洗浄機","超音波測深","超音波探傷","超弦理論","超ひも理論","超高圧水銀灯","超高圧電子顕微鏡",
            "超高圧の発生","超高温","超硬合金","超格子","超高真空","超高層大気","超構造","超格子構造","超高速度","超高電圧電子顕微鏡",
            "超硬物質","超重原子","超重元素","超アクチノイド元素","超常磁性","長焦点レンズ","超新星","潮汐摩擦","超塑性","超大統一理論",
            "超多時間理論","超弾性","超短波","超長波","超低温","超低周波音","超低周波自然電磁波","超伝導","超伝導エレクトロニクス",
            "超伝導現象","超電導磁石","超電導状態","超電導体","超電導物質","超伝導物質","超伝導量子干渉計","長波","超らせん","調律",
            "超流動","張力","張力波","調和振動","調和振動子","調和の法則","チョークコイル","直視プリズム","直接発電","直接力","直線電流",
            "直線波","直線偏光","直巻電動機","直巻発電機","直流","直流回路","直流増幅","直流電圧計","直流電動機","直流電流計","直流発電機",
            "直流ブリッジ","直流モーター","直列共振回路","直列接続","直角プリズム","直角ニコル","チョッパー","沈降速度","沈降平衡","チンダル現象"];
        ReturnWordArray += wordArray
        
        wordArray = ["ツィオルコフスキー","対消滅","対生成","通信","電気通信","ツェナー効果","疲れ","疲れ限界","疲れ限度","月奇人協会","強い力",
            "つり合い","ツリウム"];
        ReturnWordArray += wordArray
        
        wordArray = ["DRAM","低圧ガス放電","定圧比熱","定圧比熱容量","低圧変化","低圧モル比熱","TEM波","TE波","ディーゼル","ディーゼルエンジン","ディーゼル機関",
            "TH波","TM波","ディオプター","ディオプトリ","低温恒温槽","定格","定格出力","定滑車","抵抗","抵抗温度計","抵抗器","抵抗の接続",
            "抵抗の直列接続","抵抗の並列接続","抵抗率","抵抗率の温度係数","抵抗率の温度変化","抵抗力","ティコ・ブラーエ","定在波","DC",
            "ディジタルウェーブホームレコーダー","ディジタル信号","ディジタル通信","ディジタル方式","低周波","低周波増幅","低周波発振器","定常状態",
            "定常電流","定常波","定常流","定性分析","定積気体温度計","定積式","定積比熱","定積変化","定積モル比熱","D線","D層",
            "低層水","低速中性子","低速電子線","低電圧アーク","デイビー","定偏角プリズム","定方位成長","ディメンジョン","定容式","定容比熱",
            "定容モル比熱","テイラー渦","ディラック","ディラックの多時間理論","ディラックの電子線","ディラック方程式","定量分析","データ圧縮",
            "データ処理","データバス","データベース","テープレコーダー","デカ","デカルト","滴下水銀電極","テクネチウム","てこ","てこの原理",
            "デシ","デシベル","デシメートル波","テスター","デストリオー効果","テスラ","テスラコイル","テスラ変圧器","鉄","デバイ","デバイ温度",
            "デバイーシュラー環","デバイーシュラー法","デバイス","デバイの特性温度","デバイの比熱式","デバッギング","デビッソン","デモクリトス",
            "デューテリウム","デューテロン","デュエンーハントの法則","デュロン","デュロンープティの法則","デュワー","デュワーびん","テラ",
            "寺田寅彦","テラヘルツ波","デリンジャー","デリンジャー現象","δ線","デルタヘドロン","テルビウム","テルル","テレコネクション","電圧",
            "電圧計","電圧計の内部抵抗","電圧降下","転位","電位","電位係数","電位降下","電位勾配","電位差","電位差計","電位走査法",
            "転移熱","電位の傾き","電荷","電界","電解","電界イオン顕微鏡","電界移行","電界効果トランジスター","電解コンデンサー","電解質",
            "電界伝導","電界電量計","電荷移動","電荷移動吸収","電解に関する法則","電界の重ね合わせ","電界の合成","電界の強さ","電界ベクトル",
            "電界放出","電荷結合素子","電荷保存則","電荷保存の法則","転換炉","電気","電気陰性度","電気泳動","電気エネルギー","電気化学",
            "電気化学工業","電気化学的分極","電気化学当量","電気感受率","電気共振","電機子","電気磁気効果","電気四極子","電気遮蔽","電気振動",
            "電気石","電気双極子","電気素量","電気抵抗","電気抵抗温度計","電気抵抗率","電気伝導","電気伝導性","電気伝導体","電気伝導度",
            "電気伝導率","電気二重層","電気歪み","電気振り子","電気分解","電気変位","電気めっき","電気容量","電極","電極電位","電極反応",
            "電気力学","電気力線","電気量","電気量保存の法則","電気力","電気炉","電源","電源の仕事率","点光源","転向力","点弧極","電子",
            "電子移動度","電子移動反応","電子雲","電磁オシログラフ","電子温度","電磁界","電子回折","電子殻","電子加速器","電子管","電磁気学",
            "電子軌道","電子共有結合","電磁気力","電子計算機","電子顕微鏡","電子工学","電子光学","電磁質量","電磁石","電磁シャワー","電子銃",
            "電子親和力","電子スピン","電子スピン共鳴","電子スペクトル","電子線","電子線マイクロアナライザー","電磁相互作用","電磁単位系",
            "電子対結合","電子ニュートリノ","電子波","電磁波","電磁場","電子配置","電磁波のエネルギー","電子ビーム","電磁偏向型ブラウン管",
            "電磁方程式","電子捕獲","電磁ポテンシャル","電子ボルト","電磁ポンプ","電子密度","電弱統一理論","電磁誘導","電磁誘導の法則",
            "電磁流体波","電磁流体発電","電磁流体力学","電磁力","電子冷凍","電子レンズ","電子論","電子回折","電子線回折","展性",
            "電束","電束線","電束電流","電束密度","天体物理学","天体望遠鏡","天体力学","電池","電池の内部抵抗","電着","電鋳","点電荷",
            "伝導","電動機","電動子","電導性ポリマー","天動説","伝導体","伝導電子","伝導電流","電導度","伝導度","伝導度水","伝導率",
            "伝熱","天然ウラン電子炉","天然ガス","天然放射線核種","天然放射線同位体","天然放射能","電波","電場","電場勾配","電波天文学",
            "電場に関するガウスの法則","電場発光","電場ベクトル","電波望遠鏡","天秤","天文単位","電離","電離エネルギー","電離圏","電離作用",
            "電離説","電離層","電離電流","電離度","電離箱","電離平衡","電離放射線","電流","電流計","電流計の内部抵抗","電流磁気効果",
            "電流電圧特性","電流の強さ","電流保存の法則","電流密度","電量計","電力","電力計","電力輸送","電力量","電力量計","転炉",
            "電歪"];
        ReturnWordArray += wordArray
        
        wordArray = ["度","銅","動圧","等圧線","等圧変化","同位元素","同位相","同位体","同位体効果","同位体依存度","同位体存在比","同位体標識",
            "同位体分離","統一場理論","等温圧縮率","等温変化","等価","透過型電子顕微鏡","透過係数","透過性シャワー","等価線量","等加速度運動",
            "動滑車","透過度","透過波","透過率","同期","同期発電機","等極結合","等傾角干渉","統計的解析","統計熱力学","統計力学","等厚干渉",
            "同軸ケーブル","等時性","同重核","同重体","透磁率","導磁率","同心光線束","等積式","等積変化","導線","等速円運動","等速直線運動",
            "等速度運動","同素体","導体","同調","同調回路","動的RAM","等電位線","等電位面","導電率","動電力","動特性曲線","動粘性率",
            "動粘性","導波管","頭部波","等方性","等ポテンシャル面","動摩擦","動摩擦係数","動摩擦式","等容式","等容線","動力学","動力学的性質",
            "倒立顕微鏡","倒立像","当量","動力用原子炉","動力炉","トーションバランス","ドーピング","ドープ","トカマク","特異点","特殊相対性理論",
            "特性インピーダンス","特性X線","特性温度","特性吸収帯","特性曲線","特性方程式","閉じた系","度数法","戸塚洋二","特許","突発性電離層撹乱",
            "トップクォーク","突沸","ドップラー","ドップラー効果","凸面鏡","凸レンズ","トナー","ドナー","ド・フォレスト","ド・ブロイ","ド・ブロイ波",
            "ド・ブロイ波長","トムソン","トムソン管","トムソン効果","トムソン散乱","トムソンの原子模型","トムソンの実験","トムソンのモデル","ドメイン",
            "朝永ーシュウィンガー理論","朝永振一郎","ドライアイス","トライポロジー","トラクション","ドラフトチャンバー","トランジェントメモリー","トランジェントレコーダー",
            "トランジスター","トランジスタの父","トランス","トランスデューサー","Transverse Magnetic Wave","トリウム","トリウム系列",
            "トリウム原子炉","トリガー","トリチウム","トリチェリ","トリチェリの真空","トリチェリの定理","トリトン","ドリフト","ドリフト速度","ドリフト不安定性",
            "トル","ドルーデ","ドルトン","ドルトンの原子説","ドルトンの分圧の法則","ドルトンの法則","トルマリン","トレーサー","トレーサビリティー",
            "トロン","トン","トンネル効果"];
        ReturnWordArray += wordArray
        
        wordArray = ["内積","内抵抗","内標準","内部エネルギー","内部エネルギーの変化","内部磁場","内部抵抗","内部電位","内部転換","内部歪み","内部被曝","内部標準",
            "内部摩擦","内力","長岡半太郎","長岡半太郎の原子模型","長岡・ラザフォードのモデル","長さ","長年加速","長年摂動","長年方程式","ナトリウム",
            "ナトリウム炎","ナトリウム線","ナトリウムランプ","斜め衝突","ナノ","ナブラ","鉛","鉛蓄電池","波","波の位相","波のエネルギー",
            "波の回折","波の重ね合わせ","波の重ね合わせの原理","波の干渉","波の屈折","波の合成","波の周期","波の種類","波の振幅","波の速度",
            "波の強さ","波の独立性","波の波長","波の速さ","波の反射","波の方程式","滑らか","軟X線","南部陽一郎"];
        ReturnWordArray += wordArray
        
        wordArray = ["ニオブ","二極管","二極真空管","ニクロム","ニクロム線","二原子分子","二項係数","二項展開","濁り度","ニコル","ニコルプリズム","虹",
            "２次宇宙線","2次X線","2軸結晶","二次コイル","2次相転移","2次電子","2次電子倍増管","2次電子放射","2次電子放出","２次電池","仁科芳雄",
            "二重スリット","二重線","二重振り子","2乗平均速度","２体問題","二中間子論","ニッケル","ニッケルー亜鉛電池","ニッケルーカドニウム電池",
            "ニッケルー水素電池","ニッケルー鉄電池","ニト","2倍音","2倍振動","日本工業規格","ニューコメン","入射角","入射光","入射点","入射波",
            "入射面","ニュートリノ","ニュートリノ振動","ニュートリノ天文学","ニュートロン","ニュートン","ニュートン環","ニュートンの運動の3法則",
            "ニュートンの抵抗法則","ニュートンの粘性の法則","ニュートンの万有引力の法則","ニュートン秒","ニュートンポテンシャル","ニュートン毎ウェーバー",
            "ニュートン毎クーロン","ニュートン毎平方メートル","ニュートン毎メートル","ニュートンメートル","ニュートン力学","ニュートン流動","ニュートンリング",
            "入力","入力インピーダンス","入力抵抗","人間原理"];
        ReturnWordArray += wordArray
        
        wordArray = ["濡れ"];
        ReturnWordArray += wordArray
        wordArray = ["音色","ネール","ネオジム","ネオジム磁石","ネオン","ネオンランプ","ネガ","ネガ像","ネガチブ","ねじ","ねじり秤","ねじれ","ねじれ剛性",
            "ねじれ振動","ねじれ秤","ねじれ振り子","ねじれモーメント","熱","熱陰極","熱運動","熱エネルギー","熱拡散","熱核爆弾","熱核反応",
            "熱核兵器","熱核融合反応","熱可塑性","熱機関","熱機関の効率","熱起電力","熱凝固","熱源","熱硬化性","熱交換","熱交換器","熱効率",
            "熱作用","熱散乱","熱残留磁化","熱写真","熱消磁","熱処理","熱振動","熱線","熱弾性","熱中性子","熱中性子核分裂","熱中性子利用比率",
            "熱中性子炉","熱抵抗","熱電温度計","熱電効果","熱電子","熱電子X線管","熱電子発電","熱電子放出","熱転写紙","熱電堆","熱伝達",
            "熱電対","熱電対真空計","熱電対列","熱伝導","熱伝導真空計","熱伝導率","熱電能","熱天秤","熱電冷却","熱電列","熱の仕事当量","熱媒",
            "熱反応","熱輻射","熱分解","熱平衡","熱放射","熱膨張","熱膨張率","熱ポンプ","熱容量","熱力学","熱力学の第1法則","熱力学の第3法則",
            "熱力学の第2法則","熱力学の第0法則","熱力学ポテンシャル","熱量","熱量計","熱量測定","熱量の保存","熱ルミネッセンス","熱レンズ効果",
            "ネプツニウム","ネプツニウム系列","ネマチック結晶","ネルンスト","ネルンストの定理","燃焼","燃焼管","粘性","粘性係数","粘性抵抗",
            "粘性の法則","粘性率","粘性流体","年摂取限度","年代測定","粘弾性","粘度","粘度計","燃料電池"];
        ReturnWordArray += wordArray
        
        wordArray = ["ノイズ","ノイマン","濃縮","濃縮ウラン","濃縮ウラン原子炉","濃縮燃料","濃淡電池","能率","ノーベリウム","ノーベル","ノーベル賞","ノギス",
            "NOT回路","ノニウス","ノニオン界面活性剤","伸び","伸び弾性率"];
        ReturnWordArray += wordArray
        
        wordArray = ["場","バークラ","バークリウム","バースト","パーセク","パーセル","バーディーン","ハードウェア","ハードディスク","ハートリー","バーニャ",
            "パーマロイ","パーミル","バール","バーン","ハーン","バーンアウト","バイオセラミックス","バイオテクノロジー","バイオマス","倍音","バイオン",
            "媒質","倍振動","ハイゼンベルグ","排他律","π中間子","π電子","バイト","ハイトラー","ハイトラー−ロンドン理論","binary digit",
            "ハイペロン","バイポーラトランジスター","バイメタル","倍率","倍率器","パイロ電気","パイロメーター","パウエル","バウシンガー効果",
            "パウリ","パウリの原理","パウリの排他律","ハウリング","破壊応力","破壊電圧","箔検電器","白色X線","白色光","バグダット電池",
            "白熱電球","爆燃","爆発","爆発限界","薄膜","薄膜の干渉","爆薬","剥離","歯車","波形","波形分析","波源","バス","波数",
            "パスカル","パスカルの原理","弾み車","波束","バソフ","波長","発音体","発火合金","発火点","白金","バックグラウンド放射線",
            "発光","発光スペクトル","発光体","発光ダイオード","発光塗料","発散定理","パッシェン","パッシェン系列","発振","発振回路","発振器",
            "バッテリー","発電機","発熱反応","ハッブルの法則","馬蹄形磁石","波動","波動インピーダンス","波動関数","波動光学","波動性","波動抵抗",
            "波動と粒子の二重性","波動の中心","波動ベクトル","波動方程式","波動力学","ハドロン","バナジウム","ばね","ばね定数","ばねの振動",
            "ばねの弾性エネルギー","ばねの弾性定数","ばね秤","ばね振り子","場の反作用","場の量子論","ハフニウム","ハミルトニアン","ハミルトン",
            "ハミルトン演算子","ハミルトンの運動方程式","ハミルトンの原理","波面","速さ","腹","パラジウム","パラボラアンテナ","パラメータ",
            "パラメトロン","針穴写真機","バリウム","バリオーム","バリオン","馬力","バリコン","バリスター","パリティー","パリティ対称性の破れ",
            "波力発電","バルクハウゼン効果","パルサー","パルス","パルス波","パルス変調","バルマー","バルマー系列","ハレーション","バレル",
            "波連","ハロゲンランプ","power of Hydrogen","バンアレン帯","反響","反強磁性","半金属","反クォーク","半減期","反作用","反磁界","反磁場",
            "反磁性","反磁性体","反磁場","反射","反射角","反射屈折の法則","反射光","反射能","反射の法則","反射波","反射望遠鏡","反射防止膜",
            "反射率","反射炉","搬送波","汎地球測位システム","全地球測位システム","反中性微子","反跳","反跳原子","バン・デ・グラーフ","バンデグラーフ型起電機",
            "反転","反転温度","反電子ニュートリノ","半電池反応","バンド","半透鏡","半導体","半導体記憶素子","半導体検出器","半導体コンデンサー",
            "半導体整流器","半導体素子","半導体ダイオード","半導体レーザー","半透膜","バンドギャップ","バンド構造","バンドスペクトル","バンドパスフィルター",
            "反ニュートリノ","反発係数","反物質","万有引力","万有引力定数","万有引力の法則","反陽子","伴流","反粒子"];
        ReturnWordArray += wordArray
        
        wordArray = ["非圧縮性流体","pH","pn型トランジスター","pn接合","フォトマルチプライヤー","非イオン界面活性剤","p型半導体","BCS理論","B電源","ヒートポンプ",
            "ppm","ppt","pp反応","ppb","P変換","ビーム","ビームスプリッター","ピエゾ効果","ピエゾ素子","ピエゾ電気","非回復性歪み","非可逆電極",
            "非可逆波","非可逆変化","光","光IC","光エネルギー","光エレクトロニクス","光音響効果","光音響スペクトル","光カー効果","光化学","光化学増感",
            "光化学電池","光可逆変色フォトクロミズム","光核反応","光核分裂","光ガルバニ電池","光起電力効果","光吸収","光共振器","光互変","光散乱",
            "光磁気ディスク","光集積回路","光スペクトル","光センサー","光通信","光ディスク","光電池","光伝導","光電離","光透過性樹脂","光の圧力",
            "光の色","光の回折","光の干渉","光の屈折","光の３原色","光の散乱","光のドップラー効果","光の二重性","光の波動説","光の速さ",
            "光の反射","光の分散","光の粒子説","光パラメトリック発振","光ファイバー","光フィルター","光分解","光膨張","光ポンピング","光マップ",
            "光ルミネッセンス","光励起","光慣性系","光局所場","光均質原子炉","非金属","非金属元素","ピクチャー","ピクノメーター","ピコ",
            "比口径","ピコファラド","ビジコン","微視的","比重","比重計","比重秤","比重びん","非晶質","非晶質半導体","微笑振動",
            "ヒステリシス","ヒストグラム","ビスマス","歪み","歪みエネルギー","飛跡","非線形素子","非線形抵抗","非線形粘弾性","比旋光度","ヒ素",
            "皮相電力","比体積","ピタゴラス","非弾性衝突","非直線抵抗","ビッカース硬さ","ピックアップ","ヒッグス粒子","ビッグバン","ビッグバン理論",
            "ピッチブレンド","ビット","ヒットルフ","ヒットルフ数","引張り強さ","引張り粘度","飛程","否定回路","比抵抗","ビデオ周波数",
            "比電荷","非電解質","非点収差","比電離能","比透磁率","ピトー管","非ニュートン流体","比熱","比熱比","比熱容量","非粘性液体","非粘性率",
            "非粘性流体","非粘度","非破壊検査","被曝","火花間隙","火花ギャップ","火花スペクトル","火花放電","微分","微分回転","被変調波",
            "非放射遷移","比放射能","ヒューズ","比誘電率","秒","比容","標準圧力","標準温度","標準気圧","標準光源","標準重力加速度","標準状態",
            "標準状態圧力","標準水素電極","標準抵抗器","標準電球","標準電極電位","標準電池","標準電波","標準波長","標準偏差","標準模型",
            "表色系","描像","氷点","氷点降下","表面圧","表面エネルギー","表面相","表面張力","表面張力波","表面電位","表面波","秤量","避雷針",
            "開いた系","平賀源内","ピラニ真空計","ピリアル係数","ピリアルの式","微粒子","比例限界","比例的誤差","疲労","疲労限界","疲労限度",
            "疲労試験","疲労寿命","ピロ電気","ピンチ効果","ピンホールカメラ"];
        ReturnWordArray += wordArray
        
        wordArray = ["ファーレンハイト","ファインセラミックス","ファインマン","ファジー理論","ファブリー−ペロー干渉計","ファラデー","ファラデー効果","ファラデー定数",
            "ファラデーディスク","ファラデー電流","ファラデーの電気分解の法則","ファラデーの電磁誘導の法則","ファラデーの媒質理論","ファラド","非安定平衡",
            "ファン・デル・ワールス","ファンデルワールスの状態方程式","ファンデルワールス力","ファント・ホッフ","ファントホッフの浸透圧の法則",
            "フィードバック","フィールドレンズ","負イオン","フィゾー","フィゾーの干渉","フィックの拡散法則","フィッショントラック","フィッショントラック年代測定法",
            "フィラメント","フィルター","フィルター回路","フィルム","ブーゲー異常","フーコー","フーコー電流","フーコー振り子","ブースター","風洞",
            "フーリエ","フェーディング","フェザー法","フェムト","フェライト","フェリ磁性","フェルマー","フェルマーの原理","フェルミ","フェルミウム",
            "フェルミ液体","フェルミエネルギー","フェルミオン","フェルミ気体モデル","フェルミ準位","フェルミ−ディラック統計","フェルミ−ディラック分布",
            "フェルミ統計","フェルミの黄金則","フェルミ分布","フェルミ粒子","フェルミ流体","フェロアロイ","フェロ磁性体","フォールアウト",
            "フォトクロミズム","フォトセンサー","フォトダイオード","フォトトランジスタ","フォトマル","フォトマルチプライヤー","フォトルミネッセンス",
            "フォトン","フォトンファクトリー","フォノン","負荷","不可逆過程","不可逆電極","不可逆変化","不確定性原理","負荷量","不完全気体",
            "不完全結晶","不協和音","負極","福井謙一","複屈折","復元力","複合核","複合滑車","副格子","輻射","副尺","副スリット","複素数",
            "復調","復氷","副振り子","複プリズム","複巻電動機","複巻発電機","不純物半導体","不織布","浮心","双子型熱量計","付着","不対電子",
            "伏角","復極","フック","フックの法則","物質","物質の階層構造","物質の三態","物質波","物質不滅の法則","物質量","物性物理学",
            "物性論","フッ素","物体系","ブッデ効果","沸点","沸点上昇","沸騰","沸騰水型原子炉","物理化学","物理学","物理吸着","物理光学",
            "物理探鉱","物理的性質","物理振り子","物理変化","物理量","負抵抗","負電荷","不導体","プトレマイオス・クラウジウス","負の温度",
            "負の仕事","部分格子","不変系","不飽和","ブラーエ","フライホイール","ブラウン","ブラウン運動","ブラウン管","ブラウン管オシロスコープ",
            "フラウンホーファー","フラウンホーファー線","フラウンホーファーの回折","ブラケット","ブラケット系列","ブラシ放電","プラスティック",
            "プラズマ","プラズマの閉じ込め","プラズマ炉","プラセオジム","プラチナ","ブラック","ブラッグ","ブラッグ曲線","ブラッグの式","ブラッグの条件",
            "ブラッグの反射条件","ブラッグ反射","ブラックホール","ブラックホールの蒸発","ブラックボックス","フランク","ブランク","フランク−コンドンの原理",
            "プランク定数","ブランクテスト","プランクの放射式","プランクの量子仮説","プランク分布","フランク−ヘルツの実験","フランクリン","フランシウム",
            "振り子","振り子時計","振り子の等時性","プリズム","プリズム双眼鏡","プリズム分光器","フリッカー雑音","ブリッジ型回路","ブリッジマン",
            "ブリネル硬さ","プリュッカー","ブリュッカー管","浮力","浮力の中心","プリンキピア","フリンジ","フリントガラス","ブルースター角","ブルースターの干渉縞",
            "ブルースターの法則","プルトニウム","プルトニウム原子炉","ブルドン管圧力計","プルフリッヒ屈折計","フレーム熱量計","フレネル","フレネル・ゾーンプレート",
            "フレネルの回折","フレネルの複プリズム","フレネルの法則","フレネル−ホイヘンスの原理","フレネルレンズ","ふれの角","フレミング","フレミング左手の法則",
            "フレミング右手の法則","ブレンステッド","不連続流","プログラム","フロッピーディスク","ブロッホ","プロトアクチニウム","プロトン","プロメチウム",
            "分圧","分圧の法則","分解","分解電圧","分解能","分極","分極電荷","分極電流","分極率","文献調査","分光学","分光感度","分光器","分光計",
            "分光光度計","分光プリズム","分光分析","分散","分散度","分散能","分散率","分子","分子運動","分子運動論","分子間力","分子結晶","分子構造",
            "分子式","分子磁石","分子スペクトル","分子説","分子線","分子熱","分子の運動エネルギー","分子ビーム","分子力場","分子量","ブンゼン",
            "分速度","フントの規則","分巻電動機","分巻発電機","粉末法","噴流","分流器","分力","分路"];
        ReturnWordArray += wordArray
        
        wordArray = ["閉回路","閉殻","平滑回路","閉管","閉管式圧力計","閉管の振動","平均加速度","平均自由行程","平均自由行路","平均２乗速度","平均の速さ",
            "平均分子量","平均律","平衡","平行線","平行光線束","平行光束","平行四辺形の法則","平行電流間にはたらく力","平行ニコル","平行板コンデンサー",
            "閉鎖系","並進運動","閉電流","平板コンデンサー","平板蓄電池","平面回折格子","平面角","平面鏡","平面内の衝突","平面波","平面偏光",
            "平面ホログラム","平面力","並列共振回路","並列接続","ベーコン","ベース","ベース−エミッター間電圧","ベース電流","β壊変","β線",
            "ベータトロン","β＋崩壊","β崩壊","βー崩壊","β粒子","ベーテ","pH","ペーパーコンデンサー","ベールの法則","冪","劈開","冪乗",
            "ヘクト","ヘクトパスカル","ベクトル","ベクトル積","ベクトルの分解","ベクトル場","ベクトル量","ベクレル","ヘス","ヘスの法則",
            "ペタ","ベッセル","ヘテロダイン","ペラン","ヘリウム","ヘリウムの核融合反応","ベリリウム","ベル","ヘルツ","ヘルツシュプルング−ラッセル図",
            "ヘルツの実験","ペルティエ","ペルティエ効果","ベルデ定数","ベルヌーイ","ベルヌーイの式","ベルヌーイの定理","ヘルムホルツ",
            "ヘルムホルツエネルギー","ヘルムホルツ共鳴器","ヘルムホルツの自由エネルギー","変圧器","変位","変位電流","偏角",
            "変曲点","偏極率","変形","変形応力","偏光","偏光角","偏光器","偏光計","偏光顕微鏡","偏光子","偏向電圧","偏向ニコル",
            "偏向板","偏光板","偏光フィルター","偏光プリズム","偏光面","ペンタダハプリズム","ペンタプリズム","変調","変調波",
            "ベンデルレーズング干渉縞","変動係数","偏波","変分原理","ヘンリー"];
        ReturnWordArray += wordArray
        
        wordArray = ["ポアズ","ポアソン","ポアソンの法則","ポアソン比","ポアンカレ","ホィートストン","ホイートストンブリッジ","ホイゲンス",
            "ホイヘンス","ホイヘンスの原理","ホイヘンスの波動説","ホイヘンス振り子","ホイヘンス−フレネルの原理",
            "ボイル","ボイル・シャルルの法則","ボイルの法則","ボイル−マリオットの法則","ポインティングベクトル",
            "方位","方位角","方位磁石","方位磁針","方位量子数","望遠鏡","望遠レンズ","崩壊","崩壊曲線",
            "崩壊系列","崩壊図式","方解石","崩壊定数","ホーキング","方向と向き","放射","放射圧","放射力",
            "放射エネルギー","放射化学","放射化分析","放射計","放射光","放射性核種","放射性系列",
            "放射性原子","放射性原子核","放射性元素","放射性降下物","放射性指示薬","放射性同位核",
            "放射性同位元素","放射性同位体","放射性トレーサー","放射性廃棄物","放射性反跳","放射性物質",
            "放射性崩壊","放射性崩壊系列","放射線","放射線化学反応","放射線感受性","放射線計数管",
            "放射線源","放射線効果","放射線殺菌","放射線遮蔽","放射線重合","放射線障害","放射線照射",
            "放射線照射食品","放射線帯","放射線治療","放射線の利用","放射線量","放射線量計","放射抵抗",
            "放射熱","放射能","放射能の強さ","放射能標識","放射能平衡","放出スペクトル","法線",
            "法線応力","法線加速度","法線速度","ホウ素","ホウ素電離箱","膨張宇宙","膨張計",
            "膨張波","膨張率","放電","放電管","放電箱","放物運動","放物線","放物面鏡","飽和",
            "飽和磁化","飽和蒸気","飽和電流","飽和溶液","ボーア","ボーア磁子","ボーアの仮説","ボーアの原子模型",
            "ボーアの振動数条件","ボーアの量子条件","ボーア半径","ボース-アインシュタイン凝縮",
            "ボース-アインシュタイン統計","ボース-アインシュタイン分布","ボース凝縮","ボース統計",
            "ボース分布","ボース粒子","ボーテ","ボーメ比重計","ポーラロイド","ポーラログラフィー",
            "ポーラログラム","ポーリング","ポーリングの電気陰性度","ホール","ホール効果","ホール素子",
            "ホール電圧","ボールベアリング","捕獲反応","ポジ","ポジティブ","ポジトロン","補色",
            "補助単位","保磁力","補正","ボゾン","保存の法則","保存力","保存力の場","ボタン型電池",
            "ポッケルス効果","ポッケルスセル","ホットアトム","ホットアトム化学","ホットラボラトリー",
            "ポテンショスタット","ポテンシオメーター","ポテンシャル","ポテンシャルエネルギー",
            "ポテンシャル曲線","ポテンシャル障壁","potential Hydrogen","ホドグラフ","ホトクロミズム",
            "ホトトロピー","ボトムクォーク","ポラリメーター","ポラロイドフィルム","ボリューム",
            "ボルタ","ボルタ効果","ボルタ電位","ボルタ電堆","ボルタ電池","ボルタの法則","ボルタメーター",
            "ボルタンメモリー","ボルツマン","ボルツマン定数","ボルト","ボルトアンペア","ボルトメーター",
            "ホルミウム","ボルン","ホログラフィー","ポロニウム","ボロメーター","ボンスレ","本多光太郎"];
        ReturnWordArray += wordArray
        
        wordArray = ["マイクロ","マイクロカプセル","マイクロ波","マイクロ波発振ダイオード","マイクロファラド",
            "マイクロフォン","マイクロメーター","マイクロメートル","マイクロ粒子","マイケルソン",
            "マイケルソン干渉計","マイケルソン-モーリーの実験","マイスナー効果","マイトナー","マイヤー",
            "マイヤーの関係","巻き数","マクスウェル","マクスウェルの速度分布則","マクスウェルの魔物",
            "マクスウェル分布","マクスウェル方程式","マクスウェル-ボルツマン分布","マグデブルクの半球",
            "膜電位","マグナス効果","マグヌス効果","マグネシウム","マグネタイト","マグネトロン",
            "マクミラン","マクラウド真空計","マクロ","曲げ","曲げ剛性","曲げモーメント",
            "摩擦","摩擦角","摩擦係数","摩擦抵抗","摩擦電気","摩擦熱","摩擦の法則","摩擦力",
            "摩擦ルミネッセンス","マジックハンド","益川敏英","マススペクトル","マススペクトロメトリー",
            "マスフィルター","マッハ","マッハ数","マッハの原理","マッハ波","マトリックス力学",
            "マニピュレーター","マノメーター","マリオットの法則","マリケンの電気陰性度",
            "マリュス","マルコーニ","マルチバース","マンガン","マンガン乾電池","マンガン鋼",
            "マンハッタン計画"];
        ReturnWordArray += wordArray
        wordArray = ["見掛けの力","右ねじの法則","ミクロ","ミクロン","水","水減速型原子炉","密度",
            "密度勾配不安定性","ミューオン","μ中間子","ミューニュートリノ","μ粒子","ミュッセンブルーク",
            "ミリ","ミリカン","ミリカンの実験","ミリカンの油滴実験","ミリ波","ミンコフスキー"];
        ReturnWordArray += wordArray
        wordArray  = ["迎え角","無機高分子","向きと方向","無響室","無極性分子","無極放電","無次元量",
            "無指向性アンテナ","虫めがね","無重力状態","無重力","無重力状態","無声放電","無秩序",
            "無定位検流計","無定形","無電極放電","無輻射遷移","無誘導抵抗"];
        ReturnWordArray += wordArray
        
        wordArray = ["眼","鳴音","明視距離","メイヤー","メーザー","メートル","メートル原器","メートル波",
            "メートル毎秒","メガ","メガ電子ボルト","メスバウアー","メスバウアー効果","メソン",
            "メタ磁性","メッシュ","メニスカス","メル","メル尺度","メルセンヌ","メルトダウン",
            "面心立方格子","面積速度","面積速度一定の法則","面積分","メンデレーエフ",
            "メンデレビウム","面内磁化膜","面密度"];
        ReturnWordArray += wordArray
        
        wordArray = ["毛管","毛管現象","毛細管","毛細管現象","毛髪湿度計","モー","モース","モース硬さ数",
            "モースの硬度計","モーズリー","モーズリーの法則","モーゼ効果","モーター","モーペルテュイの原理",
            "モーメント","モーリー","モールス","モールス信号","模擬実験","模型","模型実験","MOS素子",
            "MOX","モックス","モット","モデル","モデレーター","モナザイト","モナズ石","モノクロメーター",
            "モノコード","モリブデン","モル","モル磁化率","モル質量","モル体積","モル熱","モル濃度",
            "モル比熱","漏れ磁束","もろさ"];
        ReturnWordArray += wordArray
        
        wordArray = ["ヤード・ポンド法","Yagiアンテナ","焼入れ","焼なまし","焼ならし","八木秀次","焼もどし",
            "冶金","柔らかいX線","ヤング","ヤングの実験","ヤング率","ヤンセン"];
        ReturnWordArray += wordArray
        
        wordArray = ["UHF","融解曲線","融解点","融解熱","有機ガラス","有機蛍光体","誘起双極子","有機超伝導体",
            "有機導体","有機半導体","有極性分子","ユークリッド","有効質量","有効磁場","有効数字",
            "有効スリット幅","有効電力","U字管圧力計","誘磁率","融点","誘電損失","誘電体",
            "誘電分極","誘電率","誘電起電力","誘導係数","誘導コイル","誘導電界","誘導電動機",
            "誘導電流","誘導物理量","誘導放射能","誘導放出","誘導モーター","誘導ラマン散乱",
            "誘導リアクタンス","誘導炉","誘発放射能","ユーリー","ユウロピウム","湯川秀樹","輸送現象",
            "油滴実験","ゆらぎ","輸率","湯沸かし型原子炉","ユングナー電池"];
        ReturnWordArray += wordArray
        wordArray = ["陽イオン","陽イオン界面活性剤","陽イオン交換樹脂","陽画","溶解熱","陽極","陽極線",
            "陽子","陽子散乱","陽子シンクロトロン","陽子崩壊","ヨウ素","陽電子","陽電子放出",
            "揺動","容量電流","容量リアクタンス","揚力","ヨクト","余弦","横振動","横波",
            "横波の振動","４次元空間","余色","ヨタ","4つの力","よどみ点","弱い力"];
        ReturnWordArray += wordArray
        
        wordArray = ["ラーメン構造","ラーモア","ラーモア歳差運動","雷管","ライデンびん","ライフサイエンス",
            "ライプニッツ","ライマン","ライマン系列","ライマン線","ラウール","ラウールの法則",
            "ラウエ","ラウエの条件","ラウエ斑点","ラウエ法","落体の運動","ラグランジュ",
            "ラグランジュの運動方程式","ラザフォード","ラザフォード散乱","ラザフォードの原子模型",
            "ラジアン","ラジアン毎秒","ラジウム","ラジオアイソトープ","ラジオグラフィー",
            "ラジオゾンデ","ラジオトレーサー","羅針盤","螺旋軸","落下運動","ラド","ラドン","ラブ波",
            "ラプラス","ラボアジエ","ラマン","ラマン散乱","ラマンスペクトル","ラマン分光法",
            "ラミの定理","ラム","RAM","ラムシフト","ラムスデン接眼レンズ","ラムゼー","ラムゼー−ヤングの規則",
            "ラムダ転移","Λ粒子","ラングミュア","ラングミュアの吸着等温式","乱雑さ","ランジュヴァン",
            "乱数","乱数列","ランダウ","ランダウ反磁性","ランダウゆらぎ","ランタノイド","ランダムウォーク",
            "ランタン","ランタン系列","乱反射","ランフォード","ランベルト","ランベルトの法則",
            "ランベルト−ベールの法則","乱流","乱流粘性"];
        ReturnWordArray += wordArray
        
        wordArray = ["リアクター","リアクタンス","リアクトル","リーケージトランス","李政道","理化学研究所",
            "力学","力学的エネルギー","力学的エネルギー保存の法則","力積","力積のモーメント",
            "力線","力対","力場","力率","リサージュの図形","離散値","理想気体","理想気体の状態方程式",
            "理想結晶","理想導体","理想溶液","理想流体","リチウム","リチウム・イオン電池",
            "リチウム電池","リチャードソン","リチャードソン効果","立体角","立体鏡","リッツ",
            "リッツの結合原理","リットル","リニアアクセラレーター","リニアモーター","粒子加速器",
            "粒子性","粒子線","粒子線回折","粒子多重度","粒子と波動の二重性","流線","流線型",
            "流束","流速計","流体","流体静力学","流体動力学","流体の抵抗","流体の剥離","流体摩擦",
            "流体力学","粒度","流動応力","流動層","粒度分析","リュードベリ","リュードベリ定数",
            "流量計","量子","量子エレクトロニクス","量子化","量子拡散","量子条件","量子数","量子力学",
            "量子論","リラクタンス","リレー","リレーレンズ","履歴","理論物理学","リン","臨界",
            "臨界圧","臨界温度","臨界角","臨界現象","臨界質量","臨界状態","臨界点","臨界比体積",
            "臨界量","リングレーザー","りん光","輪軸"];
        ReturnWordArray += wordArray
        
        wordArray = ["累乗","ルヴェリエ","ルーペ","ルーメン","ルクス","ルクス計","ルクランシュ電池",
            "リテチウム","ルテニウム","ルビーレーザー","ルビジウム","ルミネッセンス"];
        ReturnWordArray += wordArray
        
        wordArray = ["零位法","冷陰極","励起","励起状態","冷却材","冷却水","励磁電極","零点エネルギー",
            "レイノルズ数","レイリー","レイリー散乱","レイリー−ジョーンズの放射法則","レイリー波",
            "レイリー板","レーザー","レーザー核融合","レーザープリンタ","レーザー分光",
            "レーザーラマン分光法","レーザー冷却","レーダー","レーナルト","レーナルト線",
            "レーマー","レオスタット","レオロジー","瀝青ウラン鉱","レジスト","レストシュトラーレ帯",
            "劣化ウラン","レニウム","レプトン","レベデフ","レム","連鎖反応","レンズ","レンズの式",
            "レンズフレア","連成振動","連続X線","連続吸収スペクトル","連続信号","連続スペクトル",
            "連続波","レンツ","連通管","レンツの法則","レントゲン","レントゲン線"];
        ReturnWordArray += wordArray
        
        wordArray = ["漏洩磁束","漏洩変圧器","ρ中間子","ロータリーキルン","ロータリーポンプ","ローレンシウム",
            "ローレンス","ローレンツ収縮","ローレンツ変換","ローレンツ力","濾過","録音",
            "６０度プリズム","ロケット","露光","瀘光器","ロジウム","露出度","露出率",
            "ロシュミット数","ロション・プリズム","炉心","炉心溶融","ロックウェル硬さ数",
            "ロッシ","露点","濾波器","ROM","ロンドン","論理回路"];
        
        wordArray = ["ワイス","ワイスコップ","ワイセンベルク効果","ワイツゼッカー","歪力","ワイル",
            "ワインバーグ−サラム理論","惑星","惑星地球物理学","惑星の運動","惑星の法則","環磁石",
            "ワット","ワット時","ワットメーター","ワルトン"];
        ReturnWordArray += wordArray
        
        
        
        
        
        
        
        return ReturnWordArray
    }
}
